[
  {
    "no": 0,
    "date": "2017-06-15 04:21:36",
    "fromNow": "9 days ago",
    "user": 0,
    "name": "Priscilla Kimboko",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good clear advice and examples...I mostly listened all the way through, but plan to go back and do all the exercises. Also will take current writing project and apply these ninja strategies."
  },
  {
    "no": 1,
    "date": "2017-05-24 04:21:36",
    "fromNow": "a month ago",
    "user": 1,
    "name": "Sławomir Leśniewski",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It reminds me the lessons I have learned in Polish language. In my opinion - the course is very useful - because of its well-prepared structure and suggestive topic order."
  },
  {
    "no": 2,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 2,
    "name": "Emma Gallimore",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Fabulous course that helps you think deeply about your choices while writing. Full of great examples. Delivered by a knowledgeable professor who inspires confidence. I will revisit this course often."
  },
  {
    "no": 3,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 3,
    "name": "Rupa Sharat Kumar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has drawn my attention to many subtle nuances in writing which I did not pay attention to before. While I write this comment I am drawn to recollect and apply all that I have learnt in the course :-). Thank you for the well structured and well rounded material."
  },
  {
    "no": 4,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 4,
    "name": "Peter Flasko",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I took the mastering writing course first so had learned much of the detail already. The best part of this course is to hear many of the details of the mastery course in different words, and especially to \"sit-back\" and observe examples."
  },
  {
    "no": 5,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 5,
    "name": "Kadija Ahmed",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani Raja articulated previously inexplicable instincts. Ninja Writing provides concise, yet comprehensive and applicable techniques. I enjoyed this course and look forward to more."
  },
  {
    "no": 6,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 6,
    "name": "Kate Rose",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative. A great class to add polish and style to your prose, as well as provide a foundation to build a substantial writing upon."
  },
  {
    "no": 7,
    "date": "2017-06-07 04:21:36",
    "fromNow": "17 days ago",
    "user": 7,
    "name": "Ahmad Hajeer",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Ninja writing is the most beneficial writing course i have ever attended. My writing is much better now because of you Shani.Thank you very much."
  },
  {
    "no": 8,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 8,
    "name": "Sung Pyon",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course! I've learned a lot, feel more confident, able to use it to improve my writing immediately and spot improvement opportunities on what I read."
  },
  {
    "no": 9,
    "date": "2017-05-31 04:21:36",
    "fromNow": "24 days ago",
    "user": 9,
    "name": "A K M Mainul Islam",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative, friendly, and in-depth presentation. This course will surely boost my writing skills, I desperately needed."
  },
  {
    "no": 10,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 10,
    "name": "Eric Cartagena",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani Raja does an excellent job exposing different writing strategies and methods. For writers seeking to improve their writing skills, this course is definitely an essential."
  },
  {
    "no": 11,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 11,
    "name": "Gary Mullens",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is one fantastic course. It delivered on each and every promise. Get this course today and you'll write better tomorrow."
  },
  {
    "no": 12,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 12,
    "name": "Steve Kraus",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A very methodical approach to improving your writing at all levels -- sections, paragraphs, sentences, and words.  And, plenty of chances to apply what you are being taught in exercises where you get a chance to take your own shot at improving a piece of writing, and then compare your results to the instructor's answer.  I personally find this a very effective way to learn, while also actually applying the material (vs. just listening or taking notes)."
  },
  {
    "no": 13,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 13,
    "name": "James Edwin Gibson",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course nicely covers ways to improve one's writing by editing a piece's overall narrative, paragraphs, sentences, and individual words."
  },
  {
    "no": 14,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 14,
    "name": "Adam White",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "My third course completed with Shani.Absolutely invaluable writing skills & knowledge he shares at an exceptional price.Thanks again! I also have a further three (notice: three and not 3?) courses I've paid for and am looking forward to getting stuck into."
  },
  {
    "no": 15,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 15,
    "name": "Lorna Croft",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I learned a lot from this course to help me in my writing. The course structure and the content within it added a lot to my understanding of what it takes to create a worthy piece of text."
  },
  {
    "no": 16,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 16,
    "name": "Chris Stuke",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Quick, to the point lectures. Writing tools that are easy to remember and implement. The only aspect I'd change is that a lot of the example works are business oriented which can lead to a disconnect in understanding the teaching content."
  },
  {
    "no": 17,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 17,
    "name": "Zach Taylor",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani is a superb teacher. His lessons are clear, constructive, and will—without a doubt—turn you into a more perceptive reader and a better writer. Plus he kind of looks like Obama when he squints. Don't miss out. Take this course."
  },
  {
    "no": 18,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 18,
    "name": "Simon Tang",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course was very in-depth and contains so many great concepts. There were only 2 things that I wasn't a huge fan of. 1, I felt a lot of the material dealt with editing rather than writing. 2, the focus of the writing, in my opinion, focused mostly on smaller pieces of work (journal articles, statements, blog posts, etc.), while I'm interested in book writing. However, with all of the strategies that were presented, I'll be able to figure it out on my own. All in all, great course!"
  },
  {
    "no": 19,
    "date": "2017-05-24 04:21:36",
    "fromNow": "a month ago",
    "user": 19,
    "name": "Anne Chan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great in-depth instruction on writing from all aspects, with good examples for illustration!"
  },
  {
    "no": 20,
    "date": "2017-06-09 04:21:36",
    "fromNow": "15 days ago",
    "user": 20,
    "name": "Reagan Von Wolf",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Ninja Writing is informative, transformative, and simple. As a writing student IRL, I find this course more intriguing and substantial than the classes I drive to. That I am in my pajamas, rocking shocking bedhead, is merely a bonus."
  },
  {
    "no": 21,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 21,
    "name": "Luthfi Zharif",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As a people who don't jump deep into a writer's career, I find this course really informative. This course gave me a clear understanding of how to write easily and efficiently. Besides that, there's also many tips to heightened your writing skill to next level. Thank you!"
  },
  {
    "no": 22,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 22,
    "name": "Ibrahim Halilu Abubakar",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A very good course for writers and aspiring writers. Its rapid, crisp to the point teaching style is amazing. Its more of an advanced level writing course. I wish i took the writing with flair before taking this particular course. Nevertheless, it was quite beneficial."
  },
  {
    "no": 23,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 23,
    "name": "Ronald Graham",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Enjoyed course. Thought early lectures the most informative. Later lectures seemed lighter and without specific substance. Too general and ambiguous. I would trim the fat and leave only the lean. But, overall, it was a helpful experience. Certainly worth it for those who have never had this inside view of the writing process."
  },
  {
    "no": 24,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 24,
    "name": "Anwar Parvez",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I would recommend creating a summary of all instructions - and create a one pager so writers can follow along when they write. Its easy to forget the chapters and their lessons in real life. Otherwise, very engaging lessons."
  },
  {
    "no": 25,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 25,
    "name": "Tam Dang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The teacher delivered a super detailed strategy for me to feel that writing suits everyone. Anybody should give it a try and see where it leads you. For me, it reminds me of editing editing and editing until I feel satisfied. Nothing looks like a burden but indeed such a good experience!"
  },
  {
    "no": 26,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 26,
    "name": "Vaishakhi B",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I liked the course for three reasons1. It was very well structured. I liked how ir started at the narrative level and moved down to a granular word level. 2. The examoles and the solutions were relevant 3. It had a very easygoing teaching style. I'd probably go through it again!"
  },
  {
    "no": 27,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 27,
    "name": "Margaret Gill",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course was well organized and thorough in content without being overwhelming. The instructor was inspiring. I have increased my writing speed and feel more confident in submitting my work to readers. I look forward to taking more courses from this instructor."
  },
  {
    "no": 28,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 28,
    "name": "Eric Normington",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The material in this course is thorough and extensive. At times this can slow progress, and it becomes repetitive in places.Overall, a worthwhile course to undertake, especially if you are being offered this on a discount."
  },
  {
    "no": 29,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 29,
    "name": "Nina Christesen",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent content for non-fiction business orientated material. Teaching is well structured. Style slow but appropriate to content. It would help with a .pdf workbook that includes ALL written exercises with space for students to add their responses."
  },
  {
    "no": 30,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 30,
    "name": "Faraz Akhtar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an amazing course. Before starting, I recommend starting \"writing with flair\"; this course builds off of the other course - I didn't realize this until I got to the sentence sections.."
  },
  {
    "no": 31,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 31,
    "name": "Ann Horn",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Simple straightforward message, very easy to understand. Great examples paints an even fuller picture. Looking forward to my journey towards better writing."
  },
  {
    "no": 32,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 32,
    "name": "Pauline Bryan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I now have a new perspective to how I approach my writing. I am keen to start practicing and applying the tools provided through this course. thank you."
  },
  {
    "no": 33,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 33,
    "name": "Ahmed Chaatouf",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Love it. Watching this course repeatedly and my writing keeps on improving."
  },
  {
    "no": 34,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 34,
    "name": "Felipe Fggordon@me.com Gonzalez-Gordon",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "this is the second course that I take from this instructor and I am going to start the third. Ideal for your train commute to work. Just pay attention and do the few excersices prescribed to fix the concepts in your head."
  },
  {
    "no": 35,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 35,
    "name": "Esther Wandia",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Valuable course. Gives me all the information I need to improve my writing."
  },
  {
    "no": 36,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 36,
    "name": "John Aslinger",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Unbelievably good.  After years of my writing suffering from any sort of je nais se quoi, Ninja Writing's lectures and exercises have helped me build a foundation not just for compelling arguments but a captivating presence.  This is hands down my favorite Udemy course."
  },
  {
    "no": 37,
    "date": "2017-06-02 04:21:36",
    "fromNow": "22 days ago",
    "user": 37,
    "name": "Consuelo M Harris",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lessons were clear and concise, and so pointed that understanding was immediate. Mr, Raja has simplified the act of writing for me by teaching me to focus on the message and its meaning. i haven't time to be bored as I follow Mr. Raja's pace. Thank you, sir, & Udemy!"
  },
  {
    "no": 38,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 38,
    "name": "Feathers Scott",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Please do not hesitate with buying this course! Truly helpful, actionable and for people serious about bettering their writing."
  },
  {
    "no": 39,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 39,
    "name": "Joseph Malgeri",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far, so good. I'm being led by the mind to experience the essential elements of structure in a way that creates memorable imagery. Onward."
  },
  {
    "no": 40,
    "date": "2017-06-10 04:21:36",
    "fromNow": "14 days ago",
    "user": 40,
    "name": "Jimmi Wright",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The pacing is great, his explanations are thorough and clear."
  },
  {
    "no": 41,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 41,
    "name": "Steve Young",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Comprehensive review of writing basics and detailed explanation of techniques to improve comprehension and elegance of your writing."
  },
  {
    "no": 42,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 42,
    "name": "Syed Arif Hasan",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very interesting. The course has been developed in an easy and logical manner which  enhances one's knowledge of effective writing"
  },
  {
    "no": 43,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 43,
    "name": "Emmanuel Tabones",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far so good! Shani Raja's Ninja writing course is very thought-provoking and I have learned a great deal!"
  },
  {
    "no": 44,
    "date": "2017-06-06 04:21:36",
    "fromNow": "18 days ago",
    "user": 44,
    "name": "Modongyun",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "great lectures, help me improve writing skills"
  },
  {
    "no": 45,
    "date": "2017-06-14 04:21:36",
    "fromNow": "10 days ago",
    "user": 45,
    "name": "Daniel Peacock",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Wonderfully structured course thus far. Only suggestion would be to include more opportunities or advise for making the different practices taught here become more instinctual."
  },
  {
    "no": 46,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 46,
    "name": "Mr. Adeel Abbas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani Raja, is perhaps, the best mentor for writers, both naive and enthusiastic. This course allowed me to recall lost tactics of writing appropriately and polished my writing skills to perfection.I thank Shani Raja for making this course.However, if Shani Raja could write a script for his video (my opinion), it would make the content much more engaging than it already is.Tom Geller is the perfect example for that engagement I expect."
  },
  {
    "no": 47,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 47,
    "name": "S. Matkovic",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good examples, good explains, easy to track. I learned many new things. Now my writing is at a higher level. Readers have noticed a change and they gave me an excellent mark."
  },
  {
    "no": 48,
    "date": "2017-06-14 04:21:36",
    "fromNow": "10 days ago",
    "user": 48,
    "name": "Monika Shah",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really informative course with lots of examples ."
  },
  {
    "no": 49,
    "date": "2017-06-14 04:21:36",
    "fromNow": "10 days ago",
    "user": 49,
    "name": "Damien Hanns",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really like this course so far. The tutor is clear and easy to understand, as you might hope for someone teaching a course on communication. I am looking forward to going through the rest of the course material."
  },
  {
    "no": 50,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 50,
    "name": "Sven Siat",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good course which will improve your writing. Would have like to have more practices."
  },
  {
    "no": 51,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 51,
    "name": "Kate Watling",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lots of quality information broken down into understandable chunks."
  },
  {
    "no": 52,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 52,
    "name": "Kevin Corbett",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent and precise course. Informative information to put to use right away."
  },
  {
    "no": 53,
    "date": "2017-06-06 04:21:36",
    "fromNow": "18 days ago",
    "user": 53,
    "name": "Kevin Merisanu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great work, learning tons and excited to put it all to use."
  },
  {
    "no": 54,
    "date": "2017-06-10 04:21:36",
    "fromNow": "14 days ago",
    "user": 54,
    "name": "Michelle V",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has excellent information, it is easy to comprehend, and I find it incredibly helpful. Shani Raja's teaching style is reassuring and engaging. 5 stars."
  },
  {
    "no": 55,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 55,
    "name": "Rajnish Goyal",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am happy with the learning, but still struggling with the fact that it looks a lot though if organized might be little more digestible."
  },
  {
    "no": 56,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 56,
    "name": "Jean-Paul Lo Giacco",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "picture too dark.........volume not high or clear to listen.......information is not really for me"
  },
  {
    "no": 57,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 57,
    "name": "Swarna Singhal",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "nicely organized material, author must have spent hundreds of hours preparing this course"
  },
  {
    "no": 58,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 58,
    "name": "Paul Booth",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The content in the course is interesting and valuable but there is a lack of reinforced learning. The presenter often shows an example, followed by an improved version but chooses not to keep both on screen together, making it difficult to compare the differences. The presenter also does not seemed to have planned out what he will say beyond the key points he wants to hit on. This leads to hearing the phrase \"you know\" a lot, but also creates inflated explanations that - again - could be supported with visual cues or by repeating terminology and rules that he wants the audience to remember.  Compared to content one might find on Lynda.com for instance, the course is not as carefully scripted. However, I am mindful that the quality of my writing - as it appears in this review - is far better after taking just half of the course. It is important to note that engaging with the exercises has improved results for me."
  },
  {
    "no": 59,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 59,
    "name": "Andres Mesa",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is informative with a lot of examples. However, I would have liked to have practiced on my own instead of just providing examples. It needs a little more interaction and fun to play around with the lectures."
  },
  {
    "no": 60,
    "date": "2017-06-16 04:21:36",
    "fromNow": "8 days ago",
    "user": 60,
    "name": "Baron",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really like the way the instructor explains the concepts. He imparts a clearer understanding of things that make content shine and also appreciate how quickly one gets feedback. Would absolutely recommend this course to communicate our thoughts and perspectives better."
  },
  {
    "no": 61,
    "date": "2017-06-14 04:21:36",
    "fromNow": "10 days ago",
    "user": 61,
    "name": "Beginner Terry Stanislow",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've only just begun, and I can already see that I'm going to love this course.  He's very relaxing in his presentation style, methodical - just the right amount of repetition, exercises, etc.  Based on the outline, I'm confident that I'm going to be a better writer and will have fun along the way!"
  },
  {
    "no": 62,
    "date": "2017-06-15 04:21:36",
    "fromNow": "9 days ago",
    "user": 62,
    "name": "Jennifer O'Flynn",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "much valuable time is spent reading long tracts of writing, reviews of articles are again a little slavish...repeating a point to demonstrate it is one thing, but when the instructor sounds bored what little hope do the rest of us have"
  },
  {
    "no": 63,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 63,
    "name": "Kenneth Appiah - Nimo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Absolutely great resources. Succinct guidelines. Thank you"
  },
  {
    "no": 64,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 64,
    "name": "Joelle A. Godfrey",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "He's doing an excellent job.  I've learned a lot about Paragraphs and Sentence tightening."
  },
  {
    "no": 65,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 65,
    "name": "Adrian Chen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome writing course. Completely changed the way I write. Thank you so much for the effort!"
  },
  {
    "no": 66,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 66,
    "name": "Bobbie Smith",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Amazing course. What a difference it will make in my writing. Thank you."
  },
  {
    "no": 67,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 67,
    "name": "Managarn Boonthong",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am gaining a confidence to write now, because of his teaching! I wish I had him as a teacher when I was younger."
  },
  {
    "no": 68,
    "date": "2017-05-24 04:21:36",
    "fromNow": "a month ago",
    "user": 68,
    "name": "Tonya Johnson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm learning a lot. The course is extremely helpful."
  },
  {
    "no": 69,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 69,
    "name": "Brandon Seifert",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've found these lessons to be very valuable. The brief and concise classes are easy to digest, making the material immediately useable in your own work."
  },
  {
    "no": 70,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 70,
    "name": "Vi Binh le",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Up to this point, my opinion is that this course offers great advice for writing. To maximize the benefits of this course, the learners should already have very strong knowledge of sentence structures."
  },
  {
    "no": 71,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 71,
    "name": "Bryan McShane",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "lots of amterial covered and done in an orderly way"
  },
  {
    "no": 72,
    "date": "2017-06-20 04:21:36",
    "fromNow": "4 days ago",
    "user": 72,
    "name": "Kenneth Prendergast",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lots of practical information."
  },
  {
    "no": 73,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 73,
    "name": "Monica Gosschalk",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course on writing! Thank you."
  },
  {
    "no": 74,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 74,
    "name": "Rayden Weber",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great insights on developing a writing style which evokes emotion, while also following \"the rules.\""
  },
  {
    "no": 75,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 75,
    "name": "Allison Joy Marks",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "An extremely good course with great tips - I'm learning lots.  Thank you"
  },
  {
    "no": 76,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 76,
    "name": "Rosilyn Kinnersley",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Loved this course. Very dynamic and interactive; lots of great exercises all the way through. The lecturer's passion and excitement for his craft shines through with stimulating enthusiasm.  This boosted me to achieve the level of writing to which he continually inspired and encouraged students to aim towards.Any aspiring writer would gain magnificent polish following the suggestions in this course."
  },
  {
    "no": 77,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 77,
    "name": "Peter Roennfeldt",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really have found this course great so far with useful concepts and fantastic practical ideas. I feel it will give me a greater level of organisation in other aspects of life also. Well done."
  },
  {
    "no": 78,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 78,
    "name": "Damon Gammon",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Early in the course and the instuctor has me hooked. He is very clear in what he trying to get across and is quite detailed."
  },
  {
    "no": 79,
    "date": "2017-06-08 04:21:36",
    "fromNow": "16 days ago",
    "user": 79,
    "name": "Martin Kiogora",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the best course on writing I have had so far. The breaking down of different aspects of English language mechanics into simple and easy to understand concepts is what makes this course great. I look forward to learning more from your courses and to implementing some of the \"Ninja\" tips and \"writing with flair\" :)"
  },
  {
    "no": 80,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 80,
    "name": "Jorge Uribe Rivera",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I take every course from this instructor and I rapidly enroll in all his new classes. Even if you are a great writer already, you will still learn allot and your skills will also improve. Highly recommend it."
  },
  {
    "no": 81,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 81,
    "name": "Paulo Armi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Let’s put it simple: this course boosted my writing by one thousand percent. If you’re serious about writing, just take it."
  },
  {
    "no": 82,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 82,
    "name": "Rebecca O'Sullivan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani explains concepts succinctly, is easy to understand, engaging and very likeable. The content is relevant and practical. There is also no faff! No one likes faff (waffle, filler, fluff"
  },
  {
    "no": 83,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 83,
    "name": "Marco Cornetto",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Eye-opening content! Gonna read pieces of writing under a new light from now on"
  },
  {
    "no": 84,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 84,
    "name": "Lee Escobedo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course offers precise details for what you intend to write."
  },
  {
    "no": 85,
    "date": "2017-05-24 04:21:36",
    "fromNow": "a month ago",
    "user": 85,
    "name": "Brigitte Berger",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani Raja takes the time to share his experience in the art of writing with us.This course is structured, helpful, rewarding!  Thank you again."
  },
  {
    "no": 86,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 86,
    "name": "Alex Bernier",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "High content once again. I see a difference in my writing already. I can detect amateur mistakes in the examples thanks to Writing With Flair, another great course by this teacher.A must to sharpen the pen and become an exceptional writer."
  },
  {
    "no": 87,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 87,
    "name": "Jeff Green",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course. Great teacher. Very descriptive."
  },
  {
    "no": 88,
    "date": "2017-06-06 04:21:36",
    "fromNow": "18 days ago",
    "user": 88,
    "name": "Erik Hengstrum",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Outstanding as always!"
  },
  {
    "no": 89,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 89,
    "name": "Khải Hoàng Trần Quang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is just awesome, packed with a lot of valuable rules to write well.However, writing is a long journey. Different writers have different styles. And Shani is only one of the elite writers out there. Time will challenge and validate his teaching."
  },
  {
    "no": 90,
    "date": "2017-06-10 04:21:36",
    "fromNow": "14 days ago",
    "user": 90,
    "name": "Carin Marais",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This experience has been terrific. I did not expect to learn half of what I did and am definitely going to take mr Raja's other courses. I can't wait!"
  },
  {
    "no": 91,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 91,
    "name": "Andrea Winzor",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good oversight and insight into writing."
  },
  {
    "no": 92,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 92,
    "name": "Greg Stone",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very well presented. Practical. Useful. Gets to workable solutions. Reminds me of what I might already know - but have forgotten to use. Enjoyable delivery."
  },
  {
    "no": 93,
    "date": "2017-05-24 04:21:36",
    "fromNow": "a month ago",
    "user": 93,
    "name": "Grant Gooley",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The content is decent, I'm hoping we don't stay focused on \"one\" movie review. Would be nice to see other samples."
  },
  {
    "no": 94,
    "date": "2016-09-24 04:21:36",
    "fromNow": "9 months ago",
    "user": 94,
    "name": "Tomas --",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "My second course from this teacher, after watching Writing with Flair and watching the 9 steps for editing and some YouTube video's. First section looked promosing aswell. I liked the author took a different approach for this course then the previous one. The addition of articles in PDF so cou can copy-paste and edit and do the exercises more easily yourself is also very nice. Something I really liked where the Bonus Ninja Writing tips in section 2, with was packed with great ideas to overcome writersblock.  The different levels approach is very clear and a good way to improve writing texts.  A few small suggestions: e. *Lecture 9 and 10 where the weakest chapter for me,  really tedious to watch; just tell to read the (pdf) article and then talk about the results instead or reading a very long passage of text, in training movie does not work. Maybe for a new course you could also add markers, instead of showing the whole text using arrows/color markers for more easily reading.  The concent/idea's are great however, delivery, course production has some room for improvement."
  },
  {
    "no": 95,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 95,
    "name": "Elizabeth",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Hi, my name is sebastian and i am 14 years old. i thiught this course was great, but it is very boring."
  },
  {
    "no": 96,
    "date": "2016-09-24 04:21:36",
    "fromNow": "9 months ago",
    "user": 96,
    "name": "Lawrence Wilson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course really cleared up a lot of confusion I had about the essential elements of writing. I needed it to improve the content I wish to publish on my blog as well as my writing in general. Very good course!!"
  },
  {
    "no": 97,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 97,
    "name": "Anwar Chowdhury",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Those who have the firm intention to be a writer or enhance the skills of writings further, these persuasive lectures will certainly  yield  more practical thinking  in his or her mind. Practice makes perfect: how we can do practice, how we can screening our own writings, all this learning approaches will be sharpen whist we will go through these lectures. Thanks to Mr.Shani Raja."
  },
  {
    "no": 98,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 98,
    "name": "Lillian",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Because there are no other stars!  The course is utterly great.  How would you have us express that?"
  },
  {
    "no": 99,
    "date": "2016-09-24 04:21:36",
    "fromNow": "9 months ago",
    "user": 99,
    "name": "Tricia Burke",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I enjoy Shani's teaching style. He organizes his courses well and I've learned a great deal. It's clear that he's a very knowledgeable writer. Also, I appreciate how responsive he is to questions in the Q&A sections of his courses. I always received a response within 24 hours. In fact, very thorough and helpful responses. I'm going on to my 3rd course by Shani now."
  },
  {
    "no": 100,
    "date": "2017-06-17 04:21:36",
    "fromNow": "7 days ago",
    "user": 100,
    "name": "Jason Pickles",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Well worth it."
  },
  {
    "no": 101,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 101,
    "name": "Elayne Marchbanks",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm learning a lot and enjoying it as well."
  },
  {
    "no": 102,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 102,
    "name": "Aditya Vij",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a great course but there's too much focus on theoretical aspects rather than teaching the technical nuances needed for perfect writing"
  },
  {
    "no": 103,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 103,
    "name": "Emre Başaran",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is good. My only suggestion would be to make better use of homeworks. I think homeworks which do not take very long to complete would be very useful. They could be planned in a way that the student can later check with the instructor, to see his mistakes. Quite similar to the ones that are used in the first lectures."
  },
  {
    "no": 104,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 104,
    "name": "Martyn Clark",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I consider myself a decent writer, but already this course has given me a number of useful strategies for organizing and improving the quality of my prose. This is my first course with this instructor, so I do not know to what extent this builds on or repeats information from his other courses."
  },
  {
    "no": 105,
    "date": "2016-09-24 04:21:36",
    "fromNow": "9 months ago",
    "user": 105,
    "name": "Ashwin Chandrasekaran",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is my second course with Shani.  As always, he has done an excellent job and it can elevate you, the learner, to next levels of writing excellence.  However, I gave it a star low because in contrast to the previous course (Writing with Flair), it lacks a bit of interactivity and recap points.  I strongly recommend this course as a good investment towards your writing greatness!"
  },
  {
    "no": 106,
    "date": "2017-06-10 04:21:36",
    "fromNow": "14 days ago",
    "user": 106,
    "name": "Marie Rogers",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course. Anybody who is serious about writing would benefit from it."
  },
  {
    "no": 107,
    "date": "2016-09-24 04:21:36",
    "fromNow": "9 months ago",
    "user": 107,
    "name": "Jakki Bendell",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Some good stuff in here, especially for journalism. I found some of the business writing examples a bit patronising (writing a letter to your supermarket supervisor about sending a customer to the wrong aisle?). Also, the suggestion that business people don't read classic novels (excuse me?). But mostly useful tips and tactics."
  },
  {
    "no": 108,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 108,
    "name": "Johann Van Staden",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far it's really good and informative, if a tad fast paced.  All manageable, however."
  },
  {
    "no": 109,
    "date": "2017-06-09 04:21:36",
    "fromNow": "15 days ago",
    "user": 109,
    "name": "Gina Escober",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The content is presented in a very clear and simple way. The instructor has a command of the topic and it shows in his presentation of the material. The writing exercises reinforce his definition of Ninja writing. These lessons will help me a great deal in both business and personal communication."
  },
  {
    "no": 110,
    "date": "2017-06-07 04:21:36",
    "fromNow": "17 days ago",
    "user": 110,
    "name": "Brenda Moguez Granger",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's as if I were sitting across from a fellow writer, or good friend talking about writing.  The best description I've ever heard on finding your writer's voice.  I never understood that and looked around for a long time for a precise meaning, which of course eventually came to me, but hearing the instructor's explanation made me smile and recall all those books I looked through for a precise​ definition."
  },
  {
    "no": 111,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 111,
    "name": "Maria Marko",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Extremely helpful. My mind is already focusing in the best direction for my writing, so I cannot wait to understand the rest of the course!  My \"sponge\" can still absorb more! Lol"
  },
  {
    "no": 112,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 112,
    "name": "Aser ashkir",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Like how the course is organized. Job well done"
  },
  {
    "no": 113,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 113,
    "name": "Manuel Arnedo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Outstanding course taught by an experienced instructor. Completely recommended!"
  },
  {
    "no": 114,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 114,
    "name": "Jonathan Welch",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative and easily breaks down ideas into simple steps but can be slightly unfocused sometimes. A tad unpolished."
  },
  {
    "no": 115,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 115,
    "name": "Kyle Ferguson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a great course! It will definitely upgrade your writing skills!"
  },
  {
    "no": 116,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 116,
    "name": "Rajiv Narang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani is a wise educator who is generous with his knowledge and his talent."
  },
  {
    "no": 117,
    "date": "2017-06-04 04:21:36",
    "fromNow": "20 days ago",
    "user": 117,
    "name": "Alison",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've only just started but I'm hooked.  It makes me want to write a movie review and appreciate the elements that lead to good writing."
  },
  {
    "no": 118,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 118,
    "name": "Hiba Khalid",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani is really engaging. I couldn't stop once I started. He really demystifies the process of great writing from scratch as well as provides perspective on how to view, review, understand, and enhance any piece of writing."
  },
  {
    "no": 119,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 119,
    "name": "Quality / Business Consultant Robert E. Perez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great start to identify the 1) intent (persuade, motivate, inspire) and 2) clearly identify the audience.(their sensitivities, & values)."
  },
  {
    "no": 120,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 120,
    "name": "Kyle",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As a followup to the Writing with Flair class, this course takes your writing to a new level. You'll learn new chops, kicks and twists. I'm glad to have taken it and expect to refer back to it repeatedly to refresh my memory on what it takes to write in an elite manner (or dare I say it?) as a ninja."
  },
  {
    "no": 121,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 121,
    "name": "Julia Watson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Revealing how the twin concepts of Intent and Audience work to produce Tone is very helpful, not only in helping with my own writing but also when judging the writing of others. Thank you."
  },
  {
    "no": 122,
    "date": "2017-06-12 04:21:36",
    "fromNow": "12 days ago",
    "user": 122,
    "name": "Dr Jonathan Frost",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good solid suggestions backed up with clear examples."
  },
  {
    "no": 123,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 123,
    "name": "Nanthinee Jevanandam",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative and thorough."
  },
  {
    "no": 124,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 124,
    "name": "Smccrobie",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love this guy! His voice and accent are beautiful and smooth.  He, so far, has taken some basic concepts I learned in school, but expands them into real-world examples for adults who are actually out there trying to make a living!  Great so far."
  },
  {
    "no": 125,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 125,
    "name": "MarBak",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Shani is clear in his descriptions and explanations. Already learned a lot to improve my writing."
  },
  {
    "no": 126,
    "date": "2017-06-16 04:21:36",
    "fromNow": "8 days ago",
    "user": 126,
    "name": "Lillian Chiu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "If you're wondering where to start on writing, you'll love this course."
  },
  {
    "no": 127,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 127,
    "name": "Abdul Mohamed",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It was very clear and it defined its pupose"
  },
  {
    "no": 128,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 128,
    "name": "Jennifer Depew",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Techniques for writing compelling text are shared in an engaging and organized style with examples and exercises for practicing the strategies."
  },
  {
    "no": 129,
    "date": "2017-06-10 04:21:36",
    "fromNow": "14 days ago",
    "user": 129,
    "name": "Carolyn Silvernail",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear, concise, and easy to follow. Boiling down writing to an understanding of audience and overall intent is an easy way to begin to think about writing. It takes it from abstract to concrete."
  },
  {
    "no": 130,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 130,
    "name": "Ourourou Abdelaziz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Le cours est complet et instructif."
  },
  {
    "no": 131,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 131,
    "name": "Adam Breen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love the framework he is presenting. It provides helpful, comprehensible structure that guides thinking, without prescribing a single rule for all circumstances. I'm finding that I can use the framework to channel my own creativity."
  },
  {
    "no": 132,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 132,
    "name": "Radu-Florentin Diaconu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm only a third of the way to the end, but I can already tell that this is going to be a great course. Not only is the information extremely practical and easy to apply, it's also presented in a clear, easily-comprehensible way. The instructor offers many writing examples, and will often show you how to edit a flawed text. Overall, the learning experience is great, regardless of your writing experience."
  },
  {
    "no": 133,
    "date": "2017-06-16 04:21:36",
    "fromNow": "8 days ago",
    "user": 133,
    "name": "Miri Ussher",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have received information that has already helped me with my writing."
  },
  {
    "no": 134,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 134,
    "name": "Yuu Kimata",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I knew that it is important to be clear about the purpose (intent) and the audience of your writing, but the author gave much more details about it and also explained how they are linked to the content and tones of the writing."
  },
  {
    "no": 135,
    "date": "2017-02-24 04:21:36",
    "fromNow": "4 months ago",
    "user": 135,
    "name": "Alicia Snyder",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I don't particularly like the examples that are being given. I have to be passionate about something in order to write about it. Which is why sometime's I get writer's block. If it isn't something I am passionate about, a lot of times it takes longer for me to come up with the information."
  },
  {
    "no": 136,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 136,
    "name": "Douglas Hobson",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "waiting for last half"
  },
  {
    "no": 137,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 137,
    "name": "Kim Stephens",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor clearly knows his topic. I am an editor, and this course is helping me to help the authors' piece hold the interest of the audience."
  },
  {
    "no": 138,
    "date": "2017-06-20 04:21:36",
    "fromNow": "4 days ago",
    "user": 138,
    "name": "Evelyn",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "its ok good but not great"
  },
  {
    "no": 139,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 139,
    "name": "Atul Choudhary",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great Learning."
  },
  {
    "no": 140,
    "date": "2016-12-24 04:21:36",
    "fromNow": "6 months ago",
    "user": 140,
    "name": "Jesse Andrade",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Only 6 lectures in and there is some mindblowing, yet simple \"ah-ha\" moments.  Perfectly executed course!"
  },
  {
    "no": 141,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 141,
    "name": "Soness Stevens",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Superb flow of content. This course says it teaches better writing skills but I've discovered a deeper appreciation for great writing. I love how he explains what we are going to do throughout the course and then goes through each concept with concrete examples that we can try before showing us the answer.I recommend this course if you want to become a clear, concise and articulate writer. The bonus is you'll have a better appreciation for narrative. And this is only after the first few videos! I'm excited about the rest of the course!"
  },
  {
    "no": 142,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 142,
    "name": "Gagan Khanna",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "AHA..! AHA...! AHA...!This is my first course in writing and has been full of AHA moments !With Shani's systematic approach, a beginner can quickly understand and start applying the building blocks of good writing easily.Perfect for those first steps into the playfield of writing.In this review itself, I used some of the tactics taught by Shani :-)Thankyou Shani"
  },
  {
    "no": 143,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 143,
    "name": "Bridgette",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor had a nice voice but was so monotone. I wasn't inspired."
  },
  {
    "no": 144,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 144,
    "name": "Catherine Theroux",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course offers the fundamental tenets of good, persuasive writing.  The lectures provide practical guidance on how to develop your message in a way that will resonate with your targeted readers."
  },
  {
    "no": 145,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 145,
    "name": "Anthony Hewett",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear and relevant.  I'm immediately using the tools"
  },
  {
    "no": 146,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 146,
    "name": "Sharron Davis",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Early impressions. A lot of repetition and not as clear as other courses. I hope it improves."
  },
  {
    "no": 147,
    "date": "2016-11-24 04:21:36",
    "fromNow": "7 months ago",
    "user": 147,
    "name": "Dave",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good Course, very useful information for those starting out."
  },
  {
    "no": 148,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 148,
    "name": "Carolyn Clancy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Everything is explained clearly and the information is so helpful. I like the exercises and how the instructor goes over them to tie them into what he's teaching."
  },
  {
    "no": 149,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 149,
    "name": "Ying Ying Shi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I adored the course! The lessons are full of practical advice and useful tools to improve writing. This series works wonders when studied together with \"Writing with flair\". I just regret not having found these videos earlier."
  },
  {
    "no": 150,
    "date": "2017-06-11 04:21:36",
    "fromNow": "13 days ago",
    "user": 150,
    "name": "Bernard Metz",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear points and illustrations. Would have appreciated a bit more opportunity to practice skills, with use of mechanisms for self-evaluation."
  },
  {
    "no": 151,
    "date": "2017-06-15 04:21:36",
    "fromNow": "9 days ago",
    "user": 151,
    "name": "Adam Leviston",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "it's useful"
  },
  {
    "no": 152,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 152,
    "name": "Drtouny@Doctor.Com",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm only on the first section, but I can already tell my writing will be forever dramatically changed on completion of this course.  I love the exercises, they are simple, yet very effective and there is a definite improvement achieved at the conclusion of each activity.  The lecturer is a great coach, easy to follow, insightful, and inspiring.  Without a doubt , I am more focused in my goal, my content and style is measurably improved, and I am ENJOYING the process of writing a lot more as a result of this course. Both the veteran and novice writer will walk away better upon completion. Highly recommend."
  },
  {
    "no": 153,
    "date": "2017-06-08 04:21:36",
    "fromNow": "16 days ago",
    "user": 153,
    "name": "Music Producer Santanu Karmakar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The message is clear .. The techniques are useful ..and it is logically structured. It indeed will improve the quality of your writing .."
  },
  {
    "no": 154,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 154,
    "name": "Stanley S Smith",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The new ideas keep comming....fast, but not to fast to understand...and the opportunity to immediately put those ideas to use lets us own them."
  },
  {
    "no": 155,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 155,
    "name": "Eric Wood",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear and concise, good information."
  },
  {
    "no": 156,
    "date": "2017-06-18 04:21:36",
    "fromNow": "6 days ago",
    "user": 156,
    "name": "Gunjan Mahajan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great experience"
  },
  {
    "no": 157,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 157,
    "name": "Ruth Jacque",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am learning new information that I feel is helpful such as the metaphor theme"
  },
  {
    "no": 158,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 158,
    "name": "Dan Tillema",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent - extremely practical and helpful."
  },
  {
    "no": 159,
    "date": "2016-10-24 04:21:36",
    "fromNow": "8 months ago",
    "user": 159,
    "name": "Sharon E. Cathcart",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think that my rating is, in part, because I'm an experienced writer.  I was a journalist for more than a decade, and have award-winning novels under my belt.  I am willing to re-consider as we go on, but this material seems aimed at the absolute tyro -- and that is not me."
  },
  {
    "no": 160,
    "date": "2017-04-24 04:21:36",
    "fromNow": "2 months ago",
    "user": 160,
    "name": "Thomas Stachl",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The concepts are basic but profound."
  },
  {
    "no": 161,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 161,
    "name": "Civilia Monestime",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "because I think it will help me with my writing"
  },
  {
    "no": 162,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 162,
    "name": "Carlton James Muldrow",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative course, with illustrations and application of the information makes  making it easy to follow."
  },
  {
    "no": 163,
    "date": "2016-09-24 04:21:36",
    "fromNow": "9 months ago",
    "user": 163,
    "name": "Pmh",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent explanations, good pace, and examples"
  },
  {
    "no": 164,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 164,
    "name": "Dr. Lisa Banu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I enjoyed the progression of the course from paragraph to word level of expression. The examples in each section effectively demonstrated the concepts. I also appreciate the attention to details like word sequence in a list, implied ideas, the use of colorful, non-technical words. Finally, I found the general attitude of journalistic clarity without academic sanctimony, refreshing."
  },
  {
    "no": 165,
    "date": "2016-09-24 04:21:36",
    "fromNow": "9 months ago",
    "user": 165,
    "name": "Tonya johnson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor brakes each segment down with clarity."
  },
  {
    "no": 166,
    "date": "2016-08-24 04:21:36",
    "fromNow": "10 months ago",
    "user": 166,
    "name": "Sandra B",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I got a lot out of this course and I believe my writing has improved because of it. Shani is very clear in his presentation and gives a lot of tips to improve your professional writing skills. The course is not presented in a highly graphic way, but it worked for me as I learn best by listening and putting stuff into practice. Thanks Shani!"
  },
  {
    "no": 167,
    "date": "2017-01-24 04:21:36",
    "fromNow": "5 months ago",
    "user": 167,
    "name": "Ray",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Eye opening course."
  },
  {
    "no": 168,
    "date": "2017-05-24 04:21:36",
    "fromNow": "a month ago",
    "user": 168,
    "name": "Andrea Bruciati",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Ottimo corso, chiaro e dettagliato sotto ogni punto di vista"
  },
  {
    "no": 169,
    "date": "2017-03-24 04:21:36",
    "fromNow": "3 months ago",
    "user": 169,
    "name": "Gabriel Birnie",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Entertaining and helpful."
  }
]