[
  {
    "no": 0,
    "date": "2017-06-21 04:07:18",
    "fromNow": "3 days ago",
    "user": 0,
    "name": "Underground Ninja",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Where do I start? Coming into this course I knew C++ but web dev in its own right was a different animal. It was less about algorithms and more about structure and putting the pieces together. Web Development is a large field and Colt did a great job on focusing on the main important parts. He touches on html, css, frameworks, libraries, node.js, mongodb, git/github, heroku and complex JS topics towards the end. If someone asks me where can I learn how to create full stack websites as a beginner I will for sure recommend Colt's course as the first option. It gives you a solid foundation on how to create full stack web apps/sites. My skill level increased enormously I felt like I just turned Super Saiyan!!!!"
  },
  {
    "no": 1,
    "date": "2017-06-12 04:07:18",
    "fromNow": "12 days ago",
    "user": 1,
    "name": "Carlos Lam",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am pretty satisfied with this course, from my experience in learning front end ins this course, I will give it 5* , very well explained and the amount of external tools and resources use from other websites helped a lot in understanding the class(like Postman, MDN, CDN, free pictures websites, etc), for backend, I think it was the hardest to learn, maybe because it is new to me, I have already had some knowledge for front end, I think the Authentication section was the most confusing and hardest to teach, which Colt was right about that, I had to re-watch couple of times the video to get the main idea of some of the lectures, I still will re-watch it again later because it has some features that I am still not clear, but the backend was taught well and that for me was 5*, The best thing about this course, it is that it will teach you in a way that i see it this way, beginner, then progressing to intermediate, then professional (to think like a developer), not many courses teaches you to learn and code and to think like a developer, and Thanks Ian for always answering students questions,and 5* for Elie for teaching the last section of the course Advance Javascript, woow, I would ve never understand some of the advance concepts of Javascript, If Elie ever make an udemy course, I will not hesitate to take it, Thanks Colt, Ian and Elie"
  },
  {
    "no": 2,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 2,
    "name": "Omkar Ghag",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have tried several courses to learn web development but this is by far the best I have come across. Colt makes learning some of the most complex things easy and fun. The structuring of the course is very impressive. The coding exercises are important if you wish to make the most of this course. My only suggestion is for new content to be added to make the final YelpCamp project even more comprehensive, other than that no complains :)"
  },
  {
    "no": 3,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 3,
    "name": "Nana adjapong",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "this overall helped me have a better understanding of how to code and structure lines not just for web apps, thanks to Ian(who does an exceptional job attending to all our problems) and Colt"
  },
  {
    "no": 4,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 4,
    "name": "Suganya",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best course ever. The tutorials and challenges are simple and keeps me engaged. Colt knows where we could be lost in the coding and gives a heads-up too, which is very helpful. After completing this course, my expectations are set very high that I am unable to find a satisfying Java course to learn next. It will be awesome if there are other Java courses to learn from Colt."
  },
  {
    "no": 5,
    "date": "2016-12-24 04:07:18",
    "fromNow": "6 months ago",
    "user": 5,
    "name": "Igor-Vuk Vukelić",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Went into this course as a beginner and learned a lot. Everything is explained really well. Colt is introducing every new concept little by little so he can combining them all together at the end. If you have any question, Ian will do his best to answer them. I am sure Colt or Ian will continue to update this course in the future and add some parts that I feel are missing for now, for example ajax."
  },
  {
    "no": 6,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 6,
    "name": "Michael Sterling",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Nitty Gritty details!The occasional 'LiveStream' mistake!Rusty , Grey, and a supportive community!There isn't a lot more that could be asked from an online class. Now, who do I talk too about making some money? :D"
  },
  {
    "no": 7,
    "date": "2017-06-15 04:07:18",
    "fromNow": "9 days ago",
    "user": 7,
    "name": "Philipp H.",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I had no experience in web development and this course really tought me how to write a web app and deploy it. You do not learn everything about web development. But it gives you lots of tools and all the knowledge you need to be a full stack developer - with a given (and modern) set of technology. You sure need to learn and watch out for new technologies - as in every other job. But you do learn a lot and you do it step by step, so it's feasible even if you have no experience at all. And this course surprised me regularly. From time to time I asked myself how could I do this or that and then - some hours later - I had the solution (i.e. how can I make my site accessible on the internet for everybody - but there is an app for that, too).The videos are really good, it is not some \"watch me code\" experience I saw in several other videos. There sure is code but the lessons are well-thought-out. And with lots of exercises and code alongs you really learn how stuff works... because if you only watch you won't learn much. You really see that Colt (and the other instructors) do like teaching very much. So I recommend this course to everybody who wants to learn web development."
  },
  {
    "no": 8,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 8,
    "name": "Darryl Pitchford",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think the best way to describe the approach of this course is similar to asking for directions.  You ask a friend for directions and instead of telling you, he is willing to show you.  Instead of taking you straight there, he first shows you all the alternate routes to take. By the time you finally get to your destination, it leaves you a little confused of the direct path.   It's good to learn other options but not like in this course."
  },
  {
    "no": 9,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 9,
    "name": "Gerard Hynes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course provides a fantastic foundation in web development. Of course it cannot provide the same intensity and job preparation as an in-person bootcamp but it can take you from an absolute zero-knowledge beginner to someone who can use HTML, CSS, JavaScript, Bootstrap, jQuery, Node, Express, MongoDB etc. to make working web applications (and understand why they work). Its main strength is the quality of its instructors. Colt is obviously a talented, thoughtful and passionate teacher. He is excellent at explaining difficult concepts in accessible terms and has clearly put a great deal of thought into the design of the course. Not to mention that he's also funny and engaging. Later in the course Ian and Elie prove equally clear and helpful. Its other great strengths are its practicality and focus. There is much more emphasis on making applications that work rather than on abstract theory (though Colt does a great job of explaining the concepts you need to know and Elie's videos go into greater depth when it comes to JavaScript). By the end of the course you will have a great foundation in JavaScript and Node.js and will be able to use them to make real-world applications, not just to complete exercises. This focus on JavaScript means you get into much more depth than if you were to just jump around between languages and frameworks. There are still things that would be desirable in the course if it were to rival an actual coding bootcamp: the Git and Github section needs fleshing out (though Ian makes his Git course available for free); there could be more emphasis on APIs; it would be nice to also cover AJAX if not something as complex as Angular or React. My only real gripe with the course in its current form is that the videos for the YelpCamp project don't currently get as far through the refactoring as Colt originally promised. That said, Ian has been adding new material there on a regular basis so that problem is gradually going away. Overall, I thoroughly enjoyed this course, learned loads, and feel much more confident in my programming abilities. I would certainly recommend this course for anyone looking to get into web development."
  },
  {
    "no": 10,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 10,
    "name": "Benz Thanachart",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Just finished all lectures today, this course is great and cover both Front End and Full stack. Colt is a very good instructor, he knows how to explain complex topic in a very easy to understanding way. This course help me a lots to understand Web Development world. I would recommend to everyone!"
  },
  {
    "no": 11,
    "date": "2017-06-16 04:07:18",
    "fromNow": "8 days ago",
    "user": 11,
    "name": "Sean Vanadia",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's ridiculous how good this course is.  Extremely comprehensive for web development and will prepare you more than you could ask for.  Ian, the TA, is very accessible and helpful, and Colt, the instructor, is an unbelievably good teacher.  Very thorough.  There's no reason you shouldn't leave this course with an awesome understanding of web development.  Thanks so much for an amazingly well-put together course Colt and Ian!"
  },
  {
    "no": 12,
    "date": "2017-05-30 04:07:18",
    "fromNow": "25 days ago",
    "user": 12,
    "name": "J. Moreno",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Wow! This was literally one of the best courses that I have taken Udemy! This course ties the necessary technologies together to build full stack apps.  Colt, Ian, and Elie are excellent instructors and clearly know how to teach.  Although you can start this course as an absolute beginner and gain a tremendous amount of knowledge, having some or moderate knowledge in some or all of the topics will help you cement those skills even further.Hands down, if you want to learn web development, this course is essential and a MUST!!I am excited to start on the Ultimate MySQL Bootcamp course next any anything else Colt and the gang teaches!  It is priceless to have instruction from excellent teachers...MUCH THANKS!"
  },
  {
    "no": 13,
    "date": "2017-06-20 04:07:18",
    "fromNow": "4 days ago",
    "user": 13,
    "name": "Eric Ebbesen",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Engaging projects will help jumpstart your entry into web development. Lessons are clear and right-sized -- Colt clearly knows what he's doing as a developer and instructor. I have recommended this course to several people new to coding, or just new to JavaScript/HTML/CSS.In addition to the excellent content there's an active community ready to help you (if your question hasn't already been answered in the forums).I would rate this course five stars if it had sections on unit testing."
  },
  {
    "no": 14,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 14,
    "name": "Daniel Lopes",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "very good explanation and examples. but I believe that you sometimes emphasizes things that are not so important and for things that really matters you were to quickly... Just to give an example... you explained about how to include the js and css from files and from the web way too much... now for bootstrap i think that you were too quickly you could explore bootstrap way more."
  },
  {
    "no": 15,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 15,
    "name": "William K Dowling",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course ! This course will take you from start to launch. Colt is very thorough and clear. Ian is continuing to add great content."
  },
  {
    "no": 16,
    "date": "2017-06-02 04:07:18",
    "fromNow": "22 days ago",
    "user": 16,
    "name": "Peter-Jon Grant",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor is easy to follow and provides great content. Perfect starting point for beginners. It's quite amazing how much you end up learning."
  },
  {
    "no": 17,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 17,
    "name": "Marco Andrade",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think this course provides students with a solid foundation of web development by introducing concepts, technologies and practice. All concepts are well explained by the instructors, who also address all questions promptly and supply great insights and external resources."
  },
  {
    "no": 18,
    "date": "2017-06-06 04:07:18",
    "fromNow": "18 days ago",
    "user": 18,
    "name": "Georg D.",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Just finished the complete course and I must tell it was an awesome journey! I have had some programming classes at the university but not much of web development. However, this course really covered a lot of what a developer must know. The quality of this course is amazing and the instructor Ian Schoonover was very supportive."
  },
  {
    "no": 19,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 19,
    "name": "Luca Lanotte",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. I love how Colt make sure you understans each step. I start knowing nothing on the topic and after a couple of months I build with confident my own website and web spplication. I hope in future to see a course on PHP from Colt.Thanks for this course!!"
  },
  {
    "no": 20,
    "date": "2017-05-31 04:07:18",
    "fromNow": "24 days ago",
    "user": 20,
    "name": "Vinh Pham",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt's course is pretty well put together and I would recommend it to most students depending on what you look to get out of it. Will you gain a thorough understanding of full stack web development by the end of the course? Absolutely yes. Will you have the skills necessary to apply for and get a junior web dev position at a company? Probably not, but you're well on your way if that's your end goal. Will you have the skills necessary to reinforce your existing design-related job? Absolutely yes. I knocked a star off because of some quirks with the lectures that can make for a frustrating experience at times. First, Colt has a tendency to go too fast or too slow. Thankfully, it's video that can be rewound or paused. A bigger problem though is that Colt has a tendency, especially in the later videos of the YelpCamp project to jump around in his explanations. Ideally, it should follow: 1. State the problem. 2. Discuss the solution 3. Provide the solution 4. Discuss possible pitfalls and curveballs and possible solutions. In my experience watching the videos, Colt jumps from 1 to 4 to 3 to 2, which makes for a confusing experience. Another issue is that I wish there were more exercises, at least optional exercises, in the JavaScript sections. You get a code along and maybe one exercise, and then it's off to the next topic, which doesn't help students learn and reinforce methodologies. My last complaint is that it would have been nice for Colt to call out which file he's working in during the YelpCamp videos. The project gets fairly big in number of files towards the end and with some files in different paths having the same name, so I felt like I was wasting time checking and double checking to make sure I was following the video correctly.For those of you wondering how long it takes to complete the 43+ hours of content, I finished the course in 7 weeks working approximately 5 days a week at a minimum of 4 hours a day.Despite my complaints, I think Colt is an A+ instructor and I intend on enrolling in his mySQL course in the future."
  },
  {
    "no": 21,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 21,
    "name": "Johnny D",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course enjoyed every minute of it. I've learnt so much, any questions you may have are quickly answered by Ian or Colt. The whole course is well laid out with a great community to back it up excellent value for money hats off to Colt, Ian and not to forget Rusty"
  },
  {
    "no": 22,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 22,
    "name": "Band Ly",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course was very informative and the structure of the course was well prepared. I would recommend this course to anyone wanting to learn web development."
  },
  {
    "no": 23,
    "date": "2017-06-05 04:07:18",
    "fromNow": "19 days ago",
    "user": 23,
    "name": "Chong Liu",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "good instructor, clear expatiation, covers lots of useful stuff. half star for not completely finishing the YelpCamp project. I hope there is more lecture coming."
  },
  {
    "no": 24,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 24,
    "name": "Adjakba ARUN",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course content.  4 stars - Specially for JavaScript, jQuery, node and express.  1 star missing is because of No PHP!."
  },
  {
    "no": 25,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 25,
    "name": "Nikolas Suh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I don't normally write reviews, but I found this course to be VERY helpful in setting the foundation for me to become a full-stack web developer. I also took another highly rated WebDev course, but I found this one to be better at using current/standard practices and explaining concepts.Colt did a great job of explaining WHY we are doing things the way we are, and the example apps were great in solidifying the concepts we learned. This course gave me a lot of confidence and I'm looking forward to applying the knowledge I gained."
  },
  {
    "no": 26,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 26,
    "name": "Michael Barritt",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Found the course to be very informative. Colt's teaching method is easy to follow and understand. This course has fuelled my desire to become a web developer. I'm excited about what the future brings.Oh yes.... Ian is awesome."
  },
  {
    "no": 27,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 27,
    "name": "James Conley",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a well-structured course. The material is presented in a great way for building a solid foundation in full-stack development. Colt speaks clearly and is easy to follow through the entire course. If you are interested in learning full-stack development and node js is your backend choice, this is the course I recommend."
  },
  {
    "no": 28,
    "date": "2017-06-09 04:07:18",
    "fromNow": "15 days ago",
    "user": 28,
    "name": "Mohammed El-Rakayby",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The content here is very good, for a beginner this is definitely for you.If you have some experience in programming this is still a very good bundle but you might need something more in depth."
  },
  {
    "no": 29,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 29,
    "name": "Chris",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "There were some things i didnt like:The unannounced change of instructorsThe videos that were just added but not part of the course(originally)The fact that it was hard material in some places :PBUTThis course was pretty amazing at teaching me front end dev techniques.I wish the forum was more active but for the most part I cant really fault the course.Good value for money"
  },
  {
    "no": 30,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 30,
    "name": "Leonhard Laineste",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The only criticism I would have is that a lot of job offers in my area require Wordpress or AngularJS and it would be great to have these in the course."
  },
  {
    "no": 31,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 31,
    "name": "Deni Rustemovic",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course...I can't emphasize enough how great course is...I learn a lot.Colt is great teacher and very knowledgeable about everything what he is speaking. He deserve 10 stars..."
  },
  {
    "no": 32,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 32,
    "name": "Carlo M. Magno",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I learned a lot in this course. The support system is great as I observed that the instructors do reply to the Q&A section.Thanks Colt, Ian and Elie!"
  },
  {
    "no": 33,
    "date": "2017-06-10 04:07:18",
    "fromNow": "14 days ago",
    "user": 33,
    "name": "Brady Mauermann-Peterson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course moves quickly enough that I'm not bored and fast forwarding, but takes time out for the more complex concepts. Definitely covers the things you need to know to move forward on your own with building both static sites and full-stack sites."
  },
  {
    "no": 34,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 34,
    "name": "Bryan Waymire",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I learned a great deal of information in this course.Unfortunately the course is not 100% completed as the videos to complete the Yelp clone are not available yet, otherwise, amazing course."
  },
  {
    "no": 35,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 35,
    "name": "Reuben Salisbury",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Such a great course. Extremely informative and engaging. Covers the basics through to more advanced topics such as authentication and authorization, yet all the time the course is intuitive, clear and easy to understand.Can't recommend this course enough!"
  },
  {
    "no": 36,
    "date": "2017-05-31 04:07:18",
    "fromNow": "24 days ago",
    "user": 36,
    "name": "Luis Felipe Guzman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course for aspiring Web Developers. Colt/Ian/Elie are very engaging and helpful answering your questions and covering the different topics. There are many tech stacks for WebDev, the ones covered here are MongoDB, Express, and NodeJS.Ones suggestion is maybe add a section about a front-end framework like Angular/React/Vue, just to get your feet wet, then the alumn can take it from there. Also maybe add a section of the new HTML 5 tags and when to use them.That aside this is a great course and I recommend it to anyone who want to start a WebDev career or maybe to someone who has an idea for a site or web app.This course will not make a full fledged expert in WebDev but is great step to start and by the end of it you'll have a sound foundation to take it where you want to go!"
  },
  {
    "no": 37,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 37,
    "name": "Alexander Sirenko",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course for everybody, for beginners and for those who knows web - development pretty well. The course gives you everything you need to know. You'll experience great time with the course and it's instructor Colt. His style of teaching is very inspiring. Thanks!"
  },
  {
    "no": 38,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 38,
    "name": "Nikola Jovanovic",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am saying this from my personal feel that Colt is the best instructor I had so far.Why? He has a sense of humor that I like.He is natural and spontaneous. His explanations and instructions are clear and concise. He covers material with such an ease. He is well prepared.He has real passion for teaching.I believe he did not cover some of the material he said he would.The bottom line is that I learned a lot of new concepts about web programming. I am now more aware what I need, how things should be done and above all I enjoyed this course the most.All the best."
  },
  {
    "no": 39,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 39,
    "name": "Tyler Mckee",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Incredibly well thought out course that holds a very steady pace. Colt has a way of explaining things that just makes sense and the TA Ian is very helpful as well.highly recommend!"
  },
  {
    "no": 40,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 40,
    "name": "Segundo Bungato",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is very user/beginner friendly but not so watered down that it's boring or uninteresting for those that have had prior experience with some webdev. I had learned HTML, CSS and a handful of JS back in the 90s and dabbled with Dreamweaver. Even the sections I had already known were great refreshers before plunging into the content that was new.Colt, Ian and Elie all are very well spoken and articulate, but never over-complicate the lessons. All of the examples given were easy to follow and they even created situations in which you had to troubleshoot yourself which really helps you understand if you grasp the content or not. There may be a few sections where you either get lost, confused, or simply don't understand. Be sure to take a step back, let that information marinate a bit, revisit the unit/section and definitely code along. Sometimes the information pulls together in future units too so don't get discouraged.I gave this course a 4.5 out of 5 stars only because every now and then with some of the sections some of the coding wouldn't work due to updated libraries/syntax. This is usually pointed out in a note before or after the video with the error which is nice. There was a couple of spots near the end of the bootcamp that had some errors in them but were easily remedied by Googling for help. Which ironically is good practice for any type of development. I highly recommend this course to anyone who is slightly interested in coding, web and app dev, or just to know what it takes to make a website/app."
  },
  {
    "no": 41,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 41,
    "name": "Mhd Median Tiba",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think this course is really good, and I recommend it regardless of your level or experience. Some of the topics may seem old or outdated, especially with all the tools we have today, nonetheless, it is very helpful to go through every topic thoroughly, and there is always so much to learn."
  },
  {
    "no": 42,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 42,
    "name": "Osmin Sanabria Jr",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This couse was great for the basics. My only complain is that it is not complete. Colt promises that he will take us through completing the Yelp Camp websit, but does not fully complete it. Additionally there is a sense that colt will not ever finish, with all the notes and the later videos being from Ian or Eddie. Maybe it was just me, but not have colt explain why the course is not complete and why his TA's are taking over was annoying. All in all, however, the course was very educational on getting started and being able to create a website."
  },
  {
    "no": 43,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 43,
    "name": "Richard Turner",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "OK - I just finished all of the course content that's available as of this review.  I'm leaving a 5 star rating, and I'll explain why below - but I do have several issues with the course as it is. Let me just briefly touch on my background - I've studied HTML, CSS, and Javascript on my own, some limited experience in Bootstrap and jQuery, but by no means even remotely confident at either of those.That latter point still remains largely true after finishing this course, but I do feel a lot more confident about starting a project and utilizing the appropriate docs to get the job done than I did before, so that's a big plus. Let me get the bad stuff out of the way first -1.  This course is not finished.  The amount of content here, and the presentation beats anything I've found so far, especially in terms of clarity of explanation, so it gets a 5 star review anyway.  It's actually a little sad because this thing could've been even more amazing.  I'd pay for a PART 2 course, even.2. It seems like Ian will be finishing the course.  In the couple of videos he presents, he doesn't explain things as well as Colt does.  Colt explains with the assumption that the listener is pretty green, quite literally - sometimes he over-explains to the point where it's as if he assumes the listener is an actual vegetable.   This is not a criticism, this is a GOOD, GOOD, thing.  This really hammered things home.  Ian speaks as if you are a little more of a coder, and he ends up copying and pasting a lot of stuff, which I didn't appreciate.  Going forward, to keep up with that consistency, he might consider Colt's style.  Ellie's videos are more similar in presentation to Colt, but he seems a bit wooden in his delivery - but in the Closures lecture, he seems a bit more organic, and so if he continues to lecture here, I'm sure he's not got much to go to match Colt.I never utilized the Q&A really, but I did appreciate that Ian seemed quite responsive, so that's a great thing. A few times I did have some issues, but those questions had usually already been asked, so no complaints.OK, enough bickering, what did I actually like?  Quite a bit.I finally feel like I've got a solid understanding of RESTful practices and HTTP requests, something that had me scratching my head before this course, and something that I truthfully thought I would never grasp.  A++I feel more comfortable using APIs, and JSON data - this is an area that would be great to expand on in a part 2 course.  ANodeJS - I'm much more comfortable with this that I was before - at 0 experience, so naturally so, and this course has me excited to keep on learning about it.  NPM packages, ditto. A++Heroku and git, and github - I've wondered about these for a long, long time, and I feel like I have a pretty good foundation going forward on them, and I'm excited about that.  A++Probably the most important thing here - I feel like Colt's style really gets you thinking like a developer, making incremental changes, testing, backing up your data, cleaning up, leaving relevant comments in your stuff - that can't be stressed enough.  A++Ellie's last little bit was also pretty dang helpful in starting to understand the more advanced JS topics that I'd come across but aren't usually touched in introductory material - so very much appreciated for that little overview.  And I'm excited to learn more there, as well.  A nice way to whet your appetite for sure.All in all, at the time of writing this, this is the best education resource I've come across for web development, and trust when I say, I've tried quite a bit of it.  I'm not knocking that other stuff, I learned a lot from it (as a result I flew through the early videos at 1.25, 1.5 and sometimes even 2x speed) but this course can turbo charge that.  I highly recommend it."
  },
  {
    "no": 44,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 44,
    "name": "Bernard DeLuca",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I thoroughly enjoyed this course!  It greatly improved my knowledge and understanding of critical concepts.  Colt did an outstanding job of clearly demonstrating each topic and reiterating its placement and importance within a larger project.  I found this to be essential to my overall understanding.  Also, it was great that Ian was highly active with Q&A along with keeping students informed of critical details along the way.  Many courses do a good job of explaining the \"what and how\" regarding each concept, including what the concept accomplishes and how it is coded, but putting those concepts together within the context of a larger project really helped me understand the \"when and why\" of each concept, clearly teaching when and why each concept is used within a larger project.  In my opinion, this is what sets this course apart.  It was absolutely worth the investment of time and money.   I'm grateful to Colt, Ian, and others for providing this excellent course.  Since this course is continuously updated, I would recommend a future section discussing employment search, interviewing tips, and related topics in order to help students achieve the ultimate goal of being hired.  This would certainly be the icing on the cake!  :)"
  },
  {
    "no": 45,
    "date": "2017-06-09 04:07:18",
    "fromNow": "15 days ago",
    "user": 45,
    "name": "Idan Lottan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "One of the best courses I've seen, The instructor teaches very well and the Q&A is just amazing, so much helpful people that answer questions daily in the Q&A section. I've learned a lot from this course and I recommend it to beginner web developers"
  },
  {
    "no": 46,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 46,
    "name": "Dominic Torruellas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very well done course. Good exercises during the HTML, CSS, and Javascript. One thing I would like to see in the future are some exercises for the back-end parts of the course to practice concepts. Colt and Ian do a great job with the code along and go over things multiple times to drive them in so I am not deducting for this."
  },
  {
    "no": 47,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 47,
    "name": "Prince Dèvon Davis",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course. Very worthwhile. Without a doubt I would recommend this course to anyone fresh to the concepts of web development and wants to get their hands dirty."
  },
  {
    "no": 48,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 48,
    "name": "Jay Pelino",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt covers a LOT of information, and presents it in a very logical progression that allows each new concept to not only build upon, but further internalize previously introduced concepts.  I think the thing I appreciated most about this course is that it forges a very clear path through various choices (e.g. which development environment to use, which npm packages to install) that leaves you with a manageable and effective toolbox and relieves the stress associated with trying to search for the \"right\" or \"best\" way to make a website."
  },
  {
    "no": 49,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 49,
    "name": "Gerard Genovese",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "5/5This course goes through the basics for HTML, CSS, JavaScript, jQuery, Node js with npm, GIT, and is a great tool for beginners looking to hit the ground running.The program is taught beautifully by Colt and Ian is always on the forums answering questions with any problems or mistakes that you may come across which is such a huge help with online material. I had a great time taking this course and learned a lot from it! I would recommend it to anyone looking to develop a solid foundation in web development."
  },
  {
    "no": 50,
    "date": "2017-06-11 04:07:18",
    "fromNow": "13 days ago",
    "user": 50,
    "name": "Dominic Owino Okelo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is one of the top-most courses in udemy,why?,Well,because it really is,i have learnt so much that am feeling like paying more than what i paid.Colt is dearly a great instructor,from ajax to apis ,from RESTFUL BLOG to  complicated YELPCAMP.....This is the course your Webdev friend told you about.No regrets!!!!.Take this course for your own good."
  },
  {
    "no": 51,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 51,
    "name": "Chris Maris",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course covers a lot of areas.  The learning format with the step by step code along was very helpful. Rather than just showing you just what to type, the inner workings were explained along the way."
  },
  {
    "no": 52,
    "date": "2017-06-19 04:07:18",
    "fromNow": "5 days ago",
    "user": 52,
    "name": "Mostafa Darehzereshki",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Absolutely incredible! You know there are significant differences between being a professional and a good teacher. Maybe you know 1000 things about something and you can just transfer 2 of them to others. In other hand you can know 100 things and transfer all that 100 to people.I think in this course everything is put together in a very efficient way and firmly recommended for every one looking for to start.(P.S)If you are a developer, this course is a very good way to start with node.js and express."
  },
  {
    "no": 53,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 53,
    "name": "Christoph Guettinger",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "First up: this is the best full-stack web development course that I have come across as of yet (and I have tried a few on different platforms). You get tons of value from this course and it will work for absolute beginners and those who have some prior knowledge.Colt (the teacher) is fantastic, engaging and keeps you motivated. The tools and concepts taught are relevant and you learn by some cool examples projects. The main project you will complete is something you can build on, which is great.If you want to learn about web development but don't know where to get started - this is the course for you. You really can't go wrong with this course. With this course you also won't waste time on an outdated technology stack. The stack used in the course is highly relevant and you get tons of resources out there, which you can build on after you have completed the course.I also felt that the choice of a Javascript based stack makes a lot of sense - you will struggle to avoid learning Javacript if you are serious about writing code for the web.Why I haven't given it 5 stars? I felt that towards the end some of the concepts used could have been better explained and the advanced Javascript (the tricky stuff) section was completely out of context for me (this is about 10 units out of 330, so a tiny portion).The examples in this section are very abstract compared to the rest of the course and hence, a bit hard to transfer >> this should be improved by teaching this section with more practical examples e.g. advanced features in YelpCamp (the main course project).And, Colt - please add some 'goodbye' video to the end - you disappear very abruptly and without warning from the videos towards the end. After having spent endless hours with you in class, this is very hard to comprehend as a student ... but, where did he go??? :)Seriously - this course is awesome. Get it and complete it!"
  },
  {
    "no": 54,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 54,
    "name": "Ondo SETI",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am absolutely astonished by this course. Colt is easy to listen, takes attention, and is incredibly capable to transfer knowledge in no time. Great lectures and great examples made my programming learning easier, faster, and most important of all - so interesting and fun!  Colt, once again, thank you for making this course. And yes, say Rusty hello in my behalf! Woof!"
  },
  {
    "no": 55,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 55,
    "name": "Mario Vinti",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt has a great gift for not only being a great web developer, but also a great communicator and teacher. He's systematic in his methodology/pedagogy, and he knows how to break down complex ideas and make them understandable. I was not disappointed at all! I very much enjoyed the course and am looking forward to continuing my learning as a web developer."
  },
  {
    "no": 56,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 56,
    "name": "Nathaniel Truong",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have taken many awesome Udemy courses taught by awesome instructors. But I have to say that this is the best Udemy course I have taken so far. Colt teaches you web development from the ground up and goes over a ton valuable material in a pleasantly engaging way. Colt, Ian, and his team show that they really care about your learning and are very responsive to students' questions. They always update their course material to ensure your learning the relevant technologies, which is very rare even among other Udemy instructors. Whether you are a beginner or someone who wants to fill in the gaps of their web development understanding (depending on the tools you want to use), this is currently the best course out there."
  },
  {
    "no": 57,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 57,
    "name": "Felipe Sotelo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt is a great instructor, and his lessons are very informative and easy to follow. The course follows a great structure, and keeps you engaged. It is a great intro course for web development."
  },
  {
    "no": 58,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 58,
    "name": "Arturo Filio",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I gave it 5 stars because this course really has everything for a student to learn how to become a proper full-stack web developer. Colt teaches you basics of front-end and then he goes in depth on it. After having a really good grasp and handling of front end you start learning back-end. Same thing, Colt takes you from basics to the more complicated stuff that back-end has, but all of this in such a way that you understand it so clearly.I didn't want to review the course until I taken the majority of the lectures, and now taken 82% percent of this course, I can say that this is one of the best if not the best course on web development out there. The technology seen is up to date and super relevant, tutorials are up to date, and the attention from the T.A. Ian, in case you have doubts, is excellent. I really want to see more courses from these guys cause they really are the best and If you are reading this and deciding whether to take it or not (apart that it was 100% worth it) take the course having the 60 days refund and see for your self if the course is good or not.Overall, It exceeded my expectations, excellent course!!"
  },
  {
    "no": 59,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 59,
    "name": "Jaeson Jackson",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Course is incomplete and missing content in sections. There is still an abundance of very useful instruction, but, as I noted, the course is incomplete and there is no timeline as to when (or if) Colt will return to complete the course. The TA Ian is extremely helpful however."
  },
  {
    "no": 60,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 60,
    "name": "Cheryl Rick",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As the class goes on, it has been becoming more and more interesting. The projects are fun to work with. Especially the YelpCamp project. I also learn about how to upload the project on Heroku, which is something I always wonder about.The instructor explaining each subject clearly.Thanks, Colt, Ian, and Elie!"
  },
  {
    "no": 61,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 61,
    "name": "Vincent Rellum",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an amazing courseIt really helps you with learning all you need to know to become a web developer"
  },
  {
    "no": 62,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 62,
    "name": "Raluca Gilceava",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The explanations are great! I can't believe I am learning so many things and so much easier than I thought. Colt, Ian and Elie are such amazing teachers! I would recommend this to anyone who has an interest in web development. I is a great starting point if you want to learn Web Development and maybe make a career out of it.UPDATE:I landed a job as a Level 1 Web Developer thanks to this course. I answered the  interview questions without trouble and I did the task I received as second part of the interview from start to finish thanks to this course. Thank you Colt and thank you Ian for creating such a great course!"
  },
  {
    "no": 63,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 63,
    "name": "AJ",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is one of the best courses for web development out there. I recommend it to everyone.Colt is an amazing instructor. He communicate the ideas, the code, and the reasons for everything he is doing very clearly.The course uses the latest technologies. I took so many other courses online and I did not complete them because any code I wrote was outdated, and libraries do not work.The course starts from the basics of programming to advanced skills, anyone with or without experience can benefit from this course.Thank you very much, Colt."
  },
  {
    "no": 64,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 64,
    "name": "Muhammad Rizki Fikriansyah",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've just finished the course. This course has taught me everything from front end to back end development. Eventhough colt and ian described everything so clearly, i think that something is still missing from the course. Colt taught me how to be a developer, we have to do our own reasearch and so on, instead of watching him explaining things. I guess it's the googling practice that i as developer has to maintain."
  },
  {
    "no": 65,
    "date": "2017-06-21 04:07:18",
    "fromNow": "3 days ago",
    "user": 65,
    "name": "Emily Martins",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall this course is great! I am able to follow along well and the exercises help me retain the information. Colt is very concise and you can tell there was a lot of thought and planning put into the course. Losing half a star for some weird edits later in the course. Also some things are out of date but the TA is pretty good at adding explanations for updates. I don't know that I'll have enough skills for a job after this course but definitely a great foundation to work on my own projects and continue building skills."
  },
  {
    "no": 66,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 66,
    "name": "Domagoj Pavić",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Easy start, very explainatory and professional. I would highly recommend this course as one of the best courses money can buy. I would definitely take the other Colt's course also - definitely!"
  },
  {
    "no": 67,
    "date": "2016-09-24 04:07:18",
    "fromNow": "9 months ago",
    "user": 67,
    "name": "Spurgeon Brooks",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's very easy to understand. For javascript, can you please make an example for the files that has been created before. It would be very easy if the codes will be applied to the previous exercises. Thank you."
  },
  {
    "no": 68,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 68,
    "name": "Andrew Wong",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt and Ian (Class TA) are extremely quick with questions and the class is paced very well. Towards later half of class it becomes more of a code-along rather than having exercises, and material from the first half can seem to fade away from memory."
  },
  {
    "no": 69,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 69,
    "name": "Stasys",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course gives all the knowledge needed to start building websites with frontend(javascript, css, html, bootstrap) and backend (nodejs, express). Information in this course is very well structured and easy to digest. Community is active, questions are answered."
  },
  {
    "no": 70,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 70,
    "name": "Zi Nguyen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is simply awesome. Colt is very knowledgable and knows the materials well (as he already taught at numbers of bootcamps). He explains everything clearly and thoroughly and also gives you extra info to dive deeper into the subjects. The course will give you enough understanding of web development to build something on your own. Another great thing about the course is the support. You're never alone while learning to program. Thanks Colt and Ian again for an amazing and impactful course."
  },
  {
    "no": 71,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 71,
    "name": "Andrew Holloway",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So I enrolled in this course with a pretty solid understanding of BASIC HTML and BASIC CSS as well as a little javascript, but Colt man. He's a solid dude you can tell he's been doing this for a good while, and not only that he's very considerate of the learner. He goes step by step showing you the ins and outs of the language or framework or library your working with and most importantly for my style of learning he explains the why. Why we do it this way instead of this way why I put code in this order instead of this order why seeding the database can be useful at times. Another awesome thing is if you have a question you can expect an answer in the Q&A section. This is a really nice course I highly recommend it to those of you feel intimidated by the mere idea of learning about server-side programming or those of you who are new to writing code in general. You won't learn everything there is to know about javascript or anything like that but the amount of concepts and materials covered is extensive and you'll have the tools you need to keep making and learning how to make dope stuff. P.S the instructor keeps the course up to date"
  },
  {
    "no": 72,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 72,
    "name": "Leon Schulman",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really liked this course, as it helped me review and learn new techniques for HTML, CSS, Javascript and Jquery.The backend part was a great introduction to tools like the Cloud 9 IDE, Git and Deployment.The only thing I would like to add to the end is a final project, that would go through building a site, like the YelpCamp from scratch..... but I can always go back through the lessons :)"
  },
  {
    "no": 73,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 73,
    "name": "David Adele",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course! Would recommend to anybody interested in making a start in the web development scene. It establishes a solid foundation to continue ones learning."
  },
  {
    "no": 74,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 74,
    "name": "Lixue Zhang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "excellent experience. I learned this course within two months, and gained the knowledge about both frontend and backend. It's really helpful. Thanks Colt and TA."
  },
  {
    "no": 75,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 75,
    "name": "Jay Dinh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've been putting off this review for a long time because I'm always lost for words for this course. I've bought many coding courses on Udemy and by far, this is the best of the best.Have you ever had a great teacher that simplifies things for you, not only that but show you examples and give you exercises to help you fully understand concepts?To phrase that again, have you ever had that kind of teacher on Udemy?Starting Colt's course, I already knew HTML and CSS, thinking I would have to skip those lectures. But there were a few (important) things that flew over my head. Going through the HTML and CSS sections and doing all the exercises was not only fun but helped me understand it so much better. This course stays great consistently. Right now, I am on the backend section. I have never learned backend before, however, Colt explains things so well. If you want to get into Web Development, I HIGHLY recommend this course."
  },
  {
    "no": 76,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 76,
    "name": "Deep Patel",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative and easy to follow along whether a beginner or for someone who has a background in development in general. Wish there was more, but Colt has other things to do in the meantime Im sure. There is plenty of content here to get someone started on a project."
  },
  {
    "no": 77,
    "date": "2017-06-08 04:07:18",
    "fromNow": "16 days ago",
    "user": 77,
    "name": "Noah MacCallum",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is awesome, learning tons and the instructor is funny, quick, smart and explains things well. This course has a huge amount of information and is definitely worth going through to the end. Glad I invested the time, and amazing value for $10."
  },
  {
    "no": 78,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 78,
    "name": "Sabrina Tjeng",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The Web Developer Bootcamp is definitely a course that beginners can take without feeling lost, and novices can go through to brush up on their skills as well if they have dabbled in HTML, CSS and Javascript prior to the course but never had a good grounding in those programming languages.As a non-native English speaker, I found that the language Colt used in his explanations easy to understand, which allowed me to grasp the concepts easily and quickly. However, I feel that the really distinctive factor that made this course shine is Ian, the course's Teaching Assistant.Throughout the duration of the course, Ian will unfailingly respond to any queries you have, no matter how small or simple (usually within 24 hours as well so you're never stuck on a segment of the course for too long). He is able to pinpoint your problems/the bug in your code even with the little information he is given, and he always takes the time to make sure that he has understood your question correctly before replying.If you want to learn all about webdev from the ground up and you're stuck choosing between the many webdev courses that Udemy offers, then I would suggest you to take this one. The course focuses solely on getting you to improve your programming skills, and does not try to sell anything or deviate into making you the next big startup/entrepreneur. Despite being 40-or-so hours long, it absolutely does not drag out at any point, and coupled with Colt's simple yet excellent explanations as well as Ian's dedication to his role as a TA, you truly get what you paid for."
  },
  {
    "no": 79,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 79,
    "name": "Michael Hanes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've done programming for a few years, but as hardly any of it has focused on web technology, I've felt locked out of many of the most exciting computer applications currently in development.  Not anymore.  The Web Developer Bootcamp provides an outstanding, in-depth, well-paced overview of the core technologies needed to build web applications from start to finish.  And not only that, but most of the course is hands-on, walking me through the steps to making a large project but also encouraging me to leverage other peoples' code and knowledge to be more effective.As I approach the end of the course, I can see some subjects that I feel are very important for developing web applications professionally, but aren't covered.  In particular, the course would benefit from more emphasis on strategies for dealing with the asynchronous operations typical of server code (JavaScript promises and Mongo pre/post data hooks, for instance).It is a testament to the course's quality and breadth of coverage, however, that I felt confident in my ability to learn and apply techniques that seemed to be missing from the curriculum.Overall, the course doesn't quite get me from web developer neophyte to professional.  But it's a rock-solid foundation to build on."
  },
  {
    "no": 80,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 80,
    "name": "George Hielscher",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Review after finishing the course. Colt does an excellent job of explaining all the HTML, CSS, Javascript, and Node.js concepts, in an order that avoids initial confusion. The class moves fast, but not too fast, and there are usually chances to practice repeatedly with what we learned. Colt provides great introductions and summaries around the pieces of content that he teaches, which ensures that the students understand what they are supposed to be learning. If ever we missed something, we can go back and watch that part of the lesson again.Some ending videos are presented by Ian and Elie. Those are good, but not as engaging as the lessons presented by Colt. Still it is easy to learn what Ian and Elie are presenting. (And I have to say that, once I got used to Elie, he was easy to follow too.)Overall, the course was intense and amazing, and a great value for the sale price. I will look for other courses by Colt and Elie in the future."
  },
  {
    "no": 81,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 81,
    "name": "Tony Adzinikolov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The most comprehensive course on web dev out there. I have seen so many courses, and so many could not finish- whether because of the fact that the code did not work, it was older technologies, they did not have talent for explaining clearly or simply the presentation was utterly boring.  Colt is fantastic teacher, combining clarity, repetition, different aspects of looking at the same problem and is simply engaging. Can not wait for other courses from him. Totally recommending!!"
  },
  {
    "no": 82,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 82,
    "name": "Maxim Korotkov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "That was my first course on Udemy.Everything was very easy to understand and implement in real world later (i guess, it's all up to the instructor and his ability to explain complicated things in an easy way!). Sometimesi was a little frustrated in the backend section, where Colt  was making small mistakes in his code and then fixing them in following videos. The material there was really hard to understand and remember. But i made it and now i have alot of knowledge in Web Dev area (compared to little to nothing i knew before enrolling on this course). Thank you!"
  },
  {
    "no": 83,
    "date": "2017-06-23 04:07:18",
    "fromNow": "a day ago",
    "user": 83,
    "name": "Souvik Mandal",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt is a great teacher and the content is of great quality as well. He dives deep into the subject matter we learn a lot with various practice exercises  and mini projects. And of course there is the YelpCamp project which is like a capstone project at the end of this course. It's massive and we learn a lot by creating it."
  },
  {
    "no": 84,
    "date": "2017-06-21 04:07:18",
    "fromNow": "3 days ago",
    "user": 84,
    "name": "Ali Raza",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course to start the journey as a web dev, covers a lot of great interesting topics. maybe the yelpcamp idea could be changed to something a more fun.... just an opinion tho some people might actually like it. Also it would be great if the deployment method for aws was taught rather than heroku."
  },
  {
    "no": 85,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 85,
    "name": "Donald R. Kindred",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is fantastic.  I believe it is the \"gold standard\" that other courses will be compared to.  Colt is concise, technically accurate, extremely well organized and easy to understand.  He does a fantastic job of covering a LOT of good material.Not only does Colt teach about Node.js, Expressjs, etc., he teaches you how to be a good developer.  Eg. how to find the information you need via google.Along the way, Colt gives a number of links to really good web sites that contain some really cool developer related information."
  },
  {
    "no": 86,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 86,
    "name": "Michael Yang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is well organized, and Colt did a great job present all of the fundamental concepts and technologies for web development. Also those practical projects are very helpful. I really enjoyed this course, and learned a lot!"
  },
  {
    "no": 87,
    "date": "2016-12-24 04:07:18",
    "fromNow": "6 months ago",
    "user": 87,
    "name": "Edward Bentley",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course started out a little slow, but since it got into the js it picked up nicely. I currently had some very basic programming skills, and would get confused or lost when trying to further my understanding, but for some reason I'm looking at it from a different perspective now. I'm looking forward to completing the course.I love this course the instructor Colt Steele is very knowledgeable in programming and takes the time to explains things well, as we go through the course. Love it."
  },
  {
    "no": 88,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 88,
    "name": "Augustine Gomes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent Instructions...Well Structured...Awesome Instructors.. and well thought out tasks and projects..."
  },
  {
    "no": 89,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 89,
    "name": "Aristeidis Pantelakis",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very well structured course!It was exactly what i was looking for!If you are a beginner you should definitely take that course!Very good Job!Thank you all,hope to see more in the future!"
  },
  {
    "no": 90,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 90,
    "name": "Aidan Nolan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has great content for all levels of ability. I was a novice at the start, having used lots of other free learning tools online, but this course has smoothed out my knowledge and filled in a lot of gaps. After completing the course, and having deployed a few basic apps, I feel like I have demonstrable skills that I can use to create \"real world\" websites. I highly recommend it for anyone wanting to learn more about web development"
  },
  {
    "no": 91,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 91,
    "name": "Edward Plato",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course! I recommend repeating any parts that give even the smallest bit of confusion to really drive the concept home. Everything builds on older lessons, so I found going back to completed lessons for review was really helpful. Also, pause and do all recommended reading, especially MDN docs. Finally, you need multiple screens to move at a good pace and get the most out of this kind of instruction."
  },
  {
    "no": 92,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 92,
    "name": "Vladimir Bozhinovski",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's one of the best courses you can find nowadays. It will take you from basic knowledge to some of the advanced concepts of the web.  There is lack of HTML5 and CSS3 lessons, but anyway it deserves 5 star rating."
  },
  {
    "no": 93,
    "date": "2017-06-04 04:07:18",
    "fromNow": "20 days ago",
    "user": 93,
    "name": "Fahad Rahman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Done more than half the course and I'm very impressed by Colt's teaching methods and pleasantly surprised by how much I'm actually learning, especially since this is my first online course ever. Would definitely recommend."
  },
  {
    "no": 94,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 94,
    "name": "Vignesh Ashokan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a really comprehensive course for beginners on web development. The addition of Git and website deployment modules adds a nice touch and gives an idea about what happens after development. By the end of the course, I had basic to intermediate knowledge of all the technologies taught, however I would advice students to take an advanced course as well to get a grasp on the subject. Towards the end, I found a few lectures missing on topics Colt says he would to cover, like integration of Google Maps, introduction to GitHub, etc. but I don't think that's a deal breaker. You can actually take it as an assignment to do some research and teach yourself those minor topics.All the concepts are explained thoroughly. He also takes the extra effort of explaining why something should not be done by deliberately making the mistake and elaborating on it. Colt manages to keep the course interesting throughout and teaches the topics which are currently sought after by the recruiters. This helped me as a student to be engrossed in the lectures and not lose focus. I would definitely recommend this course to an aspiring web developer with zero knowledge on web technologies.Thanks for the amazing course Colt!"
  },
  {
    "no": 95,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 95,
    "name": "Michael Cleary",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best JavaScript course I have seen!  Highly recommend for anyone who does not have time for a physical bootcamp or is thinking about going to one in the future.  Colt really knows how to explain the difficult parts so that anyone can follow along and skips all the things that college courses and bootcamps normally waste your time with that you don't really need to know."
  },
  {
    "no": 96,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 96,
    "name": "Mark Whitbeck",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Hands down the very best webdev bootcamp course to get you up and coding with a great understanding of the presented materials. The are code-alongs that reinforce each unit's learning objective and a recap of each lesson to reinforce your learning."
  },
  {
    "no": 97,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 97,
    "name": "ray81415 .",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is a detail course. I think it can improve your web skill, absolutely. I really thanks for Colt's teaching and he is the good speaker^^"
  },
  {
    "no": 98,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 98,
    "name": "Kelyn Mann",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course does a very good job of breaking things down and really explaining them. I do wish that it would go into a little more detail at points, but I can always do a bit of research outside of the course for more details on that.Also the course TA does a good job of responding to all inquires very quickly."
  },
  {
    "no": 99,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 99,
    "name": "Joe Previte",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt explains exactly what he is going to talk about. He covers everything and talks in a way that makes the content comprehensible.This is exactly what I've been looking for! We've moved from HTML to CSS to Javascript to DOM and I finally understand how they all interact together! In addition, I now have a better understanding of back-end and how to write an app that has both front-end and back-end."
  },
  {
    "no": 100,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 100,
    "name": "Oren Farhan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very clear and good explanations, easy to follow and understand.Fun to see Rusty coming out behind every line of code :)Great job.Keep it up."
  },
  {
    "no": 101,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 101,
    "name": "Avinash Jadhav",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I just completed this massive course! Loved it! Excellent course in an excellent format with lots of explanation. I would recommend it to anyone interested in this WebDevBootCamp.I was able to use many of the techniques and templates in my work right away.  It’s an incredible value for your financial and time investment. Also, the available resources are very well organized and provide you with a set of code templates to quickstart any future project.The course is professionally produced, and the explanations are clear and concise. Upon completion, you will have learned a huge set of techniques to apply in your web development career.Thanks COLT!"
  },
  {
    "no": 102,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 102,
    "name": "Jonathan",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The front end portion of the class was excellent. I especially liked the exercise/solution format for that section. The backend portion was a little trickier. There's so many different directions it can go, I felt I was coding along without understanding some of the underlying concepts. I did, however, get a good sense for where I need to do my own research to further understand."
  },
  {
    "no": 103,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 103,
    "name": "Linards Lazdiņš",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course completely changed my mind about web developing. I would recommend this course to everyone who is looking to become a web developer. Thank you once again for this course!"
  },
  {
    "no": 104,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 104,
    "name": "Heather Cloward",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt Steele does a great job not only walking students through how to do things, but explaining why and giving ample opportunity to practice concepts on their own."
  },
  {
    "no": 105,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 105,
    "name": "Larry Hudson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt has a very methodical approach to presenting the material, building on concepts that you learn as you go.  Very well thought out and easy to follow.  A GREAT instructor !"
  },
  {
    "no": 106,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 106,
    "name": "Steve De Pooter",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thanks Colt!! I've learned so much more in your course than in any other material I've found on the net. I can't wait to see your next courses comming out!"
  },
  {
    "no": 107,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 107,
    "name": "Lucas Shimizu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very clear, foccused and diadactic material. Even for a brazilian student. I just finished the course and I'm really satisfied of all I've learned through this course. Highly recommend it!!"
  },
  {
    "no": 108,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 108,
    "name": "Matt D'Angeli",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Most of the beginning of this course is going to be review for me.  Since I'm still early on in the course, my praise might be a bit diluted; however, this already appears to be better than any other resource I have experienced to learning web development.  Excellent course, and the instructor speaks very clearly and at a good pace.  The reason I didn't rate the full 5 is because there is definitely some filler that can be cut out.By the time I finished up the Javascript part of the course and basic DOM, I have already learned more about web development than I ever have before.  Next review update will likely come after jQuery.Learning jQuery from Colt was a wonderful experience.  It made understanding the DOM extremely simple, and following it up with the ToDo list project was even more helpful.  Working on the Patatap clone now, and I look forward to getting into the remainder of the course!Finally finished the whole course.  Easily the most helpful full-stack web development course I've ever taken.  When going through the user-authentication stuff with Passport, it would have been nice if Colt had explained that you can add properties to the User object, and how to use Passport beyond simply username, salt, and hash; however, deployment was quick and easy, and it was simple enough to set up a local MongoDB instance with node as opposed to on Cloud9.  Would highly, highly recommend this course to anyone wanting to start learning full-stack web development."
  },
  {
    "no": 109,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 109,
    "name": "Žan Fras",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt is just an amazing instructor, everything is explained really good. Ian is also amazing assistant who is always quick and helpful.I only wish Colt could teach whole course and that maybe we could cover ES6 aswell."
  },
  {
    "no": 110,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 110,
    "name": "Ari Surprise",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Web design is certainly one of the more difficult subjects to teach comprehensively.  It is compartmentalized modularly over so many different languages, each dedicated to a separate small component of overall functionality, causing a beginner to have to completely come to a halt in one aspect of their learning & start over with a whole other process, then learn how the languages integrate & communicate to make a better, more informed end product.  Every iteration of change takes years to come into common practice acceptable for standardized usage, & years more have to go by to see more outdated & troubling practices fall into obsolescence.  That said, Colt does quite a good job of abstracting out so much that can confuse people getting into web design while they're getting the hang of the important formative concepts, & breaking down what's happening as it makes sense to discuss without alienating much of the audience.  He also keeps the course well updated, & a studious eye will clearly see the care taken to the delivery of that process.  Overall, I agree with most of the decisions taken on which languages & what direction as it made for a fairly helpful course in streamlining what hoops need to be jumped through being greatly mitigated. My personal goal in taking this course was in furthering my knowledge of backend development, & I do feel some of the content therein does still come up short though, as it still doesn't quite cover foundational principles thoroughly enough.  A good emphasis in this course is placed, early & often, on the importance of searching for your own answers with the whole of the internet before coming here, and while that is an important skill every professional needs, the competence required to narrow results to be more pertinent & ability to legibly sift through results to more pertinently find what one is looking for is often overlooked, and it often requires a thorough knowledge of nomenclature which requires that most basic understanding of low level, core concepts to achieve.  I do think the teaching of this course takes an appreciation of that fact, but many sections towards the backend simply aren't there yet in delivering on those core concepts, & although some are stated as planned, I have no idea when to expect to see any of it.Most odd to me is the complete omission of XAMPP stacks as they are certainly the more classic approach which will teach much of that basic understanding, even if there are many modern alternatives which are more competitive to be skilled in, but even then, when opting instead in favor of teaching a MEAN stack flow (overall, a far superior option for beginners to learn on, certainly), not even covering what Angular is, what it's good for, or why it's not in the course seems odd when it's definitely a standard component people learning this way will need to be familiar with to get work.I definitely sorely missed the promised section which the introductory auth section alluded to coming at the end, which would teach it from the ground up without passport, as most of all in backend I feel insecure about handling others' sensitive information & claiming to be a working professional, and I was hoping the auth section would cover more about encryption techniques & best practices, and a from scratch auth section seemed like it'd be a great place to cover many of the core concepts there.I could see most of the LAMP backend as being optional  at best would make more sense, but MySQL for one I'd say is more foundational than that.  While the database section covers MongoDB adequately for someone to use it, I did not feel it did an adequate job for me to feel comfortable administrating one, as there was no talk about database backup or restore, file I/O, or really any tools that would help in keeping you in charge of managing your own data thoroughly, and overall, I really felt a compartmentalized, part SQL database would have better illustrated the core differences with a relational database versus a non relational one, albeit a more convoluted process for people to understand.  MySQL is pretty foundational & important, and it could have started with MySQL for the content that fit well into a relational database, then expanded into MongoDB in a later section for the content which is better stored in a non-relational style, have the 2 link together after that, & better teach principles along the way.File I/O is also a really important section to cover in general whether that's the preferred approach to database management or not that I feel was totally skipped, & could at least be touched upon in yelpcamp by adding avatar uploads, then...some feature which I honestly don't have an idea for a feature to offer IN yelpcamp for a reason for iterating over an external file's contents & reading that into the database somehow.Anyhow, I'm obviously picky, I just consider a bootcamp something more comprehensive than is quite here so far.  Still overall a very worthwhile course for your time & money: it's concise, thorough enough to get yourself started, & to the point.  I just hope more of that content is what's planned on the way."
  },
  {
    "no": 111,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 111,
    "name": "Nick Nelson",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was my first time really immersing myself in web development. Colt and Ian did a great job of exploring the many important pieces of this side of development.It's almost perfect; however, it's missing testing (unit, integration, system) and discussion on the best way to abstract our code when using Node, Express, and MongoDB. I personally believe both of those concepts can not be excluded if you are making a one-stop shop for getting started with any kind of development.Other than those points, Colt is a great instructor and knows how to bring a subject home before moving onto the next thing. Definitely recommended for real beginners."
  },
  {
    "no": 112,
    "date": "2017-06-07 04:07:18",
    "fromNow": "17 days ago",
    "user": 112,
    "name": "Waleed Hashim",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I highly recommend this course to anyone new to web development!Thank you Colt and Ian."
  },
  {
    "no": 113,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 113,
    "name": "Eric Richmond",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "good overview.  well thought out. well spoken.am a bit concerned that the teaching methodology is not about mastery, but about limited example and the hope that someone will master more later."
  },
  {
    "no": 114,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 114,
    "name": "Jose Ricardo Guilherme Ferreira",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A very complete course for beginners, that covers all you need to know incl. git and the deploying process! The Restful topics are also awesome. I highly recommend it!"
  },
  {
    "no": 115,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 115,
    "name": "Josh Holtom",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really enjoyed the quality, content and level of communication throughout the course. I also liked the fact that there were varied tasks that are interrelated, and are finally brought together in the final project. I total I took a fairly active approach to study, in that I gave 3-6 hours most nights a week and finished in 6 weeks. I could have sped up, but enjoyed side-tracking myself with things like making all the earlier projects live at the same time (as opposed to one at a time) and selectable from a landing page. This I think really helped me get a good grounding in dynamic page creation, and is so beneficial being able to go back over topics at your own pace! Thanks for the amazing course!"
  },
  {
    "no": 116,
    "date": "2017-06-21 04:07:18",
    "fromNow": "3 days ago",
    "user": 116,
    "name": "Dave Powell",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A lot of information was presented in  a very well thought out and prioritized manner."
  },
  {
    "no": 117,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 117,
    "name": "Byungin Kim",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It really gives you a great overviewing experience of learning HTML/CSS/JavaScript in the frontend and NodeJS + MongoDB in the backend to create a functional website. The real value Colt delivers is _integration_. If you buy other courses or books, then they mostly focus on a single technology. For someone who wants to start learning web development, all of the names of the technology are frustrating, but this course has put it down to a single place. For the amount you pay, this course is worth taking. But then why do I not give 5 stars? Well, there are a few places that should be re-recorded; a couple of videos (two in the intermediate JavaScript) are audio-muted, and the video on github code backtracking is unfocused. Also, ideas are not easy to follow when Colt explains only with source code: it would have been much better if he had made use of charts and diagrams when explaining ideas (e.g. connect-flash). However, they are not deal-breakers. The course really is worth your time and money to get started with learning to develop a web application. Thank you, Colt. Great job!"
  },
  {
    "no": 118,
    "date": "2017-06-14 04:07:18",
    "fromNow": "10 days ago",
    "user": 118,
    "name": "Barrett Baffert",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Whether it was brushing up on what I already knew or learning about new material I had no familiarity with, I've found the course very rewarding"
  },
  {
    "no": 119,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 119,
    "name": "Casey Monaghan",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "After finishing : Although I probably know enough to get by and make similar websites to the Yelp Camp project, it feels like there's a lot still missing and I feel sort of lost, where do I go, what do I learn next? Maybe for the most part this is all I need to learn, but a lecture telling me about where I currently stand at the end of the course would be greatly appreciated. I could also use some information about where to go next, what my portfolio should look like, what jobs to apply for?    I give the Javascript portion of the course a 5, it offered a lot of enjoyable quizzes and exercises. And I rate the back end portion a 3, no quizzes/exercises, entirely a code along, seems unfinished.Overall, great course."
  },
  {
    "no": 120,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 120,
    "name": "Russell Longstaff",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Found this course very informative and enjoyable. It helped me to brush up on my Web Developer skills that I thought I had long forgotten and went even further to teach me some of the technologies that are in use today. I would strongly recommend this course for anyone wanting to start out in the web development world or like me, even if you have to bring your own skill set back up-to-date with a refresher. Excellent!"
  },
  {
    "no": 121,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 121,
    "name": "Sarad Bade Shrestha",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt is a brilliant teacher and this course is wonderfully constructed. A great learning experience!"
  },
  {
    "no": 122,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 122,
    "name": "Jackie Lin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Easy to follow, instructor explains concepts well and solutions are given. However, the course is not fully complete.  The major project in this course, while substantial, feels unfinished. Nonetheless, i highly recommend this course as i learned a lot about web development. Plus, by the time you read this review,  more content may have been added."
  },
  {
    "no": 123,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 123,
    "name": "Jon Scobie",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I would like to see a section on Angular just to complete the MEAN stack but that is me just wanting it all I suppose. I love the advanced section at the end but really wished that had been put earlier in the course. It's more about specifics of learning Javascript (and more for Node.js) rather than web development but as a professional developer in other languages, it would be nice to see this up front. Hard to balance the course for different levels I suppose. Great content and delivery throughout though!"
  },
  {
    "no": 124,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 124,
    "name": "Greg Ortega",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Amazing course!. This course teaches web development in a very clear and complete way. After this I feel more confident in building complex web apps. Definitely recommend this course to anyone wanting to lean web development."
  },
  {
    "no": 125,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 125,
    "name": "Josiah Phipps",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The content is very instructive and the code along project uses real-world examples and is very beneficial."
  },
  {
    "no": 126,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 126,
    "name": "Cyrus Villacampa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an awesome course for people wanting to become a full stack engineer/developer. Colt really explains the topics very well and provides a lot of examples and projects to make learning much easier. I also like how Colt explains all the bits and pieces that make up the Back End part of a web app. And I hope Colt will keep on updating the materials on this course to reflect changes in software and web technologies. Elie did a great job explaining the confusing parts of JS. I now fully understand does tricky bits about JS. The TA is also very helpful and active.Thanks to the Web Development Bootcamp Team"
  },
  {
    "no": 127,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 127,
    "name": "Henry Scholl",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great comprehensive course that takes you from the very basics to building javascript apps and a full-stack web app. The Javascript and Node sections were very useful and I learned a lot. I like how it is project based so you build things along the way in addition to learning new concepts. Colt is an excellent instructor who guides you step by step through the process and thoroughly explains the material. This course is an excellent primer for those looking to get into web development. I only wish there was a more advanced follow-up course for those who have completed this one and are looking to continue advancing their skills!"
  },
  {
    "no": 128,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 128,
    "name": "Leslie Lello",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was a fantastic course and I wouldn't change it in any way, except perhaps to leave out the last section on \"JavaScript - The Weird Stuff\" because after an intense Node.js learning experience it feels like backtracking by having a detailed discussion about the different ways to use 'this' in JavaScript.I wish I had more to say but that's it. This was a fantastic learning experience!And THE BEST course I have taken on Udemy.I have taken many courses on a variety of subjects and about 5 courses so far on programming, including a very in-depth Bootcamp that focused on PHP rather than Node.THIS IS BY FAR THE BEST ONE!The reason it is the best course is because Colt teaches in a clear manner, and the coding challenges, code-alongs and main project (YelpCamp) are at the appropriate level for the instructions offered just before the challenge.Also, he outlines EVERYTHING beforehand which I find extremely helpful.What I mean by that is that he (1) gives you a syllabus at the beginning, and then (2) at the beginning of each section he offers an overview of what will be learned in that section and then (3) at the beginning of most videos he outlines the main points of that specific video/lesson.When I know what is coming it makes it easier for me to remember the main takeaway concepts while I am learning, and also helps me to review if I get stuck on a topic in the future.I also love that there was one LARGE project and that each part of building that large project related to a number of mini-projects that were offered beforehand, as practice, before messing with the code on the large project.This was great because the repetition of building each page in the mini-project helped in the large YelpCamp site because it reinforced the specific code and where it goes.Again, this repetition helps me to retain the information.I can easily see myself using the course again to build a site that is something I am into, like favorite books or favorite movies. This would reinforce the process and if I did it enough I feel that this course is comprehensive enough for me to consider myself proficient in this Node stack as long as I got to the point where I was coding without assistance from the videos.My point is that there is a ton of information in this course and totally worth every dollar and every minute I devoted to it.Colt has a great sense of humor and I love Rusty. They made a potentially dry and complicated subject very fun! Also, Ian (the T.A.) is fantastic and very quick to respond to questions. I highly recommend reading the questions from other students for each video just for fun and extra learning.If you are really interested in learning JavaScript to operate both front-end and back-end web development, this is a fantastic step in that direction!"
  },
  {
    "no": 129,
    "date": "2016-12-24 04:07:18",
    "fromNow": "6 months ago",
    "user": 129,
    "name": "Evan Berger",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It took me six months to finish the course, and I finished it about six months ago - it was an excellent introduction to coding. Highly recommended"
  },
  {
    "no": 130,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 130,
    "name": "Nadia Sanchez Velasquez",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A lot of content!! Everything was very clearly explained, and whenever I stumbled across issues going through the Q&A in the lectures helped me solve my issues. When that didn't work, Ian (TA) was usually really quick to respond (once he replied back in ~20 min.).Wish the yelpcamp project was more complete, feels like it is missing something (will email Colt and/or Ian if I figure it out). Overall it has been a great experience, will update this once I complete my portfolio and find a job."
  },
  {
    "no": 131,
    "date": "2016-12-24 04:07:18",
    "fromNow": "6 months ago",
    "user": 131,
    "name": "Hakan Güçlü",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Just finished this huge course. I remember what Colt said at the very first lecture: \"This will be the only course you'll ever need to learn web development.\" At that time and in that mindset, I thought I was literally going to learn everything about web development I'll ever need to learn from this course. That was a rookie thought, I can tell now. This course does not teach you everything you need to know on web development(surprise), but it teaches you something much more valuable: learning how to learn. It may seem funny at first, but as the course went far I realized one of the most important aspect of being a successful developer is not the language in which you write or the framework you use, it's how fast you can adapt to specific environments and tools using simply information on the internet and information on the given tool's docs and other sources. As Colt introduces new tools and environments, he actually takes us to the docs, various forums and searches for specific information on a given topic. While doing side projects on my own, I found myself of lurking in the docs of a tool and pinning the exact information I need rather that searching for a tutorial on Youtube or somewhere else as the old me would do. This made me realize where I got this habit from, and it made me love the course even more. In short, I highly recommend this series to anyone who aspires to become a web developer and wishes to have the right mindset for the skill."
  },
  {
    "no": 132,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 132,
    "name": "Mike J Schorah",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm halfway through the course. I'm pretty impressed with the level of detail and am excited for YelpCamp. I don't think this compares to the comprehensiveness of a traditional boot camp, but it is definitely a great way to build skill level."
  },
  {
    "no": 133,
    "date": "2017-04-24 04:07:18",
    "fromNow": "2 months ago",
    "user": 133,
    "name": "Web Developer Christina Park",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "He demonstrates real world development but he also explains things really well to people who are new to computer science. That's a rare combination. He teaches at just the right pace- not too slow and not too fast."
  },
  {
    "no": 134,
    "date": "2017-01-24 04:07:18",
    "fromNow": "5 months ago",
    "user": 134,
    "name": "Dennis Le",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This review was overdue. Colt the instructor for the course keeps adding more and more to the content. Not just following the instructor step by step in the lecture, he explained the reason why certain things are done a certain way.  He created a course that is very well organized and thought out. Going through each section, the course gets more challenging and fun as you tackle each lecture."
  },
  {
    "no": 135,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 135,
    "name": "Jonathan Franzen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Currently about two thirds through the course. I must say I am very impressed so far and will give a summary of two areas i feel is worth discussing.Updates and support. Some of the videos seem a bit outdated by now, however the resources used are frequently updated and it might be hard to keep up. To tackle this issue however, there are exellent support in the QA aswell as notes to inform of bigger changes that might impact the current lesson. Overall it works just smoothly. And concerning the support in the QA it has so far resolved any problem and bug i have run in to so far, by only reading the replies of already asked questions. So overall, a big +.Course quality. The only con here is also one of my biggest pro's. There are no pauses or grandpa-paced typing, making it hard to keep up and code along. There is however a pause button, and once you put up your workspace in a different program/window, you can easily tab>space to keep up. This can be a bit annoying in very information heavy sections when you have to tab pause every other second and sometimes jump back half a minute because you lost focus of the entirety of what you just wrote.. however those fast and compact videos lets you pick your own pace (which is great when reaching out to a big crowd), even if it can be a little bothersome sometimes.  But best of all is that you realise that those hours of video in this course is CONTENT, and nothing else pretty much. Just pure content for you to absorb.. and very good content for that matter!These are the two areas i felt was most important to express to anyone thinking about buying this course. And in addition to what I wrote above, this course is awsome. Great content, great resources and the resources used are ofter referred to as \"optional\",  but is thoroughly explained why just that resource was chosen. Video quality is great, sound is great, everything is just above any expectation I had. If you want to start now, pick it up at full price. If you are still unsure, wait for a sale. In the end I feel like this course is worth several times the full price. It's a steal, no matter when you buy it!"
  },
  {
    "no": 136,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 136,
    "name": "Andrew Young",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "First and foremost I would like to inform anyone reading this that I rarely leave reviews let alone a 5 star one, but this course deserves it. I waited until after completing the final stage of YelpCamp to get a feel for the entire course before even considering writing a review. With that being said, here it is...Colt, without a doubt, is the best online teacher I have witnessed. I have tried searching far and wide for a course to cover the specific topics that he covers, and found none even remotely close to what he and his team has created. Not just the content itself, but how it is put together. Everything is done by building upon previous lessons learned, and it is all done in a clear and concise manner.Although Colt does deserve a great deal of credit, his TA cannot be forgotten. Ian has not only helped me, but others countless times. The moment you leave a question you can expect a swift and informative response. He has also been willing to review my code when I got caught up in a bind which helped greatly throughout the course. I could go on writing a novel about how amazing this course is, but would rather keep it short. Simply put, Colt and Ian have inspired me to continue learning as well as motivated me to keep pushing in the future. I can only dream about being as knowledgeable as them, and would hope to cross paths in the future."
  },
  {
    "no": 137,
    "date": "2017-06-21 04:07:18",
    "fromNow": "3 days ago",
    "user": 137,
    "name": "Piyushohri297@Gmail.Com",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "this is the first and best course that I ever seen.The teaching and exercises are nice .the best thing is it teaches full stack webDevelopment"
  },
  {
    "no": 138,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 138,
    "name": "Antonio Viola",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Fantastic course and really well explained. Will definitely recommend it if  you want to grasp lots of technology in only 40+ hrs.."
  },
  {
    "no": 139,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 139,
    "name": "Sun Qi Ong",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am halfway through the course. Up until now, it's very interesting and enriching. For a beginner like me with little to no background of web development, it certainly opens up a new world to me. Whether or not it will be useful to me now, it doesn't matter much, because learning is never ending. I must say, this boot-camp course is a great course! Thx Colt and Ian, and of course Rusty! HahaI shall continue learning XD"
  },
  {
    "no": 140,
    "date": "2016-12-24 04:07:18",
    "fromNow": "6 months ago",
    "user": 140,
    "name": "Diqian Qian",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear and concise. Learned a lot.This is a very comprehensive tutorial.It teaches you the basic of everything, and most importantly, I fully understand how web development works now."
  },
  {
    "no": 141,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 141,
    "name": "James Anderson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I would like to start out by saying THANK YOU. This is by far one of the best courses I have EVER taking on udemy. Everything was well structured and engaging (I couldn't put it down!). This course not only helped me on my path to becoming a better javascript developer but also taught me how to learn new languages, frameworks, libraries and etc."
  },
  {
    "no": 142,
    "date": "2017-05-24 04:07:18",
    "fromNow": "a month ago",
    "user": 142,
    "name": "Sean M.",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great overview/application of all the technologies involved with a full stack JS environment. Personally, I enjoy taking a bootcamp in this fashion as I can be alone and focus heavily and proceed through as much, or as little, coursework as I'd like in any given day. Highly recommend."
  },
  {
    "no": 143,
    "date": "2017-05-30 04:07:18",
    "fromNow": "25 days ago",
    "user": 143,
    "name": "Mark Rice",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "GREAT course. I've learned quickly with this as a guide to important parts of web development (I AM the kind to update reviews as needed so if this is not updated, then I am still happy with it). UPDATE (6/19/2017): I'm on about lecture 198 and am still very happy with what I'm learning. It helps a LOT to pause the video and play, THEN see what the teacher did. It also helps a lot to note the resources and where you can find them; walk through the process of finding them yourself rather than just copy the teacher. You will then have your list of resources (notes, links, whatever) to which you can return later.BEGINNERS will love the explanations of basic things (such as concepts of a variable and loops). I'm more experienced at programming (C++, Java) and I already knew HTML, so I skipped a lot. Yet, I had to be careful not to miss components that I didn't know like differences in JavaScript's handling of arrays, strings (immutable... WTH) and weak typing traps. So, those with experience can skip, but it could have been even faster if alternate lessons had been presented with the assumption of knowing basic concepts. No matter though, Colt is great at explaining, 1.5x speed helped me a LOT, and skipping saved tons of time. (When I'm following some coding or it's something on which I must focus heavily, I can switch bath to 1x speed (and it feels like slow motion then). OPTIONAL DETAILS: The somewhat bad side (but not really too bad, so no detractions for it): The goofs in the videos are \"corrected\" by notes just before the section. While good to know, that timing made it a little cumbersome. I'd rather someone edit the video, even if it's just a note on the screen, so I get it when I need it, and not before. I disliked having to return to it later. It was a little disruptive. ALSO, every now and then a core concept was not explained. For example, a higher order function (delayed execution) is given a second parameter, and there was no explanation that forEach is designed such that the first function reference can optionally be given this 2nd parameter for the index. A beginner will likely be baffled (if she thought of it anyway) as to how the variable was incremented. It's because forEach will update this optional parameter (and allows a third optional parameter for the list - also never mentioned). This should at least be put in a text sidebar on the video. It'd be nice to also reference the possibility of doing these with the arrow functions (like Java's lambda expressions) so a user could play with it. This is a perfectly acceptable form of a higher order functions and one will likely encounter them. So I played with that and completed some assignments with it. One cannot cover everything though, and Cort does a great job including most important concepts.Overall, I'm very happy with the course, and highly recommend it."
  },
  {
    "no": 144,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 144,
    "name": "Jordan Jay",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great overall course for an introduction to web development and good rationale for learning these technologies. Additional assignments could be added that do not necessarily need a video explaining the solution but just a posted solution."
  },
  {
    "no": 145,
    "date": "2017-03-24 04:07:18",
    "fromNow": "3 months ago",
    "user": 145,
    "name": "Gil Grencho",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the true all in one course for web development. Colt gives you value in coding, good practices, autonomy, everything!edit: I would like to add, that this course offers a really good Q&A support, you will never feel alone on figuring something out!"
  },
  {
    "no": 146,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 146,
    "name": "Garrett W Ruhmann",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Colt does a great job of taking complex concepts and making them easier to understand, and Ian is always available to answer questions and add support for the course.  Fantastic course!"
  },
  {
    "no": 147,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 147,
    "name": "Christopher Combes",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall, an excellent introduction to full stack development with Node.js. Colton has a good teaching style it was easy to follow along in the videos. Compared to other courses, this one is definitely one of the best I’ve taken so far.  The additional tutorials on JavaScript were of great help in learning the language. It's also quite long and so I recommend completing one full section per day so that you can absorb the material at a decent pace.Some issues… YelpCamp tutorial is not mobile friendly, which is both disappointing and surprising, considering building responsive websites is very important.  Building for mobile first should take precedence. The student can of course fix this but I would like a complete example to base future work on.  Also, the course is somewhat incomplete.  The YelpCamp exercise needs additional work to complete the UI, as well as provide responsiveness for mobile web browsers. It would also be nice to add a feature where, if an area requires login, that after logging in, the user is taken directly to where they were previously, rather then requiring drill-down again.Some recommendations…Shift away from Cloud 9 due to its requirements for sign-up. Learning about this tool is highly beneficial and I recommend keeping it for one section, but shift the user back to their own command-line.  Suggest using an editor such as Atom or perhaps Sublime. Teach Git just after HTML, CSS, and intro to JavaScript.  It provides a way to undo.  I think it is bad practice to create copies of the YelpCamp code for v1, v2, v3, etc, when Git should serve this purpose using tags or branches. Show new students the benefit of branching and tagging early on.  Show how to create the version tags and how to checkout earlier versions of YelpCamp if necessary.I highly suggest taken this course if you want to be a full-stack developer. The course has a nice pace to it and you build a foundation in front-end development first and then move on to back-end development. The instructor makes reference to documentation frequently which is what you will need to do during your development process."
  },
  {
    "no": 148,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 148,
    "name": "Lucas Martins Juviniano",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is pretty good for beginners on web development and programming. If you already know how to code you can watch in 1.5x or 2x that the voice still pretty clear to understand. Just miss more coding in the client side thought."
  },
  {
    "no": 149,
    "date": "2017-02-24 04:07:18",
    "fromNow": "4 months ago",
    "user": 149,
    "name": "Vijay Vedanthan",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall the course was very well constructed and presented, the yelpcamp example helped understand many of the concepts.I found that the last sections of the course were rushed through with not enough examples to work with.The last section on javascript was not intutive at all, the concepts were presented bluntly and very quick. I expected a similar model of how colt does these by actually doing  code walkthrough and then brining home the point. i suggest removing the last section, it does not fit in this course.Overall, i highly recommend this course"
  }
]