[
  {
    "no": 0,
    "date": "2017-06-12 04:23:20",
    "fromNow": "12 days ago",
    "user": 1,
    "name": "Shoreya Gupta",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "good course for the beginners.it gives you the overview how hacking world looks like. sir is very supportive and really made easy to understand. its for those who are literraly scratch in hacking.thankyou for this course . sir i like ur way of speech and content is also good"
  },
  {
    "no": 1,
    "date": "2017-06-04 04:23:20",
    "fromNow": "20 days ago",
    "user": 2,
    "name": "Thanaphon Sanongkhun",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've always wanted to learn how hackers break into a network or system and to protect yourself from that. Zaid does a good job explaining the theory and applying the theory to real-world examples and simulated environments. Good Job"
  },
  {
    "no": 2,
    "date": "2017-04-24 04:23:20",
    "fromNow": "2 months ago",
    "user": 3,
    "name": "Christoph Milcz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. Very interesting content. Nice explanations-easy to follow. Excellent instructor. Good resources and information. I´m really enjoying. Thank you."
  },
  {
    "no": 3,
    "date": "2017-04-24 04:23:20",
    "fromNow": "2 months ago",
    "user": 4,
    "name": "Alec Bickerton",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Sometimes repetitive, some of the exercises could not be followed due to the frameworks going out of data. E.g. Windows Defender blocked all the backdoors used in the course."
  },
  {
    "no": 4,
    "date": "2016-11-24 04:23:20",
    "fromNow": "7 months ago",
    "user": 5,
    "name": "Des Desmond",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has been a great course and zaid is a great teacher,the way he explains everything theoretically and then practically is very transparent and easy to understand.. and when you are at the end of the road in any area of the courses,you will be well assured of getting a response within 12hrs maximum.. i would urge anyone who is kin about pentesting  and ethical hacking to take this course without hesitation.. have really enjoyed the course and i will still remain here to keep updating my knowledge on what have learnts and follow up with new lectures from zaid,and ofcourse help in the Q & A session and also learning from other peoples questions and response they got.. Remember. if you want to take this course,you would need patience,time and be curious lol.. GOODLUCK!!"
  },
  {
    "no": 5,
    "date": "2016-11-24 04:23:20",
    "fromNow": "7 months ago",
    "user": 6,
    "name": "Sean Kennedy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I would like to compliment Mr Al-Quraishi on his course “Learn Ethical Hacking From Scratch”. The course provides a thorough grounding in the subject and the subject material is explained in a clear and concise manner.  Anyone considering subscribing should be aware the content is regularly updated. The course really deserves 5 stars"
  },
  {
    "no": 6,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 7,
    "name": "Bilal Shah",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is awesome except for the Web penetration testing section. Before that Zaid has tried to share a lot of knowledge and he always answers the questions and literally try to solve your problem as it is his own. The language used is pretty easy and the words selection is very good that even if you are not familiar with terms used in hacking or IT. He answers your questions in your video right when you were thinking them. The whole course is great, right again except for the Web pentesting section because the information shared seemed to be impractical and too basic. But i would say that zaid is the best instructor on udemy so far. I have myself enrolled in more of his courses and i am very excited about them too."
  },
  {
    "no": 7,
    "date": "2017-01-24 04:23:20",
    "fromNow": "5 months ago",
    "user": 8,
    "name": "Abdulrahman H",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really like this course because of many reasons like, it shows how to setup your own virtual lab so you would practice the course, topics are explained theoretically and practically, and what is even more interesting to me is that at any point of the course, I can ask questions and get them answered."
  },
  {
    "no": 8,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 9,
    "name": "Michael Warren Akridge",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Had some trouble  installing the software.  I wish the course had come with some sort of glossary that included all used acronyms for easy reference.  After all, understanding the course requires one to understand the acronym language used.  I intend to go through the course again and create my own.  A good course though."
  },
  {
    "no": 9,
    "date": "2017-03-24 04:23:20",
    "fromNow": "3 months ago",
    "user": 10,
    "name": "Dominik Klucka",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Hello everybody, I would recommend this course for every beginner or intermediate who wants to get stronger knowledge of Ethical Hacking. Zaid is awesome instructor and what is also important his videos are not boring.Thank you!"
  },
  {
    "no": 10,
    "date": "2017-02-24 04:23:20",
    "fromNow": "4 months ago",
    "user": 11,
    "name": "Lukas Valionis",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really enjoyed the course! I Was able to find all the answers to set up problems already answered for people who previously had the problem. Zaid (the instructor) provides clear and easy to follow explanations with practical examples you can do yourself which I really love. This course is full hands on material and at any point in the course if you want to look deeper into a specific topic you will have sufficient knowledge to continue your reasearch on your own. I am insanely grateful to Zaid for this course!"
  },
  {
    "no": 11,
    "date": "2017-03-24 04:23:20",
    "fromNow": "3 months ago",
    "user": 12,
    "name": "Rodolfo Peña García",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think it is a very interesting course, well explained by Zaid, and very much to the point. I left a half star because I think that the sections that explain very basic stuff, like what is a network, or the function of a router, should be left as an optional segment for those who are very basic bigginers."
  },
  {
    "no": 12,
    "date": "2017-03-24 04:23:20",
    "fromNow": "3 months ago",
    "user": 13,
    "name": "Andrea Malone",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I leave this rating because everything so far is easy to understand and comprehend.It was very simple and not complicated. The instructor does missed a few simple steps during his lectures, but you can always post a question and he will help you solve any problems you may in counter. Other wise  it is still understandable."
  },
  {
    "no": 13,
    "date": "2017-05-31 04:23:20",
    "fromNow": "24 days ago",
    "user": 14,
    "name": "Student Arnab Saha",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good explanations are given.Easy to replicate in my machine.I would like it if some PDF/PPT study material is added for the SQL Injection and XSS Exploit parts."
  },
  {
    "no": 14,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 15,
    "name": "Sujin Kim",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "His style of teaching is perfect to beginners.  His lecture is well organized, his explanation is clear, and best of all he gives good examples of each lectures which helps me a lot to understand better. I am about half way done of this course, and can't wait to learn more."
  },
  {
    "no": 15,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 16,
    "name": "Bevan Horgan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great coarse, covers a lot of info and a great starting point.Fast response from lecturer. I 100% recommend this for anyone interested in this field.  I have bought all of Zaid's courses, the way he explains stuff just works for me. Thank you Zaid for taking the time to create this coarse I hope it generates you a decent earning as you can see you have put a lot of time into creating a well thought out learning program."
  },
  {
    "no": 16,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 17,
    "name": "Julius Kluge",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Der Kurs ist sehr gut strukturiert und verständlich gestaltet. Er eignet sich besonders gut für Anfänger, bietet aber auch Fortgeschrittenen noch einige neue Erkenntnisse.Fragen werden sowohl vom Dozenten, als auch von den Teilnehmern zur allgemeinen Zufriedenheit beantwortet.Für alle die sich mit den Grundlagen der Network Penetration vertraut machen wollen, ist man hier gut beraten."
  },
  {
    "no": 17,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 18,
    "name": "Ashish Kumar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Said has done an amazing job with these tutorials. The Tutorials are short, concise and to the point. I just got my CEH certification from EC-Council and I can say without doubt that these tutorials have helped me immensely. Anyone who is interested and wants to pursue a career in Ethical Hacking/Penn. Testing/Cyber Security should take this course and up their knowledge. I will surely recommend this course to anyone interested in the above mentioned careers."
  },
  {
    "no": 18,
    "date": "2017-02-24 04:23:20",
    "fromNow": "4 months ago",
    "user": 19,
    "name": "Trae Spires",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a fantastic intro level course and shows some great concepts.  Zaid is very clear in his explanations and you must allow for plenty of time to follow along and take notes.  Very enjoyable course, highly recommended!"
  },
  {
    "no": 19,
    "date": "2017-01-24 04:23:20",
    "fromNow": "5 months ago",
    "user": 20,
    "name": "Jay Codi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have done 2 courses by Zaid - this one and the one on website hacking. They are  both phenomenal!! Zaid's teaching style is concise, potent and practical. So I was able to learn a LOT in short period of time while doing the exercises. He was also very prompt in replying to my queries whenever I was stuck.I highly recommend this course to anyone who wants to get started with ethical hacking."
  },
  {
    "no": 20,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 21,
    "name": "Adham EzzElArab",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "thank you zaid for this amazing course i really liked it and that what i was searching for and now i am going to learn your  web penetration testing course and more courses to be an expert ethical hacker"
  },
  {
    "no": 21,
    "date": "2017-04-24 04:23:20",
    "fromNow": "2 months ago",
    "user": 22,
    "name": "Mateo Llanes",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Probably the best hacking course so far. I'm learning everything I need to know and this course is very straight forward. I do wish he includes tasks (homework I guess?) for us to do."
  },
  {
    "no": 22,
    "date": "2017-03-24 04:23:20",
    "fromNow": "3 months ago",
    "user": 23,
    "name": "Ian Thysse",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course to get your feet wet. Because this is a largely practical based course, if you want to gain understanding of the reasons for what you are doing, you need to take some time to research some of the theory for yourself. The great thing about this course is that it gives you specific things you can study, in an order that makes sense. I would love to have the theory a little more in depth, but that would make this a huge syllabus."
  },
  {
    "no": 23,
    "date": "2017-02-24 04:23:20",
    "fromNow": "4 months ago",
    "user": 24,
    "name": "Omri Baso",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like it so far - got to learn a few cool stuff - worth buying so far - hopfully i will know what i want to know at the end of the course"
  },
  {
    "no": 24,
    "date": "2017-02-24 04:23:20",
    "fromNow": "4 months ago",
    "user": 25,
    "name": "Denis Yefanov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Interesting to watch it and videos are informative so far. Speaker is quite cool, you'll not get bored.Just finished the course, will wait for new lectures, it was really useful, thank you Zaid."
  },
  {
    "no": 25,
    "date": "2017-04-24 04:23:20",
    "fromNow": "2 months ago",
    "user": 26,
    "name": "Patrick Ethan Goh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Hi Zaid, thank you for your wonderful and informative course. I have learnt a lot from your course, on ethical hacking and website testing. This will help me in improving my skills and knowledge in preventing and testing on networks and security."
  },
  {
    "no": 26,
    "date": "2017-04-24 04:23:20",
    "fromNow": "2 months ago",
    "user": 27,
    "name": "Nik",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm probably about a third through the course now - so far it has been fantastic. I've bought several courses on Udemy for 'Ethical Hacking' and Zaid's course by far is the best. Why? Because, if like me you are somewhat new to 'hacking', he doesn't just talk about theory. He explains the concept and shows you exactly what is going on with practical examples. The way he has structured this course is fantastic. Anyway I could probably go on about how great this is, but you should take it for yourself to see! On top of this, Zaid continually helps you outside of the course when you need answers to those little things you are not getting.All in all, superb. I would not hesitate to recommend this course for a second. One thing I will say is make sure you read the Course Requirements and purchase the Wireless Card that Zaid recommends, otherwise you will just continually run into issues.Keep up the great work Zaid!"
  },
  {
    "no": 27,
    "date": "2017-05-24 04:23:20",
    "fromNow": "a month ago",
    "user": 28,
    "name": "Ivan Salaberrios",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is not too engaging. I thought of skipping ahead at times. For listening, its good to play in the background but after a while this course content sounds no less enlightening than listening to two professional hackers speak among themselves."
  },
  {
    "no": 28,
    "date": "2017-02-24 04:23:20",
    "fromNow": "4 months ago",
    "user": 29,
    "name": "Filip Telente",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thank you Zaid for this very interesting and informative course. I Really enjoyed every minute of it :)"
  },
  {
    "no": 29,
    "date": "2017-05-30 04:23:20",
    "fromNow": "25 days ago",
    "user": 30,
    "name": "Sorin Muresan",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is excellent, very good quality and very easy to learn, but some parts probably needs to be updated."
  },
  {
    "no": 30,
    "date": "2017-02-24 04:23:20",
    "fromNow": "4 months ago",
    "user": 31,
    "name": "Toni Tuunainen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course i love it all the way i learn many many great things and im ready for next one!"
  },
  {
    "no": 31,
    "date": "2017-02-24 04:23:20",
    "fromNow": "4 months ago",
    "user": 32,
    "name": "Mohamed Mohamed",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The Instructor were very organized, Gave a very  good examples and explain it in very professional way, I highly recommend this Course and looking forward for more advanced courses."
  },
  {
    "no": 32,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 33,
    "name": "Martin Balik",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Zaid is a good instructor, with  excellent presentation skills. The videos have good sound quality (understandable, good volume and without static)  and appropriate slides. From the content point of view ,it shows most of the topics that should be discussed in this type of course.  Recommended for managers of IT Departments who want to get \"their hands dirty with technical stuff\", technical people that deal with topics related to IT security, home enthusiasts, people who need introduction to IT security. Some previous Linux know-how is of a benefit (some basic concepts are quickly introduced - but maybe someone needs a deeper introduction). Some topics are discussed  only briefly - but  this course is a good start in learning IT Security, and there are many specialized courses (like Zaid's web hacking course, for example). Glitches:Minor glitch in one slide (half-edited from previous lecture, doesn't make sense). And the use of MD5 for file verification shouldn't be promoted as a security measure (it's dead for many, many years)."
  },
  {
    "no": 33,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 34,
    "name": "Volker Nowarra",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Ich denke dass der Kurs etwas umbenannt werden sollte, in die \"Praktiken des Ethical Hackings\" oder so. Denn es wird ja nur an vielen Beispielen gezeigt, was machbar ist, aber unten drunter die Netzwerk Theorie kommt zu kurz. Man muss nun aufpassen, dass man durch sowas nicht zum Script Kiddie wird, welches einfach nur wild mit der Maus in den Tools hin- und her klickt. Oh, und btw: ich möchte keine fantastische Bewertung schreiben, wie es das Tool hier vorgibt, das wäre ja Selbstbeweihräucherung."
  },
  {
    "no": 34,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 35,
    "name": "Fred Bliss",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lots of stuff to learn here and all of it is very good and well presented."
  },
  {
    "no": 35,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 36,
    "name": "Pavan Kumar Mallela",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best course for absolute beginners. Zaid is a brilliant teacher, he walks you through every process step by step from 'scratch'. I used to think ethical hacking was very difficult to learn until I found this instructor. I knew some theory before but now I'm acquiring so much practical knowledge through this course. And yes, Zaid is always available to answer questions patiently so you are never stuck if something din't work for you. Course is continuously updated if any of the tools used here are gone obsolete. Surely will recommend this course."
  },
  {
    "no": 36,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 37,
    "name": "Alon Minski",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent work. Tons of information. Well explained. I also got assistance from Mr Zaid when I asked questions and responses were really quick.Keep up the good job!"
  },
  {
    "no": 37,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 38,
    "name": "Stenre",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As someone who has installed Linux Kali, read some guides on null-byte and executed some basic exploits, I find this course mandatory for anybody who is willing to learn penetration testing and feels lost. The course is nicely and logically structured, with exploits starting from outside-the-network to post-connection exploitation, the instructor does everything hands-on, while explaining the theory behind every exploit. The instructor also shows alternative approaches to most of the hacks, and provides the tools necessary.Perhaps the only bit of critique i could grant is the lack of any explanation on how a hacker would cover his tracks while doing the exploits, but regarding the fact that this course teaches ETHICAL hacking, it is understandable why this is not shown."
  },
  {
    "no": 38,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 39,
    "name": "Mukundh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is very useful. The videos were very useful."
  },
  {
    "no": 39,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 40,
    "name": "Adam G",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. Just finished my first round through it entirely. I really enjoyed the MITM lessons and am looking forward to diving deeper into this topic. Zaid is a great instructor. Good lectures, and prompt replies to any questions."
  },
  {
    "no": 40,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 41,
    "name": "Marcos.Modenesi Modenesi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a great overview of the network security landscape. A lot is covered and of course some details are for you yo research. So far the course has teached me how to use existing tools to crack WEP / WPA encryption. I was expecting more technical details on how these protocols work. But, hey, that was clear from the course description! Besides, I know what to research now! The teacher is very clear, obviously masters the subject, and has always answered my questions  promptly. Totally recommendable."
  },
  {
    "no": 41,
    "date": "2017-06-06 04:23:21",
    "fromNow": "18 days ago",
    "user": 42,
    "name": "Enoch Anbu Arasu Ponnuswamy",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course content is good for a startup and  lots you can learn. The trainer really helps in understanding and clearing your doubts when you message him. I’ve got a good support when I approached the trainer"
  },
  {
    "no": 42,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 43,
    "name": "Stelios Mathioulakis",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the perfect start for anyone that wants to jump on the ethical hacking scene. The best part about this course is that it offers hands-on examples that you can test yourself directly after you watch the instructions. The instructor knows what he is talking about. Highly recommended."
  },
  {
    "no": 43,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 44,
    "name": "Rajat Gupta",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course for learning network, web, and other attacks. Instructor is very knowledgeable and helpful. I Recommend it."
  },
  {
    "no": 44,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 45,
    "name": "Ahmed T Khalil",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Instructor is very clear in his explanations and answers all questions relatively quickly"
  },
  {
    "no": 45,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 46,
    "name": "Jonas12",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "12 points of 10 :-) Awesome !!! But not recommend to anyone! :-D Because this information is dangerous and can do a lot :-)"
  },
  {
    "no": 46,
    "date": "2017-06-08 04:23:21",
    "fromNow": "16 days ago",
    "user": 47,
    "name": "Haseeb",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great and interesting  course , constructor has good knowledge , so far i have learned a lot and everything is clear and to the point."
  },
  {
    "no": 47,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 48,
    "name": "Joe Hrach",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course for learning Ethical Hacking.   Covered everything I needed to know."
  },
  {
    "no": 48,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 49,
    "name": "Bram Nijenhuis",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome course! Nice lectures, good examples, clear explanations.!!"
  },
  {
    "no": 49,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 50,
    "name": "Mike Schmitzer",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "nice and slow paced learning but not everything is covered. I would not recommend using it as the only source of learning but Ziad covers LOTS of topics. +1 for that , it's a great course, but has it's flaws.By the end of the course, it's been a great ride, covered lots of basics, but again, do your homework and research ;)"
  },
  {
    "no": 50,
    "date": "2017-06-20 04:23:21",
    "fromNow": "4 days ago",
    "user": 51,
    "name": "Gabriel CHOLLET",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is a must see if you want to know how hackers can attack, very usefull."
  },
  {
    "no": 51,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 52,
    "name": "Alex Gout",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "There's a ton of information in this course. Well explained and easy to follow. What I really like is that content gets added and improved all the time."
  },
  {
    "no": 52,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 53,
    "name": "Anand kumar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A really wonderful course in such a short time and really delivering on your expectations. Covers the important aspects and theories required. Just the thing one needs to start breaking the ice without caring about the  fuss."
  },
  {
    "no": 53,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 54,
    "name": "Salomón Rincón",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is ok but the english captions have many mistakes, english is not my native languaje but I speak about 80%, so I use the captions to get some help. It would be great if you can fix them, also, there are some chapters with no captions. Till now, all the test I have done to put in practice what the lessons shows have failed.It take many things for granted. For example, what if the website I'm trying to penetrate is not written using php?"
  },
  {
    "no": 54,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 55,
    "name": "Graham Irwin",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I thoroughly enjoyed the course and found it easy to follow. Zaid has an easy, relaxed way of explaining things. There is so much to learn I will need to run through parts of the course to get to grips with the concepts."
  },
  {
    "no": 55,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 56,
    "name": "Network Engineer Karramutally Muhammad Yousha",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "course well explained, tutor English very good and quality of video nice. So far i'm in the course i'm happy with it. Thanks Ziad for your explanations and each query I've send to the tutor, he ans it as soon as possible."
  },
  {
    "no": 56,
    "date": "2016-11-24 04:23:21",
    "fromNow": "7 months ago",
    "user": 57,
    "name": "Martin Kaszuba",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very thorough course covering all basic steps in various environments. I do recommend some basic Linux (command line) skills, as well as experience in the virtual environment (Hyper-v/VMware/VirtualBox) prior to the course. Course holds good examples, clear demos and the instructor is building the course up very well in a good pace. Love to see an intermediate/advanced level follow up to this course where some in depth techniques could be taught (on information gathering, social exploitation together with Maltego follow up). Wouldn't hesitate a second to subscribe to that one! Definitely a big recommendation if the interest is in this area (and Linux, networking and security in general)"
  },
  {
    "no": 57,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 58,
    "name": "Evv Erb",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor is good and well versed and updates the course often. He also answers questions quickly which is very helpful!"
  },
  {
    "no": 58,
    "date": "2017-06-21 04:23:21",
    "fromNow": "3 days ago",
    "user": 59,
    "name": "Souville Aurélien",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great courses, clear explanations and relevant points with an active teacher for questions and help you need. I recommend this formation to any person who wants to learn ethical hacking from scratch."
  },
  {
    "no": 59,
    "date": "2017-06-02 04:23:21",
    "fromNow": "22 days ago",
    "user": 60,
    "name": "Josef Tluka",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "That teaser was really good. It's really interesting how easy it is to get access to somebody's computer. I want to learn it and then protect myself.I am in the middle and it's great. I believe that this course can really help in my professional life."
  },
  {
    "no": 60,
    "date": "2017-06-02 04:23:21",
    "fromNow": "22 days ago",
    "user": 61,
    "name": "Andrei C",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This instructor is awesome, very easy to follow, great at answering questions. All around good quality for the money."
  },
  {
    "no": 61,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 62,
    "name": "Johniwoh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "look no further place if you want to learn ethical hacking. Zaid you are a wonderful teacher"
  },
  {
    "no": 62,
    "date": "2016-10-24 04:23:21",
    "fromNow": "8 months ago",
    "user": 63,
    "name": "Theodore Jordan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course to this point has provided an array of tools and method on how to exploit  networks  that can be done with out been detected. I am amazed at the number of tools  and applications that can be used to hack networks. It is an eye opening experience."
  },
  {
    "no": 63,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 64,
    "name": "Matthew Hall",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course covers a lot of material and makes it easy to understand!"
  },
  {
    "no": 64,
    "date": "2017-06-04 04:23:21",
    "fromNow": "20 days ago",
    "user": 65,
    "name": "Robert Davies",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great explaining of all the steps, even the logic behind why you do it. I am very happy with this course. This is one of the few courses that actually show practical examples of exploits/hacks. Seeing things in action really do help. Zaid is really engaging and entertaining to listen to."
  },
  {
    "no": 65,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 66,
    "name": "Julio C Rueda-Amaris",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very good course to learn the basics of Kali Linux  most of the exercises work right as explained and some you need to do some extra research . Excellent response from the instructor."
  },
  {
    "no": 66,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 67,
    "name": "Ismail Omar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Zaid is great constractur. he knows what he explains and he has a knowledge for it. I like this course and how fast he replies to any asked questions on all lectures. this course you will learn lot of skills. Zaid is one of the best constractur i ever learned something on udemy site. this course gets best updates constantly. Keep up the good work Zaid!!!."
  },
  {
    "no": 67,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 68,
    "name": "Paolo",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is a good panoramic on quite a few tools offered by Kali Linux. The author clearly has spent time to prepare this course. I also like his way of structuring the lessons. However, the course is extremely superficial and has no insight over the majority of the tools described, it also seems that the technical knowledge behind the described techniques is not very deep... Anyway, it's a good panoramic over quite a few Kali Linux offered tools."
  },
  {
    "no": 68,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 69,
    "name": "Mario T.",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thank you very much Zaid!!! You explain complicated things so easily!!!I bought all the over courses that you did as well!!!Best regards,Mario T."
  },
  {
    "no": 69,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 70,
    "name": "Muyowa Mutemwa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very insightful course. Very practical. I would recommend this course to anyone."
  },
  {
    "no": 70,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 71,
    "name": "Hack Div",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear explanation and easy to follow steps/instructions with an up to date and active instructor."
  },
  {
    "no": 71,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 72,
    "name": "許家誠",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course step by step and the examples are clear and usefulthanks for the instructor"
  },
  {
    "no": 72,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 73,
    "name": "Bryan Tadlock",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is one of my favorite courses.  The instructor is one of the best I've seen on Udemy.  The energy that he brings to the lectures make it really enjoyable."
  },
  {
    "no": 73,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 74,
    "name": "Božo Rakvin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As an noob in  IT knowledge it is revelating exp so far...but practice part is still of chart to me, due my skill and lack of basic programs language   ,some of lectures are more clear later in course ,so i hope that problems that i have in configuring lab will also be brighter later on...practicing ,i guess :)"
  },
  {
    "no": 74,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 75,
    "name": "Johan Dreyer",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This instructor is the best with the best prepared course of all the online courses i have done. Give him 6 stars!"
  },
  {
    "no": 75,
    "date": "2017-06-03 04:23:21",
    "fromNow": "21 days ago",
    "user": 76,
    "name": "Vaughn Boylan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Zaid is an excellent instructor - I could not fault this course."
  },
  {
    "no": 76,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 77,
    "name": "Bergmann Julien",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "very useful course the teacher talk clearly and the notions are explain very well. I recommend this ! And ofc Zaid take the time to answer rather fastly. I'm waiting for a next course ! :)"
  },
  {
    "no": 77,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 78,
    "name": "VERDU SANJAY",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "nice till now.I know ziad is a good teacher.His way of teaching is perfect for beginners.Also good part is he replies to question within 12 hours and thts most helpful.All i want to say is hacking is not easy ,just be patient and work hard , no one can stop you."
  },
  {
    "no": 78,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 79,
    "name": "Hennie Veldink",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Beautiful course where you can learn a lot with clear explanations"
  },
  {
    "no": 79,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 80,
    "name": "Pavan Vallapureddy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Everything is explained very neat that even a person with no knowledge on Linux or Network Security will be able to understand the demonstrations very clearly. I really recommend this course to anyone who is looking forward to learn penetration testing."
  },
  {
    "no": 80,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 81,
    "name": "Naina Adhikari",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It was nice experience to be the part of this learning program."
  },
  {
    "no": 81,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 82,
    "name": "Eli Vogel",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's pretty good! A little lower level than I need but probably makes it a better course for people overall"
  },
  {
    "no": 82,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 83,
    "name": "Phil Goldbach",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course with quick explanations. Helpful Q&A area, just be patient and eventually you'll get a response. Caught the course on sale and would recommend to others. Some things could use lengthier explanations."
  },
  {
    "no": 83,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 84,
    "name": "Ciaran Cox",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "i have learned a lot how to protect myself from things i did not know could happen Thanks Zaid greet teacher"
  },
  {
    "no": 84,
    "date": "2016-09-24 04:23:21",
    "fromNow": "9 months ago",
    "user": 85,
    "name": "Krzysztof Balas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "What an amazing course!Zaid is a great speaker helpful in solving problems and I really never got bored from listening to him. :)I recommend this to anyone.However: prepare for a lot of information and a bit of varied script and programming concepts. Therefore I'm not sure if this course is easy for beginners.Also maybe there could be more external links to practice the knowledge you learn? e.g. link to \"owasp bricks\" or other vulnerable websites or apps."
  },
  {
    "no": 85,
    "date": "2017-06-09 04:23:21",
    "fromNow": "15 days ago",
    "user": 86,
    "name": "Jaroslav Krazel",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Satisfied with the content and the way it is presented, clearly and well structured."
  },
  {
    "no": 86,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 87,
    "name": "Ivan Georgiev",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "One really usefull and interesting course. The fact, that it's focused practically, makes it really usefull for people, who have teorethical background in the field. All the matter is clearly explained, step-by-step instructions are provided for every tool. The provided information in this course, could be used to make networks much more secure."
  },
  {
    "no": 87,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 88,
    "name": "Tpa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very fantastic! It really starts from the beginning. Lectures are very understandable and the teachers are helpful. Thanks a lot for it!"
  },
  {
    "no": 88,
    "date": "2017-06-18 04:23:21",
    "fromNow": "6 days ago",
    "user": 89,
    "name": "Francesco Lapiana",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Ottimo insegnante, preciso e chiaro. Il corso è molto utile per chi è interessato. Una  pregressa conoscenza teorica aiuta molto a velocizzare l'apprendimento."
  },
  {
    "no": 89,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 90,
    "name": "D'rcy Bromley",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Some concepts need or information add to explain what its used for and why"
  },
  {
    "no": 90,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 91,
    "name": "Hector Tong",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Everything explained in these lectures are very detailed and I love the visuals that you provide right after your theories."
  },
  {
    "no": 91,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 92,
    "name": "Ngo Chi Binh",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the good course for hacking beginner covering networking hack."
  },
  {
    "no": 92,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 93,
    "name": "Student Harshil Darji",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I just completed this course. I learned a lot from this course. Thank you Zaid Sabih and Udemy."
  },
  {
    "no": 93,
    "date": "2017-06-15 04:23:21",
    "fromNow": "9 days ago",
    "user": 94,
    "name": "Alvin Lau",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is not hard to understand what the tutor was talking about. Everything is very clear. I think even someone who does not know anything about VM and Linux still can know how to hack by watching these videos."
  },
  {
    "no": 94,
    "date": "2017-06-12 04:23:21",
    "fromNow": "12 days ago",
    "user": 95,
    "name": "David Kim",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great content that shows real examples of how to get stuff done. Zaid is super easy to understand and is willing to show multiple approaches to achieving the same goal.I love how the course is divided into different parts and that it's very organized. For that reason I was able to finish a portion of the course, pause my progress, then continue on again without having felt like there was no pause area for me."
  },
  {
    "no": 95,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 96,
    "name": "Joshua Bartlett",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear and detailed information.  Can start from a point of basic computer skills and move into advanced techniques."
  },
  {
    "no": 96,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 97,
    "name": "James Cradock",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was a well informed and up-to-date course. It was very interesting, and importantly, includes the 'how to protect yourself' lectures."
  },
  {
    "no": 97,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 98,
    "name": "Erdem Güçlü Kara",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Zaid is a good teacher and the course content is very motivating for beginners. He answers your questions less than 24 hours. I am at lecture 50 and enjoying the experience so far. I will probably take Zaid's Social Engineering course after this one."
  },
  {
    "no": 98,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 99,
    "name": "Egeberk",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Zaid is a perfect instructor, the reason is why not giving 5 stars is he only mentions possible errors if you ask on discussion page which takes time."
  },
  {
    "no": 99,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 100,
    "name": "Smotlio",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is very helpful for beginners. The instructor propose this course many well and understandable."
  },
  {
    "no": 100,
    "date": "2017-06-12 04:23:21",
    "fromNow": "12 days ago",
    "user": 101,
    "name": "Steven Godoy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Muy bien explicado, indica detalles importantes. Realiza todas las acciones paso a paso."
  },
  {
    "no": 101,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 102,
    "name": "Dino C",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very easy to follow.  Gives you a good understanding of pen testing / hacking. Great instructor!"
  },
  {
    "no": 102,
    "date": "2017-06-09 04:23:21",
    "fromNow": "15 days ago",
    "user": 103,
    "name": "Ali Salman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome Course, Great instructor I love the fact that he goes over the theory elements as well as the complete basics of each topic. Thumbs Up"
  },
  {
    "no": 103,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 104,
    "name": "Project Engineer Harika Nambi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course !!! Thanks to the instructor and udemy !!!"
  },
  {
    "no": 104,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 105,
    "name": "Jerre Hill",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Zaid — Does a great job teaching this course. Good for anyone who wants to learn these skills."
  },
  {
    "no": 105,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 106,
    "name": "Rohan Ashik",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really nice and useful, value for money"
  },
  {
    "no": 106,
    "date": "2017-03-24 04:23:21",
    "fromNow": "3 months ago",
    "user": 107,
    "name": "Paolo Gagini",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "good course but incomplete because the argument is very ample"
  },
  {
    "no": 107,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 108,
    "name": "Emanuel Movtady",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I was hesitant at first but this course explains everything, theory and practical very well and I'm able to understand it quite easily, this is great!"
  },
  {
    "no": 108,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 109,
    "name": "Connor McMillin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really enjoy taking this course. You learn a lot and almost everything has worked for me so far on the first try and if it doesn't then the instructor is quick to answer questions on the Q and A forums."
  },
  {
    "no": 109,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 110,
    "name": "Kevin Anthony Martinez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "One of the best basic courses for pen testing. It combines theory and practical use into one course making it easy to understand and apply what was learned. I hope that Zaid release another course about pen testing but would focus on advance aspects of it."
  },
  {
    "no": 110,
    "date": "2016-11-24 04:23:21",
    "fromNow": "7 months ago",
    "user": 111,
    "name": "Ben Lawson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an excellent course. It has a great balance of explaining concepts and the actual hands-on experience that allow you to follow along. I've also used the Q&A section and the instructor does respond."
  },
  {
    "no": 111,
    "date": "2017-04-24 04:23:21",
    "fromNow": "2 months ago",
    "user": 112,
    "name": "Anthony Johnson",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "i love this course it is extremely intuitive and informative"
  },
  {
    "no": 112,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 113,
    "name": "Stefanie Spencer",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great for a beginner. I know many of the exploits are simple and maybe not realistic with websites or networks that already have a high level of security. I'm just a beginner, so this is a perfect place to start. Presentation is clear and thorough. It's nice to learn to do things manually, so that i understand what the tools are doing when we use them to do something automatically."
  },
  {
    "no": 113,
    "date": "2016-12-24 04:23:21",
    "fromNow": "6 months ago",
    "user": 114,
    "name": "Rohit Goud",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Just Done with the Course!  This is the BEST COURSE EVER ON UDEMY OR ANYWHERE . I LEARNT A LOT.GAINING ACCESS TO A COMPUTER  IN SOOO MANY WAYS U DONT HAVE TO KNOW ANYTHING BEFORE TAKING THIS COURSE.THE INSTRUCTOR IS VERY ACTIVE HE ANSWERED ALL MY 15 QUESTIONS IN A DAY."
  },
  {
    "no": 114,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 115,
    "name": "Suleiman Juma Is-hak",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The teacher of this course knows how to deliver and he knows very much how to break down complex things into very simple ideas"
  },
  {
    "no": 115,
    "date": "2017-05-24 04:23:21",
    "fromNow": "a month ago",
    "user": 116,
    "name": "Abdulkader Abdulmajeed",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great Explanation with the correct information provided and the mean time,meterials provided as expected in order to create the own lab and do the practice, hats off Mr.ziad...!"
  },
  {
    "no": 116,
    "date": "2016-10-24 04:23:21",
    "fromNow": "8 months ago",
    "user": 117,
    "name": "* gwishin *",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is probably the coolest course I've ever taken.  I have learned A LOT.  Zaid is a really good teacher and he is also quick to respond to students' inquiries. I will definitely take another one of his courses."
  },
  {
    "no": 117,
    "date": "2017-02-24 04:23:21",
    "fromNow": "4 months ago",
    "user": 118,
    "name": "Ali",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the best course I've ever taken. The explanation is very clear and simple also when I ask a question the instructor answer quickly."
  },
  {
    "no": 118,
    "date": "2017-06-20 04:23:21",
    "fromNow": "4 days ago",
    "user": 119,
    "name": "Tyler Ceja",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "very easy to follow and quickly applicable. Zaid is also a thorough instructor that responds quickly to questions."
  },
  {
    "no": 119,
    "date": "2017-01-24 04:23:21",
    "fromNow": "5 months ago",
    "user": 120,
    "name": "Miha Schaffer",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is really understanding for beginners and tell you basically everything you must know."
  },
  {
    "no": 120,
    "date": "2017-06-15 04:23:20",
    "fromNow": "9 days ago",
    "user": 0,
    "name": "Zaid Sabih",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Bilal Shah",
    "content": "Thanks for your review Bilal, regarding the web penetration testing section, all the methods explained there work on real websites, it is a bit basic info though cause this is a huge field, so I only cover the basics in this course as this is a general course that's supposed to cover most ethical hacking aspects, as you know I have a full course on website penetration testing for people who want to learn more and dive deeper in that field."
  }
]