[
  {
    "no": 0,
    "date": "2017-06-17 04:29:31",
    "fromNow": "7 days ago",
    "user": 1,
    "name": "Oscar De La Rosa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "5 star! because with in the 1st week of viewing the Super Learner, I have been able to give a high boost to my memory, guys there is not yet, or better said, there may be pills for brain boost but at least not like in the movies, alas only the high wealthy may have access to it; with that said this course has brought high value to me. I am looking forward to up grade to the next level."
  },
  {
    "no": 1,
    "date": "2017-06-16 04:29:31",
    "fromNow": "8 days ago",
    "user": 2,
    "name": "Frank Cifarelli",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Truly an amazing (and amazingly comprehensive) course. I've been training regularly for the past 2 weeks with the tools Jonathan, Anna and Lev have provided, as well as contacting Lev for some additional training advice, using Anki and have even bought Harry Lorrayne's book \"Super Learner, Super Student\" to bolster my training. I'll also be creating memory palaces and furthering my studies into that technique.I'll be starting to dig into the pre-reading and speed reading aspects of the course soon, but want to first really drill my memory and visualization skills rigorously to get the most out of my speed training. I intend to start reading books on productivity and organizationThis course isn't just an \"introduction\" to these techniques. It's a full blown course with an amazing value for what you get. Thanks to Jonathan, Anna and Lev for making this so much fun, and for setting me on the path. Brilliant stuff and an amazingly well-organized course."
  },
  {
    "no": 2,
    "date": "2017-06-12 04:29:31",
    "fromNow": "12 days ago",
    "user": 3,
    "name": "Ben David",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor is engaging and well-prepared.  I would have liked more original material - having purchased part 1 part 2.5 felt a bit more like 1.4."
  },
  {
    "no": 3,
    "date": "2017-06-09 04:29:31",
    "fromNow": "15 days ago",
    "user": 4,
    "name": "Guillermo Garcia",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I always wanted to learn how to increase the velocity while I'm reading. However, I never realised it was necessary to improve my memory first. Even I'm almost about to finish this course which provided me with plenty of good example and information, I do believe that you need to practise all the exercises in order to see real results. It will be a long journey but this course provides most of the tools you need to succeed."
  },
  {
    "no": 4,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 5,
    "name": "Michael Wood",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "After completing the course, I feel the following has to be said. When you are creating content which can change the way a human being views the world you need to take things of the upmost serious nature. When I read the following from the 1st WPM test, \"Last night, Japanese forces attacked Guam. Last night, the Japanese forces attacked the Philippine Islands. Last night, the Japanese attacked Wake Island,” I began to wonder how serious this course was. I can’t picture any other reason it would be worded as such than to slow down speed and understanding. Typically, in English, less is more. I lost count how many opinions were projected as facts. I also lost count of the number of times “refer to the PDF Syllabus” was said. If I wanted to get access to links to read about other people’s discoveries I’d have just searched for them or asked on a forum. Everything said, there is good content hidden. There are facts that can and will change the way you learn. This course is unquestionably worth the money. Just know that it comes with many strings attached. I wish everyone great luck on perfecting their learning process. I really do think education is the key to life and speeding up ways of learning couldn’t be more underappreciated."
  },
  {
    "no": 5,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 6,
    "name": "Maira maneka",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really insightful course. The best thing is that Jonathan makes it a point to give demonstrations that really makes things much more clearer! I found myself revisiting videos again because youll need to when you start practicing...and the teacher does warn us about that before hand. He also gives very relatable and understandable examples. I would recommend anyone to take this course.The course also introduces us to other impressive people in the field of memory and speed reading, which again acts as motivation and further understanding."
  },
  {
    "no": 6,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 7,
    "name": "Andy Handoko",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "im not finish the course yet, but so far it become more challenging each time you progress the course, esp with the homework / challenge in syllabus, well some 'to do' guidance might be will help a lot, so the informations are not scattered in between video and syllabus"
  },
  {
    "no": 7,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 8,
    "name": "Felipe Novais",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course was a really turnover in my life. I've tried to do some memory/speed reading regimen from books, but this is the one that I was able to follow with results and keeping me interested. I also recommend the authors' blogs and podcast (Becoming Superhuman by Levi, Key to Study by Lev and Anna)."
  },
  {
    "no": 8,
    "date": "2017-06-19 04:29:31",
    "fromNow": "5 days ago",
    "user": 9,
    "name": "Rakesh Sehgal",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really enjoyed the course. The included resources are pretty good, but not the kind of quality I expected. I would really appreciate if the resources were bundled together in a more presentable form. I don't think I am at the speed expected, but probably the error is on my part as I have not practiced enough or maybe I am a slow learner. I do keep applying these skills and sharing with other so I guess I'll eventually get there.Also, I didn't like the part \"The Masterclass\" is not included. Why hide some more knowledge?"
  },
  {
    "no": 9,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 10,
    "name": "Toastlu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It' great course.Now it's my turn to applied in my life.hope to provide Chinese subtitle, because I'm not an English native speakerPS. There are some spelling mistake in subtitles."
  },
  {
    "no": 10,
    "date": "2017-06-04 04:29:31",
    "fromNow": "20 days ago",
    "user": 11,
    "name": "Jack Kao",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course, a lot of information and techniques to digest. I took the advice of binge watching all the videos and now I'm ready to go back and take it SLOWLY from class 1."
  },
  {
    "no": 11,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 12,
    "name": "J Chang",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have completed watching the entire course, however, I have yet to seen the effect. Through this course, I gained a lot of knowledge on the human brain and different technique/concepts to enhance my learning capabilities. I will be giving 4.5 star for now. Will review again after 6-8 weeks."
  },
  {
    "no": 12,
    "date": "2017-06-19 04:29:31",
    "fromNow": "5 days ago",
    "user": 13,
    "name": "Antriksh Panwar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "My initial reading speed was 180 - 200 words per minute with retention ranging from 40% - 50%. Although, I did not give my 100% effort to this course due to work commitments, I was able to finish it in 45 days and gain a lot in memorizing skills and speed reading. I've checked my speed across different software and sites, and I'm happy to be where I am today, reading at 340+ words per minute and 70% -80% retention. I'm yet to attain my desired speed of reading at around 500 words per minute, I guess I need to give more time to it, it's been only 45 days and an 80% increase is pretty decent."
  },
  {
    "no": 13,
    "date": "2017-06-14 04:29:31",
    "fromNow": "10 days ago",
    "user": 14,
    "name": "Jansen Alfredo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have learned speed reading before. But, in this course, I get new insights, knowledges. I know that I have missed so many things in learning speed reading. This course improves my skills."
  },
  {
    "no": 14,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 15,
    "name": "Luis Marin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "These are all techniques I've seen before in one form or another but actually seeing them demonstrated has been worth the price for me. Jonathan is very clear in his explanations and the syllabus has an abundance of information in one place."
  },
  {
    "no": 15,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 16,
    "name": "Kelly Sittig",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love this course. Im learning so much and am excited to try all these technics and become a superlearner. I have so many things i want to learn."
  },
  {
    "no": 16,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 17,
    "name": "Eric Patrick Vance",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think that this course provides a clear path to success. Understanding that learning is a personal thing, the instructor provides multiple opportunities to learn the techniques of speed reading and goes beyond what most other speed reading \"coaches\" teach - particularly when it comes to the importance of retention."
  },
  {
    "no": 17,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 18,
    "name": "Markus Uuppo",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I wish I had learned this during or before my degrees, it would have saved a lot of time and frustration. I did only a fraction of the recommended training due to several excuses, but still scored 145 % increase in my reading speed with better comprehension. I believe the difference in my native language is even bigger.Quite a few advertisements to encourage to take the masterclass. However, I think this course is good by itself for the purpose of getting a better memory and reading skills."
  },
  {
    "no": 18,
    "date": "2017-06-01 04:29:31",
    "fromNow": "23 days ago",
    "user": 19,
    "name": "Ziad Iqbal",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This video tutorial has been extremely helpful and motivating for me personally. I liked the way he presented and the way carried the audience from one chapter to another. Personally if I give myself a little bit more push, I surely would reach the desired Superlearner position and I think I am already highly motivated and I am on my way! :) Thank you Jonathan Levi!"
  },
  {
    "no": 19,
    "date": "2017-06-17 04:29:31",
    "fromNow": "7 days ago",
    "user": 20,
    "name": "Jbkrikor",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall the course was interesting and engaging. My reasoning for the 4 stars is though the course had very good breadth of topics it lacked the depth I was hoping for. The course does offer excellent supplemental resources which make the course worth while. However, I feel the course is relying a great deal on this material.  I wish there were more examples using the methods explained in the videos."
  },
  {
    "no": 20,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 21,
    "name": "Aleš",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course - succint and to the point. Not 5 stars due to the following: - Majority of associated weblinks are very slow and do not function properly."
  },
  {
    "no": 21,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 22,
    "name": "Sławomir Leśniewski",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "20 years ago I have attended to similar course for 2 years, as a reward for high school grades and achievements. It was great! Then, after about 10 years I decided to refresh and upgrade some skills (speed learning) with some books of Tony Buzan, Gordon Dryden and some others, using mind mapping software as well. Since then, I have made hundreds of mind maps. Now, again - after 10 next years - I decided to refresh it again :) and really speed up my reading tempo. With your PDF syllabus and crucial software you recommended - I get excited again like a child! :) Few months ago I started refreshing russian language and learning spanish, what turns me on a lot! Thank you for the course content and your engagement! It was very pleasant to listen to you. BTW: I have joined Superlearners group on FB already, and I am sure, that we will contact or even cooperate somehow in the future (I am also an entrepreneur, but in Poland). Thank you again and good luck!"
  },
  {
    "no": 22,
    "date": "2017-06-13 04:29:31",
    "fromNow": "11 days ago",
    "user": 23,
    "name": "Bryan Waymire",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I more than doubled my reading speed (from 244 WPM to 563 WPM) & I didn't even do the homework (SHHH!) & my memory retention nearly doubled (again, w/o even doing the hw)."
  },
  {
    "no": 23,
    "date": "2017-06-05 04:29:31",
    "fromNow": "19 days ago",
    "user": 24,
    "name": "Melanie Gatza",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great tips and tricks on how to speed read and retain information from various sources brought together to retrain us to become more efficient reader and student."
  },
  {
    "no": 24,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 25,
    "name": "Cody James Rathor",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome Course! It has started me on my new path of learning computer language by using very helpful tricks and techniques learned in this course! I am currently still working to increase my reading speed further. so far i have doubled it!"
  },
  {
    "no": 25,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 26,
    "name": "Nils Schünemann",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I rate this course 5 stars just by watching all the video lectures and will give a updated rating when I'm finished with everything... when I'll be a certified Superlearner. The video material is well made and it seems like the creator of the course put much thought into the presentation of the knowledge.Jonathan Levi (the man in front of the camera) is really pleasent to watch. The amount of knowledge and the value (remebering a lot more information in a lot of less time and better!? Pure value) you get from the course is huge and if it's appliable and works like advertised (it seems like it and I'm going to test that in the next few weeks) then this course deserves even more and might be one of the best courses on Udemy, if not even the best course.I'll bring an update in some weeks."
  },
  {
    "no": 26,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 27,
    "name": "Denise McKinney",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far you have my rapt attention. Partly because Jonathan is easy on the eyes but mostly because the information is fascinating :) I'm looking forward to when I actually go through it. This is just the \"review run\" but I'm a happy customer."
  },
  {
    "no": 27,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 28,
    "name": "Richard Mulhern",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Solid content, good pacing, chapters arent too long nor too short, well edited never long winded. Presenter had command of topic, engages viewer with confidence."
  },
  {
    "no": 28,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 29,
    "name": "CJoel Nozap",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The material taught in this course is arguably the best money I've ever spent. My only regret was that I found this course so late in my career path. The lessons learned in this course can be applied to anyone at any level of education or career. If your open to applying these techniques, you could even surprise yourself by how much you can learn, like I did.A little bit about me, I'm actually a 3rd year medical student and I had some time off of my rigorous schedule. Rather than spend two weeks on vacation, I came across this course on Udemy. After applying the skills that I learned on the fly, I found myself improving from spending 2 hrs reading disease/research articles (half of which I would forget in the first run-through) to only spending 30 minutes, while retaining more of the information, weeks later. Additionally, these are techniques I just started using. There's no telling what I can accomplish once I've mastered these skills over time."
  },
  {
    "no": 29,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 30,
    "name": "Dan Sorensen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is blowing my mind. Practicing some of the techniques in the last couple weeks since I've been going through the course makes me feel like I'm getting a hardware upgrade to my brain."
  },
  {
    "no": 30,
    "date": "2017-06-20 04:29:31",
    "fromNow": "4 days ago",
    "user": 31,
    "name": "Justin Cooper",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A lot of ideas and techniques that are found in other programs. Using these ideas and techniques again, yielded the same results as before:reading speed goes up, comprehension goes down. All in all, nothing new."
  },
  {
    "no": 31,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 32,
    "name": "Derek Mantlo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "J. Levi is great! He has an engaging program.  I'm also a subscriber to J Levi's Superhuman podcast. He is GREAT at finding interesting people to interview, and I have been inspired by his interviews.  Moonwalking With Einstein was the catalyst causing the search for superhuman abilities with the mind. With Mr. Levi's assistance, I honestly have confidence that I can read faster and remember more than I have in the past thanks to Mr. Levi."
  },
  {
    "no": 32,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 33,
    "name": "Ernie Sulovic",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Much more on actual speed reading method(s) would have been appropriate. A lot of the program from Harry Lorrayne and Kevin Trudeau have been used, so not new to me. More on actually how to increase my reading and comprehension speed."
  },
  {
    "no": 33,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 34,
    "name": "Michael Iman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really took away a lot of great content from this course! The instructions were clear, very engaging, and gave me enough activities to practice and apply what I was learning. Definitely, would recommend this course to anyone!"
  },
  {
    "no": 34,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 35,
    "name": "Herbert Lee",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great information. Learning many new ideas and concepts. Having a better understanding of how my brain processes memories."
  },
  {
    "no": 35,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 36,
    "name": "Tyler Thompson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A lot of information . It could have been more concise , but it was thorough and gave me insights I did not have before. Thanks , now I can get through massive amounts of dense materials in a much faster way."
  },
  {
    "no": 36,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 37,
    "name": "Jorge Ibarra Delgado",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The quality of the videos has improved considerably from the first, I think also the order of the contents is better :)"
  },
  {
    "no": 37,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 38,
    "name": "Angelique Delorme",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love how complete this entire program is. I've done several speed reading courses and I love how linking images and markers to the story makes a huge difference. Thank you so much for this, I will be sharing the love for sure and hopefully one day take your mastery class"
  },
  {
    "no": 38,
    "date": "2017-06-22 04:29:31",
    "fromNow": "2 days ago",
    "user": 39,
    "name": "James A Proctor",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "so far all you have said has been a positive response to learning. You gave me the format for the course and now the ball is in my court. I must do my part in order to get the results I am hoping to gain from taking this course. simple put work but don't over do it."
  },
  {
    "no": 39,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 40,
    "name": "Lennie Andrew",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative lectures. Excellent course and content. I have started using this techniques and although I am no guru, I have seen a tremendous increase in my reading speed and comprehension."
  },
  {
    "no": 40,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 41,
    "name": "Angelo Seneviratne",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've had done speed reading courses in the past which taught similar concepts. However The SuperLearner course does a great job of integrating well known speed reading and memory tools together to give you a much better result. In addition it also tells you how and why the concepts works which helped me understand and value the content even more."
  },
  {
    "no": 41,
    "date": "2017-06-14 04:29:31",
    "fromNow": "10 days ago",
    "user": 42,
    "name": "Erin",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is delivers as described and promised.  The course provides learning techniques in a layered manner from elementary or foundation to intermediate and advanced.  You must practice these techniques to become proficient but even if you do not, there are techniques that you will find yourself using for things such as remembering names, places, dates, numbers.  I'm only mid-way through the course, but find it very interesting and promising for future application."
  },
  {
    "no": 42,
    "date": "2017-06-09 04:29:31",
    "fromNow": "15 days ago",
    "user": 43,
    "name": "Emanuel Spektor",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far, this course is amazing. I am currently a student in a Masters of Finance and we are required to learn and remember a great load of technically complicated articles for each class as well as lectures in textbooks. I initially registered for this class before starting the masters, but I didn't have time to complete then. This is my second try and I will complete it fully and am practicing daily (since I now have time) and am already seeing great results. Since I have a time constraint, I try to do one module every 2 or 3 days, while it's suggested to do one module a week. The reason is that I am trying to learn many things this summer (Coding, algorithmic trading, Foreign exchange, etc) and read many books on the subject and the class topic as well. I am currently reading some books specified in this class like The Memory Book and Make it Stick. I am very ambitious of the results of this course and can't wait to complete it fully and see the results! With the text above, it is easy to understand that I highly recommend this course, there is invaluable information and everything was condensed/filtered for us already since the three instructors have done intensive research on the subject."
  },
  {
    "no": 43,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 44,
    "name": "Dylan Peizer-Oppenheim",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As recommended by the instructor, I spent a chunk of my free time watching all the course videos before actually beginning the course itself. The coursework is well-organized and progresses logically, and the syllabus fills in the blanks while also leaving enough up to the student to ensure that the lessons stick.Overall, the course is very well put together, and based on other peoples' reviews, I'm excited to see the results now that I'm starting it in earnest."
  },
  {
    "no": 44,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 45,
    "name": "Patrick Foster",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is very helpful in improving your reading. However, the Q & A is left unanswered and it following along with what he's explaining can become really confusion."
  },
  {
    "no": 45,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 46,
    "name": "Paula Bogossian",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is very well made. Jonathan seens to really care about the performance of the students as he makessure everything in the course is well explained.I'm very delighted with my first purchase in Udemy platform.Thank you,Paula"
  },
  {
    "no": 46,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 47,
    "name": "Gabriele Ricci",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was inspiring and interesting; it is a starting point for a new way of learning and it worth the value."
  },
  {
    "no": 47,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 48,
    "name": "Bryce Isbell",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a fantastic course, even if you're only a little interested in SuperLearning, you'll be surprised to find you could be learning much more efficiently and increasing your reading comprehension significantly. There are great sections on memory, sleep, creating markers, et cetera.Midway through this course, before even beginning the sections on speed reading, my comprehension had already increased 57%.Highly recommended!"
  },
  {
    "no": 48,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 49,
    "name": "Abdurachman Ramadhan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I cant say, even if 10$ for me is quite expensive (blame my country, i live in asia (indonesia) the money were really cheap and im still student) i am not regret spending my money to buy this course. well done mr Jonathan Levi. By the way if you think after you know this information you will learn like einstein you are wrong.. it still help a lot but if youre not work your ass off you wont get it so far :)."
  },
  {
    "no": 49,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 50,
    "name": "Ray Goodell",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent value; quality content, and instruction, as well as supporting documentaiton, in the Super Lerner Course.  The Pod cast's is fantastic, and the book is also a great resource, for busy profesisonals.  Johnathan, is a Rock Star, life and businss hacker, that brings it homes with his winning personality, and communication skills.  Thanks Johnathn.  PS.  Ep 117, is Epic!"
  },
  {
    "no": 50,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 51,
    "name": "Nérine Paolini-Del'Cognito",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "At the moment I am just going through all the videos and I am halfway through. It is interesting so far. I will be leaving my final rating at the end"
  },
  {
    "no": 51,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 52,
    "name": "Roger Gold",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonathan Levi is an excellent teacher who presents well-researched and proven techniques in an approachable and easy to understand way. He inspires and motivates you to become your best. This truly is an excellent course."
  },
  {
    "no": 52,
    "date": "2017-06-04 04:29:31",
    "fromNow": "20 days ago",
    "user": 53,
    "name": "Dr. Michael Rucker",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very comprehensive course with well organized material. Lots of opportunity for free practice outside of the course as well."
  },
  {
    "no": 53,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 54,
    "name": "And Callaway",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lots of information to take in and techniques to try, Jonathan puts it in a very digestible manner. Its an art that needs practise. Its obvious a lot of thought has been put into this course and it is structured very well. So Far So Good"
  },
  {
    "no": 54,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 55,
    "name": "Kassiel Marcelo",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The ideas and information of this course are amazing. This unlocks so many possibilities, truly. What I do have a worry about is the practicality. This course fails to provide us ways of practicing other than trying out ourselves throughout the day, and small tools rather than structured worksheets. I think this course deserves 4.5 stars but this is the only way I'll get attention to this review. It's true you can only achieve these feats if you truly try, but truth be told the average person won't be able to practice these things themselves unless presented with a totally practical way of practicing. I recommend worksheets and  true homeworks. BUT I LOVE THIS COURSE AND WILL RECOMMEND TO EVERYONE BECAUSE THIS IS TRULY AMAZING!!!"
  },
  {
    "no": 55,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 56,
    "name": "Nemias",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love to read and learn, today I can read at a speed that I couldn't imagine, I think with practice still more and more increasing my reading speed, thank you very much, I highly recommend the course."
  },
  {
    "no": 56,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 57,
    "name": "Sasa Crnojevic",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great connection of reading speed with memorizing things by the use of markers. If you listen carefully and practice I really believe you will succeed in this."
  },
  {
    "no": 57,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 58,
    "name": "Morgan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I learn a lot with this course, very interestring stuff to memorize and clearly describe.Thanks for this course"
  },
  {
    "no": 58,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 59,
    "name": "Eugenio",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Exercises, games, podcasts, lectures explaining the \"Why?\", this course has it all.With the excellent teaching skills from Jonathan all you need is discipline and the will to learn. I completely recommend it."
  },
  {
    "no": 59,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 60,
    "name": "James Garloff",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I had learned these techniques back in the 90's through a different course which I think covered things a lot better. For example, it is best to connect your image markers with an Action that is the most outrageous and or emotion evoking as possible.  So there is an Image->Action->tied-to-next-Image->Action->etc.  This allows you to remember things in order and in way that allows better recall.  There were other things that I learned that worked better or were better covered than what I have seen thus far in this course. Though I am not yet through this whole course I think some things could have been better. But I will know better as I progress through the course."
  },
  {
    "no": 60,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 61,
    "name": "Brendan Wong",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Have gone through half of the course. Haven't really picked up anything useful. Will finish up the course and give my final review then but thus far it has been a long winded and non engaging course. Do take note."
  },
  {
    "no": 61,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 62,
    "name": "Octavia Smith",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has really shaped how I perceive my learning ability. I am preparing to begin taking a lot of standardized exams and possibly considering a return to higher education. This is helping me mentally prepare and also it is helping me as I am working with my school age children. No matter he content, the technique is the same and this is helpful to be able to share with them."
  },
  {
    "no": 62,
    "date": "2017-06-13 04:29:31",
    "fromNow": "11 days ago",
    "user": 63,
    "name": "Joosten Kuypers",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very clear explanation of complex concepts.  Lots of supplemental articles for deeper review and understanding."
  },
  {
    "no": 63,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 64,
    "name": "Gnostic 666",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course doesn't worth a penny. Most of the course based on ted talks and other sources that anyone with quick googling can find. Basically the instructor sounds like some kind of devotee of his Guru Lev Goldentouch, that is obviously not in this course.  The instructor just sells you another scam lifehack like many others on the internet with his smile and grandiose promises."
  },
  {
    "no": 64,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 65,
    "name": "Loy Machedo",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "PROS1) A very genuine presenter who truly wants to share worthwhile information. 2) Links to videos and other educational material.3) The presenter keeps it lively and interesting.CONS1) If you are hardcore into research like I am, you will realize there is nothing new in the course material."
  },
  {
    "no": 65,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 66,
    "name": "shashank kapoor",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Well, still learning but so far it has been amazing. I don't know how much time this will take to inculcate in my daily routine but, would definitely be beneficial if I master it. Thank you for making this course."
  },
  {
    "no": 66,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 67,
    "name": "Hilton Meyer",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course seems to be a lot of concepts and pointing the to PDF that does not have that many ways of actually doing most of the stuff. The outline is a good base to go and do some self studying but this is not something where you will walk away with all the tools in your hands."
  },
  {
    "no": 67,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 68,
    "name": "Benjamin Balogh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course, especially useful on how to remember things. I'm already using this and it works! I'll also practice speed reading and see then how it goes. Looking forward to apply this knowledge on languages, exams and more. Worth its price."
  },
  {
    "no": 68,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 69,
    "name": "Jeff Wikstrom",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's hard to say how good this course is. I'm definitely learning a lot and being challenged. My brain is really starting to kick in on creativity, so I'm really positive about it. It does, however, take a lot of self-discipline. This is not a negative per se, but people expecting to get their hands held will fail at this course.Update: I just finished the video portion of the course. I'm about a month in. My reading speed has definitely increased. I have also learned some great techniques for improving my memory. Only time will tell if I'm able to integrate these techniques and make their use habitual. I would like to see the program pace a little differently with a little more formal schedule to help create the habits."
  },
  {
    "no": 69,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 70,
    "name": "Lucas Fridriksson",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course has exceeded previously high expectations so far. Really like the structure and content."
  },
  {
    "no": 70,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 71,
    "name": "Abdulla Shoushaa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "One of the courses that I didn't regret buying, I recommend this course to people that read slowly and they have a week memory, and also to people that they want to become learning beasts. thanks for this great course. :D"
  },
  {
    "no": 71,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 72,
    "name": "Arvin Tiongco",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course so far has improved my comprehension using the techniques Jonathan is teaching. If you want to improve your learning and comprehension this course is definitely for you."
  },
  {
    "no": 72,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 73,
    "name": "Dens Rho",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The topic is really interesting! I learn valuable lesson that is very helpful in reading habit and the quest for new knowledge."
  },
  {
    "no": 73,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 74,
    "name": "Viktoriya Luchka",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I hope I'll be able to use it all in practical way. So far I enjoy it a lot."
  },
  {
    "no": 74,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 75,
    "name": "Bodhisattwa",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I found nothing new in the course. After having completed 82% of the lectures I have come to this conclusion. Jonathan's presentation, though good, leaves the learner to fend for herself/himself since he just introduces a topic and gives a plethora of different links to study from. I would not suggest it to anyone with basics of speed reading and memory techniques. You would be disappointed! or that's the way I feel. No offense intended! Others who do not have prior knowledge on speed reading or memory techniques might find it helpful."
  },
  {
    "no": 75,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 76,
    "name": "Gourab Deb",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am kind off getting the concept, but something is missing that need to glue all the concepts together. I think more exercises, specific to concepts discussed in each lecture, could have definitely made the course better."
  },
  {
    "no": 76,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 77,
    "name": "Winston Goan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course does a great job of explaining the application of the techniques that are discussed. Some of the drills may seem odd or silly at first, but I was amazed at how effective they were in the short amount of time that I have been using them. It has been a fun and interesting process to try and change my perspective on learning."
  },
  {
    "no": 77,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 78,
    "name": "Uriel MacGillivary",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor is engaging and enthusiastic which is fantastic, however, the course doesn't teach you to be a super learner.  The course gives you website site after website of reference material so you have to figure out how to teach yourself. There is no direction from the teacher.  The exercises are difficult and there's no guidance to know if you are on track.  Basically, You could read this information in a book and spend time on your computer trying different exercises to improve your memory.  I'm disappointed in the course."
  },
  {
    "no": 78,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 79,
    "name": "Vincenzo Gentile",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm finding this course interesting by showing how important is to create a detail story remember the key words about a concept."
  },
  {
    "no": 79,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 80,
    "name": "Joe Cline",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Some of the speed reading ideas presented have been around for awhile, but this is the first time I've seen them put together with such extensive memory techniques. This course is a great way to increase your learning capacity. Thanks, Jonathan (and Dr. Lev and Prof. Anna)"
  },
  {
    "no": 80,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 81,
    "name": "Faraz Akhtar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Amazing courses.. Took over 8 weeks to work through it."
  },
  {
    "no": 81,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 82,
    "name": "Anda Stoian",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very comprehensive and easy to follow. It looks that all the course it's based on a lot of research. Highly recommend!"
  },
  {
    "no": 82,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 83,
    "name": "Nour ElBash",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really enjoyed this course. It gave me the ability to memorize better than ever before for now. Moreover, the professor is able to meet my expectations about this course for explaining really good."
  },
  {
    "no": 83,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 84,
    "name": "Quentin Montgomery",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Extremely valuable information that has the potential to change the lives of people who want to learn how to learn effectively and efficiently.  Speed reading the correct way is taught so that retention at high speeds is greater than the average reader."
  },
  {
    "no": 84,
    "date": "2017-06-13 04:29:31",
    "fromNow": "11 days ago",
    "user": 85,
    "name": "Alexandre Almeida",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Enjoying the course very much. I find the homework and supplementary material extremely appealing to keep me hooked on the course and allows me to feel like I'm going the extra mile."
  },
  {
    "no": 85,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 86,
    "name": "Rey Kamal",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course! Recommended to those who would appreciate speed reading and the science behind it! I wish I had watched this video earlier when I was at uni, but it would certainly be valuable now that I am starting my own business!"
  },
  {
    "no": 86,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 87,
    "name": "Michael Locke",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is a good course. I can see the results. I read incredibly fast and I am applying the skills that I have learned here to every aspect of my life. Great course."
  },
  {
    "no": 87,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 88,
    "name": "Ang Sethvisal",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I gave this 4 stars not 5 because it's a little difficult for Non-English speakers like me and it's a bit boring (a bit). But everything else is so beautifully design and so many wonderful lessons to learn. Even a lazy a** like me. To save your Time on this review. Yes, it improves my memories and speed reading 3 times fast. I still review the lessons, hopefully I can read 1200 words to 1500 words per minute. (Hopefully!) :("
  },
  {
    "no": 88,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 89,
    "name": "Drew Gilvary",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "About halfway through, I'm really enjoying this course. The content is well informed, well organized, and it never sells itself as a \"cheat\" to make your life easier. Jonathon Levi emphasizes that it's going to take a lot of work on our, the student's part, to become better learners and what he's offering is the most efficient system, as well as loads of supplementary material, to help us achieve that. I have 3 big praises for the course.1) The course is really well laid out both in lectures and syllabus. If you have the discipline to practice just a bit with the homework everyday then you should see improvement pretty quickly. Even when I've been lax, I've seen great improvement to the skills the course promises to improve.2) Jonathon pares down some pretty complicated ideas and processes into basic material that is easy to understand and feels relevant to the goals of the course. If you're listening to the lectures and doing the homework, you'll never feel like you're time is being wasted on something you don't want/didn't ask for.3) Some of the supplementary materials the course points you towards, such as the Key to Study blog or Anki, are fantastic. I can't overstate this because the meat of the course is in what's provided for you to work with, as exercises or tools for application of what's taught in the course.I have 3 main critiques though.1) most of these lectures are just Jonathon talking in front of a white space and the script can be a bit wooden. This can make it very easy to become distracted or disengage with what he's saying (i turned on the subtitles so that I had something to look at during the lectures).2) while Jonathon's explanations make many of the principles easy to understand, the course sometimes doesn't feel like it gives you a very practical way to apply or practice these concepts. The visual markers section in particular took a while for me to get a handle on practically. The exercises are great but perhaps more demonstrations would help make application easier.3) while some of the supplementary material is great,  there is a good portion of it that seems superfluous (links to wikipedia articles that basically reiterate the lectures, articles providing history for the science behind the techniques which may or not be interesting to the students, etc.). The syllabus feels overloaded and should really be either streamlined or further organized (i.e. \"essential materials\" vs \"Stuff you may find interesting\"). For example, lecture 8 has eight recommended supplemental  materials. I worked through most of it but I really only found about 3 of the articles important to the course. The rest is stuff that's really only interesting if you're also interested in the techniques and science academically."
  },
  {
    "no": 89,
    "date": "2017-06-13 04:29:31",
    "fromNow": "11 days ago",
    "user": 90,
    "name": "Carla Allen",
    "rating": 1,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have not yet completed the course but so far it is way too much talking about theories. I desire practicability.  I will do another rating at the end of the course."
  },
  {
    "no": 90,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 91,
    "name": "Jason",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Instructor points you to 3rd party material for everything. Would like the instructor to create some of his own drills, so that the learner can practice them and really utilize these concepts in the real world."
  },
  {
    "no": 91,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 92,
    "name": "William R Wolfe",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Nicely done! Love the hand outs and references materials.App did not sync with web site."
  },
  {
    "no": 92,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 93,
    "name": "Exequiel Baldasso",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Love it. I'm seeing vast improvements in my memory in all aspects of my life. I just memorized a whole Chopin Etude from start to finish in about 1 hour and 40 minutes. Before it would take me weeks. Holy crap this is awesome!"
  },
  {
    "no": 93,
    "date": "2017-06-03 04:29:31",
    "fromNow": "21 days ago",
    "user": 94,
    "name": "Soen Surya Soenaryo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "just finished half od the course and I felt that my speed reading has been improved! So many useful idea and training that I got on here to improve the way I read and learn. So eager to finish up this course! Even though I need to speed up the video because too slow for me"
  },
  {
    "no": 94,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 95,
    "name": "Damian Campbell",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The information this course shares on how to improve your memory alone is worth getting this course."
  },
  {
    "no": 95,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 96,
    "name": "Heather Weaver",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Love this course - bought the full master class. Definitely worth it, I ended up w/ 1100 WPM & 100% comprehension on the final test. Can't wait to continue improving, applying and tweaking these skills."
  },
  {
    "no": 96,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 97,
    "name": "Joakim Königsson",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The practical part could be improved with web/mobile applications with exercises."
  },
  {
    "no": 97,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 98,
    "name": "Andreea Manea",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very good for those who wants to learn very fast."
  },
  {
    "no": 98,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 99,
    "name": "Vojtech Jaros",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Still not fully committed to giving it  5 stars, but I improved some parts of my learning. Sometimes the explanations feel a bit vague...Hopefully, it'll change during the next weeks. :)"
  },
  {
    "no": 99,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 100,
    "name": "Shawn Sungwook Lee",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thank you Jonathan! Your passion and experienced knowledge accelerated my learning skill tremendously. It's one of the best Udemy course."
  },
  {
    "no": 100,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 101,
    "name": "Victor Serra",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excelente curso. Bem explicado, totalmente aplicável no dia-a-dia, ótimo acompanhamento e uma grande quantidade de material para estudo e aprofundamento dos conceitos."
  },
  {
    "no": 101,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 102,
    "name": "Richard Mashava",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course!The material is very useful and lectures are well presented and concise.All the hard work is left to the individual. Thanks for the course."
  },
  {
    "no": 102,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 103,
    "name": "Louis Becker",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I find the course really helpful. It builds progressively and logically, which makes it easy for me to relate and enjoy the information."
  },
  {
    "no": 103,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 104,
    "name": "Emilia Nangolo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great course.  It has addressed some of misconceptions that I had about remembering what I learned."
  },
  {
    "no": 104,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 105,
    "name": "David M Levin",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far so good.  Its building up, anxious to keep going despite the daunting number of lectures."
  },
  {
    "no": 105,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 106,
    "name": "Hazel Wei Libin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The content is worth the amount - bought during discount.  - Very valuable course."
  },
  {
    "no": 106,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 107,
    "name": "Mohamed Shoir",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is not as I expectedI thought that taking the course and do the training associated with the course is sufficient to develop my reading and learning skills ... but i noticed that the instructor is referring to a lot of other materials, requesting several extra data to read .. !!!"
  },
  {
    "no": 107,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 108,
    "name": "Melanie Dyer",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course gives good, thorough advice for storing information into your long term memory. There are lots of useful information stored in the course syllabus. Give this course a try."
  },
  {
    "no": 108,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 109,
    "name": "Matt B",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've been inspired by every lecture & every tidbit of knowledge I can grab onto. Can't wait for the next half!"
  },
  {
    "no": 109,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 110,
    "name": "Giorgi Tsinaridze",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is a truly life changing course! Highly recommended."
  },
  {
    "no": 110,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 101,
    "name": "Victor Serra",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excelente curso. Bem explicado, totalmente aplicável no dia-a-dia, ótimo acompanhamento e uma grande quantidade de material para estudo e aprofundamento dos conceitos."
  },
  {
    "no": 111,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 102,
    "name": "Richard Mashava",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course!The material is very useful and lectures are well presented and concise.All the hard work is left to the individual. Thanks for the course."
  },
  {
    "no": 112,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 103,
    "name": "Louis Becker",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I find the course really helpful. It builds progressively and logically, which makes it easy for me to relate and enjoy the information."
  },
  {
    "no": 113,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 104,
    "name": "Emilia Nangolo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great course.  It has addressed some of misconceptions that I had about remembering what I learned."
  },
  {
    "no": 114,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 105,
    "name": "David M Levin",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far so good.  Its building up, anxious to keep going despite the daunting number of lectures."
  },
  {
    "no": 115,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 106,
    "name": "Hazel Wei Libin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The content is worth the amount - bought during discount.  - Very valuable course."
  },
  {
    "no": 116,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 107,
    "name": "Mohamed Shoir",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is not as I expectedI thought that taking the course and do the training associated with the course is sufficient to develop my reading and learning skills ... but i noticed that the instructor is referring to a lot of other materials, requesting several extra data to read .. !!!"
  },
  {
    "no": 117,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 108,
    "name": "Melanie Dyer",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course gives good, thorough advice for storing information into your long term memory. There are lots of useful information stored in the course syllabus. Give this course a try."
  },
  {
    "no": 118,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 109,
    "name": "Matt B",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've been inspired by every lecture & every tidbit of knowledge I can grab onto. Can't wait for the next half!"
  },
  {
    "no": 119,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 110,
    "name": "Giorgi Tsinaridze",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is a truly life changing course! Highly recommended."
  },
  {
    "no": 120,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 111,
    "name": "Maria Smith",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear to follow. I really like having the syllabus and content available through the html bookmarks."
  },
  {
    "no": 121,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 112,
    "name": "Marco Fazio",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "well-paced course, thoroughly explained with details and further points for improvement and good balance between practice and theory, exercises and lectures."
  },
  {
    "no": 122,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 113,
    "name": "Renee Volchko",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "JL is an incredible teacher. I'm not even half way through this course and it's definitely worth every penny!"
  },
  {
    "no": 123,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 114,
    "name": "Stephen Holmes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Seems to be good information, but i am still on the introduction of the course."
  },
  {
    "no": 124,
    "date": "2017-06-16 04:29:31",
    "fromNow": "8 days ago",
    "user": 115,
    "name": "Jonathan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Now I see memory and learning completely different and I actually enjoy spending time on this course."
  },
  {
    "no": 125,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 116,
    "name": "Marcian Enache-Poti",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Packed with documented and relevant information that is new or I already knew, the style of presenting them helps structuring and remembering, as well as practicing sometimes even on the go. Really useful so far."
  },
  {
    "no": 126,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 117,
    "name": "Abdelmadjid Zaher",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Pour l'instant je reste sur ma fin en ce qui concerne la mémorisation et lecture rapide"
  },
  {
    "no": 127,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 118,
    "name": "Elio Navarro",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Taking your time with the techniques is very important. I have yet to read one thousand words per minute with 80% retention but like any skill it requires practice and dedication. I am confident that with I can work my way up as the course goes on."
  },
  {
    "no": 128,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 119,
    "name": "Edward Plata",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far so good , ive learned alot of useful tips and shortcuts that have doubled my reading speed , hope to double it again soon."
  },
  {
    "no": 129,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 120,
    "name": "Jon Stinson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I own and have taken several of Jonathan Levi's courses, and they are always very high quality, and very well put together. I'm confident I've spent my money well here."
  },
  {
    "no": 130,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 121,
    "name": "Jean Duclos",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Many links in this course does not work for me."
  },
  {
    "no": 131,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 122,
    "name": "Rodrigo Diaz",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As the course progress things start to click more and more. I might have to review some lectures just to make sure i get the most out of them."
  },
  {
    "no": 132,
    "date": "2016-10-24 04:29:31",
    "fromNow": "8 months ago",
    "user": 123,
    "name": "Garrett Christensen",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was an awesome course! Speed reading was what I was hoping to get out of the course, but I ended up getting so much more! I also loved that the videos/lectures were only a small portion of the class. I got a lot of cool insights from everything else about the course. I definitely recommend it."
  },
  {
    "no": 133,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 124,
    "name": "Bruce Nunez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Enjoying the course, very well structured and easy to follow."
  },
  {
    "no": 134,
    "date": "2016-10-24 04:29:31",
    "fromNow": "8 months ago",
    "user": 125,
    "name": "David Yastremsky",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great lectures! You have to put work into the course to get a lot out of it, but Jonathan does a great job delivering the content and providing the support system for you to excel. This course will provide you with the tools to accelerate your memory, reading, and learning speed."
  },
  {
    "no": 135,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 126,
    "name": "Anh Trinh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative course. Highly worth the money"
  },
  {
    "no": 136,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 127,
    "name": "Aaron Caulfield",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. Thorough and pragmatic."
  },
  {
    "no": 137,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 128,
    "name": "Mel Ona",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Outstanding presentation of extremely valuable content--immediately applicable and useful!"
  },
  {
    "no": 138,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 129,
    "name": "Kelanwhite white",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "i'm roughly 20% through the course and still haven't improved my reading and comprehension rate. Early doors but so far can't say I feel I have improved"
  },
  {
    "no": 139,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 130,
    "name": "Michael McDaniel",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am excited about increasing my memory skills, also my reading & comprehension skills. There is so much information available in print that I am interested in reading and only so much time to do it.Having read the syllabus PDF and a few of the links, I am confident this will happen with plenty of work. Previous to starting course, I worked out a schedule to attend that will have minimum disruption on day-to-day life. An investment - I will have more time later when I can read faster (though I will probably read more things then!)."
  },
  {
    "no": 140,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 131,
    "name": "Larry Dickerson Jr.",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "From the first few introduction videos, I was very excited to get started. After reviewing the syllabus, however, this course is not organized and simplified for the user.  The videos are great, but the exercises need to be simplified.  I'm gaining better results with apps like \"Reading Trainer\" and \"NeuroNation.\"  No offense to the creators/teachers of this course, but my genius has to be engaged with little instruction more exercise and this course gives you tests that are not that engaging.  \"NeuroNation\" is my suggestion to anyone looking to become a \"Super\" learner or sharper at anything.  Also \"Reading Trainer.\" These apps do what this course is promising in record time with no videos, boring tests, or wasted printing paper.  No offense."
  },
  {
    "no": 141,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 132,
    "name": "Maximilian Hillmer",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Got a lot of \"wow\" experiences. Tried out and be successful. Very motivating. This class keeps me very much involved. Its fun as well. Good job"
  },
  {
    "no": 142,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 133,
    "name": "Petra Fanni Nemeth",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I already have willingness to finish this course, which usually doesn't happen with other online courses."
  },
  {
    "no": 143,
    "date": "2016-10-24 04:29:31",
    "fromNow": "8 months ago",
    "user": 134,
    "name": "Kevin Bingaman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A lot of video training is boring. But so far this is holding my interest and I am looking forward to learning the material."
  },
  {
    "no": 144,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 135,
    "name": "Stanislava Goranova",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very clear and easy to follow introduction! I can really recommend this course not only to students, but to everyone, who wants to change the speed and quality of working with information!"
  },
  {
    "no": 145,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 136,
    "name": "Steve",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear, concise, and a good explanation about what to expect."
  },
  {
    "no": 146,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 137,
    "name": "Mr Danny Leong Ee Nung",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very methodological with plenty of games and exercises thrown in to improve learning and retention."
  },
  {
    "no": 147,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 138,
    "name": "Keron Joseph",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Near perfect thus far. With little practice and barely 2 weeks into the course my short term memory has improved and my reading retention as well. Probably the best course on udemy since it will make you be better and doing the other courses. If you see this on sale don't hesitate.  It is a shame the price point may make others miss out."
  },
  {
    "no": 148,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 139,
    "name": "Matteo tortora",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I never been a fan of this courses, but this small lectures and works to do, completely got my attention. ps the only think i don't like are the podcast (that, i know, are not mandatory)"
  },
  {
    "no": 149,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 140,
    "name": "Stephanie Wang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "really interesting theory and tactics. Will try and see"
  },
  {
    "no": 150,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 141,
    "name": "Sitar Cohen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm only 1/4 way through and this has already taught me so much. Well worth it!! Thank you for the great insight"
  },
  {
    "no": 151,
    "date": "2017-06-21 04:29:31",
    "fromNow": "3 days ago",
    "user": 142,
    "name": "Ali El Saleh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Simple. Easy To Understand. The first method he teaches worked right away for me!"
  },
  {
    "no": 152,
    "date": "2016-10-24 04:29:31",
    "fromNow": "8 months ago",
    "user": 143,
    "name": "Natalie Edwards",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Terrific content.  The supplemental information for each session was very helpful.  Took me a while to complete the course, but very much worth it.  I would very much recommend this to everyone."
  },
  {
    "no": 153,
    "date": "2017-01-24 04:29:31",
    "fromNow": "5 months ago",
    "user": 144,
    "name": "Erling Magnus Solheim",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The presenter is great and explains the reasoning behind the chosen curriculum and progress so that you're motivated for what comes next."
  },
  {
    "no": 154,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 145,
    "name": "Johnbosco Chienye",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm learning new things from this course - every day."
  },
  {
    "no": 155,
    "date": "2017-03-24 04:29:31",
    "fromNow": "3 months ago",
    "user": 146,
    "name": "Wesley Oliveira Azevedo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I leave this rating because my life is changing, not only am I improving my memory skills. but also battling some issues in my life right now and the course is truly helping me out. thx!"
  },
  {
    "no": 156,
    "date": "2017-02-24 04:29:31",
    "fromNow": "4 months ago",
    "user": 147,
    "name": "Kelvin Ang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lifechanging. What can I say? Enroll now!"
  },
  {
    "no": 157,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 148,
    "name": "Giovanni",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Still i didn't learn anyting new"
  },
  {
    "no": 158,
    "date": "2016-11-24 04:29:31",
    "fromNow": "7 months ago",
    "user": 149,
    "name": "James Pilz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I felt this course deserved a 5 star rating because it's everything I wish I had when I was growing up in school. I love the science about the brain and how memory works, and I can't believe how awesome the 'chunking' technique works! As a parent wanting to raise my 2 girls as best as possible, I feel privileged to pass down this invaluable knowledge. Thank you guys, for making this course available."
  },
  {
    "no": 159,
    "date": "2016-12-24 04:29:31",
    "fromNow": "6 months ago",
    "user": 150,
    "name": "Jeronimo Armella",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Ya tengo la información general pero me falta empezar a trabajar."
  },
  {
    "no": 160,
    "date": "2017-05-24 04:29:31",
    "fromNow": "a month ago",
    "user": 0,
    "name": "Jonathan Levi",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Jorge Ibarra Delgado",
    "content": "Awesome, so glad you appreciate all our hard work!!!"
  },
  {
    "no": 161,
    "date": "2017-04-24 04:29:31",
    "fromNow": "2 months ago",
    "user": 0,
    "name": "Jonathan Levi",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Gnostic 666",
    "content": "Sorry you feel this way. We have tens of thousands of students who've succeeded with these methods, but it sounds like you didn't even give them a chance. Oh well."
  }
]