[
  {
    "no": 0,
    "date": "2017-06-15 04:14:19",
    "fromNow": "9 days ago",
    "user": 0,
    "name": "Matthew Malecki",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Tony does a great job in not only explaining the code but delves into what is going on under the hood in some instances of looking at the source code of the V-8 engine.  He also does a very thorough job in explaining the \"why\" during the coding exercises .  You will not only learn Node.js but get a deep understanding of Node related topics.  The first half of the course in more theoretical and lays a good foundation for the hand-on coding exercises that he walks through.  I highly recommend this course for anyone who is interesting in learning Node.  This should be your first course in Node."
  },
  {
    "no": 1,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 1,
    "name": "Srinivas Gudipati",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have 2 wishes. Hope at least one of them gets fulfilled. Either Tony should release more tutorials as I don't see him release any tutorials these days (at least not in Udemy) or I wish I find another instructor who explains as clearly as he does. I think I will sign up for his tutorial even if he teaches alphabets :). Simply the best instructor I even learnt from in my life."
  },
  {
    "no": 2,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 2,
    "name": "Ott-One",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great for understanding the basics and get started, but no mention of error handling at all. It is too easy to break the Todo API. It's not robust at all."
  },
  {
    "no": 3,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 3,
    "name": "Vlad Vladimirov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thanks to Anthony Alicea,  NodeJS  is no longer a mystery project :-)Areas of responsibilities of C++ library of NodeJS , and V8 JS engine are cleared rather well by the trainer.  Excellent demonstration of VS Code debugger capabilities give a clue where to find the current API when Node JS and ES6,7 open source projects will mature."
  },
  {
    "no": 4,
    "date": "2017-05-31 04:14:19",
    "fromNow": "24 days ago",
    "user": 4,
    "name": "Pawan Kakarla",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was explained in a detailed manner. Must go through if you are learning JavaScript and Nodejs for first time."
  },
  {
    "no": 5,
    "date": "2017-02-24 04:14:19",
    "fromNow": "4 months ago",
    "user": 5,
    "name": "Darren King",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very thorough course, that takes the time to explain both the \"how\" and the \"why\" of Node functionality."
  },
  {
    "no": 6,
    "date": "2017-06-06 04:14:19",
    "fromNow": "18 days ago",
    "user": 6,
    "name": "Mr. Mateus Pinto Paes Tavares",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really enjoyed this course, up until the last lesson on building an app with Angular. I understand this course isn't about Angular, but the last chapter introduced a digested version of it, and it mentions Typescript for the first time. It's a concept that I wasn't expecting to hear from, and although I know some of it already, it may scare students who came here to learn Node.This course is unbeatable. It's the ultimate Node course you'll ever need, but it should stop there, no further technologies please."
  },
  {
    "no": 7,
    "date": "2017-06-22 04:14:19",
    "fromNow": "2 days ago",
    "user": 7,
    "name": "Juan Valdes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great course, Tony teaches you the \"nitty gritty\" and not just to imitate code. Take this course first and then go anywhere else. I highly recommend you to take his other course \"JavaScript: Understanding the Weird Parts\" also."
  },
  {
    "no": 8,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 8,
    "name": "Brandon Flynn",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent on theory and practice. Taught carefully and thoughtfully from someone who clearly understands and works with Node in the real world. Anthony never let's any confusion pass by — if he says an unfamiliar word, he explains it.Worth much more than the $15 I spent on it."
  },
  {
    "no": 9,
    "date": "2017-06-11 04:14:19",
    "fromNow": "13 days ago",
    "user": 9,
    "name": "Artashes Ghazaryan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course based on explanation of what is going on under the hood. Would be valuable not only for beginners but also for experienced developers who came with other programming languages background and decided to use node.js.Thank you very much Anthony. Your way of delivering new knowledge is perfect!"
  },
  {
    "no": 10,
    "date": "2017-06-03 04:14:19",
    "fromNow": "21 days ago",
    "user": 10,
    "name": "Marcin Panawa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The explanations of the Node's mechanisms are really good.  I'm really waiting for extending the last part of course:  Angular2 frontend. I can fully recommend this course. I bought already authors course about weird parts of js just beacuse I like the very detailed explanation from this course and I hope I'll find the same style and quality in next one."
  },
  {
    "no": 11,
    "date": "2017-06-13 04:14:19",
    "fromNow": "11 days ago",
    "user": 11,
    "name": "Michael Campos",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This provided a good introduction to NodeJS. I felt he skimmed through some stuff like the Mongo setup or the last video about Angular. But I think he made it clear earlier that this course was not about them so they probably were intentionally made that way."
  },
  {
    "no": 12,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 12,
    "name": "Will Ho",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Not for beginners and not for the faint of heart. Full of bloat, background knowledge and good-to-know information.A ton of theoretical information about Javascript, the C++ V8 engine without much practice on using actual NodeJS.Examples are often confusing due to confusing naming of methods and variables. Not to mention he teaches the outdated ways of creating an object first before telling you that there's actually an easier, newer way (ES6) without having to touch prototypes, constructors and inheritance, called the class keyword. But even as someone who is sufficiently experienced in programming, it was a HUGE PAIN to reach there, I can't imagine how much more demoralising than it should have been for a beginner, not knowing what's really important, to pick all these up at one go.More focus should be on quickly building an actual app and not about the design patterns. All that should be in a separate course.UPDATE: So I just completed the course, I felt it was just trash. There's no focus as to what he is trying to teach, frequently digressing with \"Conceptual Asides\" and lame \"Big Word Alerts\" that trivialise the viewer's intelligence. It touches on many other aspects such as relational databases, NoSQL databases, frontend frameworks like AngularJS, and React.js, touches a little bit on CDNs, skims through some jQuery, SQL queries, CSS, and did pretty much shallow coverage on what NodeJS has to offer. It even has a lecture that tries to teach you how to be a Full-Stack developer when the course is really about NodeJS!What's worse, the course is not even complete yet and it remains incomplete since the day I purchased it with zero updates. Ridiculous.Please don't buy this course. Save yourself some money and effort, look for something else.- From a fellow full-stack web developer."
  },
  {
    "no": 13,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 13,
    "name": "Breana Y Wallace",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love how in depth all of Tony's courses are. They are great for understanding what's going on when you feel like you're swimming in too much new information that other courses on here will throw at you. I personally feel more comfortable learning from the bottom up. I would suggest that you supplement with another Node course though as well so that you don't just learn a ton of concepts at once that don't really have much relevance to you if you haven't done anything in Node. This way, you can feel free to pick up a fast paced, project heavy course and switch back and forth between the two incrementally.  This will help not only with understanding how to apply what you're learning as you go so that it sinks in, but you can move forward knowing that you're ready for new concepts."
  },
  {
    "no": 14,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 14,
    "name": "Rui Filipe Ramires Rodrigues",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best NodeJS tutorial ever...In this tutorial i could understand JavaScript concepts that in the reak world were passing by me...The incredible knowledge passing by the tutor is huge!!! since JavaScript to C++, he can explain what's real going on behing NodeJS...I Strongly recomend this tutorial for those who want to try NodeJS or MEAN Stack!"
  },
  {
    "no": 15,
    "date": "2017-06-08 04:14:19",
    "fromNow": "16 days ago",
    "user": 15,
    "name": "Anthoni Gardner",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "An excellent course and introduction on Node.The tutor takes you through the beginning and explains everything in great detail."
  },
  {
    "no": 16,
    "date": "2017-06-21 04:14:19",
    "fromNow": "3 days ago",
    "user": 16,
    "name": "Miłosz Filipowicz",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Everything is explained in depth, but in my opinion too repetitive sometimes. I know teacher wanted us to deeply understand every topic, but this repetitiveness became slightly tiring after some time."
  },
  {
    "no": 17,
    "date": "2017-06-20 04:14:19",
    "fromNow": "4 days ago",
    "user": 17,
    "name": "Mh",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Wish he could go more detail into Express JS but the old fashioned way and its explanation into how it all became is flipping GOLD. I understand server-side programming to the bits now."
  },
  {
    "no": 18,
    "date": "2017-01-24 04:14:19",
    "fromNow": "5 months ago",
    "user": 18,
    "name": "Ronen Meiri",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As a developer I want to learn more on Node.JS . I think this course is great and extensive . although the examples are pretty simple they make the point !I would totally recommend the course."
  },
  {
    "no": 19,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 19,
    "name": "J.C. Amitie",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent explanations of some core concepts. This course may take longer than some others but you will gain a deeper understanding of the whys and wherefores of nodeJS with this course. My only criticism is some of the lessons towards the end have some poor editing but other than that I'm very happy with this course."
  },
  {
    "no": 20,
    "date": "2017-06-17 04:14:19",
    "fromNow": "7 days ago",
    "user": 20,
    "name": "Domitrius Clark",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Anthony again has absolutely amazed me with his amazing attention to detail. I will be revisiting this course over and over to truly establish myself as a fully competent NodeJS dev. Thank you Anthony!"
  },
  {
    "no": 21,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 21,
    "name": "Amin Kasbi",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Goes Step by Step during the courseExplains good the technical words which sound complicatedExplains the fundamental core of the NodeJsSwitch to the JavaScript Aside when necessary to clarify more how NodeJs worksVery clear and understandable english"
  },
  {
    "no": 22,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 22,
    "name": "Jeffrey Ololu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is the best ever on Node Js. It takes you to the root-bottom- to the top. Most teachers concentrates on building the app and students end up not understanding what is really going on. Just copying. With this course lots of concepts are made simple and easy. The advanced stop being advanced. I sincerely recommends it. Thanks a million Tony!!!"
  },
  {
    "no": 23,
    "date": "2017-06-17 04:14:19",
    "fromNow": "7 days ago",
    "user": 23,
    "name": "Paraskevas Apostolopoulos",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Useful course overall. I think Mr Alicea could do a bit better with explaining the in depth parts of the Node built in code. Since he is going through the process of explaining what is going on, browsing up and down the code is not adding the best value because it looks patchy. Overall though I feel like I have learned quite a few things and I recommend this course."
  },
  {
    "no": 24,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 24,
    "name": "Joel Valdez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thanks for sharing your knowledge with us Tony. Highly recommended for those who wants to know a better understanding of Nodejs."
  },
  {
    "no": 25,
    "date": "2016-12-24 04:14:19",
    "fromNow": "6 months ago",
    "user": 25,
    "name": "David O",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course, I now understand exactly what Node.js is and why it provides us with everything we need to build our own web-servers."
  },
  {
    "no": 26,
    "date": "2017-06-22 04:14:19",
    "fromNow": "2 days ago",
    "user": 26,
    "name": "Jason Cheng",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great explanation! Taking a star away because the end project was quite a big jump from the previous easy-to-understand lessons"
  },
  {
    "no": 27,
    "date": "2017-06-16 04:14:19",
    "fromNow": "8 days ago",
    "user": 27,
    "name": "Chris Tse",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course covered a wide variety of topics that are important for anyone new to NodeJS. The concepts were explained simply enough for beginners to grasp, but are also built upon for a solid understanding. Took off half a star since the course still isn't finished yet. Looking forward to seeing the rest of it soon!"
  },
  {
    "no": 28,
    "date": "2017-06-21 04:14:19",
    "fromNow": "3 days ago",
    "user": 28,
    "name": "Caio Riserio da Silva",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Last parts gave me the feel you were rushing, and actually, these pats were the most importants one in the course."
  },
  {
    "no": 29,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 29,
    "name": "Greg Knudsen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like how explained Node working under the hood with C++. Several concepts (callbacks, eg.) that were confusing to me before are much clearer now. Thanks, Tony!"
  },
  {
    "no": 30,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 30,
    "name": "Jinwoo Yom",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I wish there were multiple projects rather than having only one final project"
  },
  {
    "no": 31,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 31,
    "name": "Lars Juel Nielsen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love how this course builds a solid foundation for understanding what is actually going on. I already knew most of this from having tried to build a couple small MEAN-stack applications before, but it was a great refresher and it helped improved my mental model of how all the parts fit together.I would have liked more focus on the NodeJS API in the course, this being a NodeJS course after all, but it does cover the most commonly used parts in enough detail to be useful."
  },
  {
    "no": 32,
    "date": "2017-06-14 04:14:19",
    "fromNow": "10 days ago",
    "user": 32,
    "name": "Dimitar Mateev",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Unlike \"JavaScript the weird parts\" this course goes from basic to advanced without explaining it well. A lot of side technology included and if you don't know it, the whole building front-end, back-end app  looks like Chinese. Also a some of dependencies and methods are outdated, as of today."
  },
  {
    "no": 33,
    "date": "2017-06-22 04:14:19",
    "fromNow": "2 days ago",
    "user": 33,
    "name": "Michael Benson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an excellent course in my opinion.  I like the approach of learning how things work under the hood with code and appreciate that this isn't strictly rote repetition of what the instructor is presenting."
  },
  {
    "no": 34,
    "date": "2017-06-11 04:14:19",
    "fromNow": "13 days ago",
    "user": 34,
    "name": "Jeremy Wuestefeld",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Definitely still an \"early bird\" version. It looks really promising though, I hope the instructor continues to add content! What's here is good, but VERY conceptual, lots of explaining the ideas... not much practical exercises or hands-on learning, yet."
  },
  {
    "no": 35,
    "date": "2017-06-14 04:14:19",
    "fromNow": "10 days ago",
    "user": 35,
    "name": "Trevor Barton",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Fantastic Introduction to Node. Tony is SUPER good at really helping you understand NodeJS conceptually. Like is JS the Weird Parts course, this should be the first stop for you on this topic. 3/5 stars only because the final lecture is left incomplete after over a year."
  },
  {
    "no": 36,
    "date": "2017-06-01 04:14:19",
    "fromNow": "23 days ago",
    "user": 36,
    "name": "Andre Luis Borges de paula",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course was great. The course isn't a how to, instead, it teach us how the things work behind the scene. I learned a lot of new concepts. But I think it should have a project what we should follow and apply the concepts we are learning."
  },
  {
    "no": 37,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 37,
    "name": "Rahul Pandey",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very well paced course. If you want to learn how the framework of NodeJS works, then this is one of the courses you can depend upon."
  },
  {
    "no": 38,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 38,
    "name": "Vlad Malikhtarovich",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "course isn't complete. Topics about angular js and typescript are awful. I had so much troubles setting angular up that was not covered in the course :("
  },
  {
    "no": 39,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 39,
    "name": "Greg Smorag",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "My main problem with that course is that is seems it has been abandoned by the lecturer. He is not replying anybody's questions any more and the codebase in the course is outdated (old version of nodejs used). What's more I found several errors in source code of examples. That leaves very bad testimony about the lecturers engagement and not treating students like idiots."
  },
  {
    "no": 40,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 40,
    "name": "Andrew Okeefe",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The Instructor is very through. He explains concepts of what is going on and why, which helps me take this information and apply it to my own projects. I'm so happy to have found and instructor that does MORE THAN show you how to cut and paste code with no explanation of what code is doing what. Great Instructor."
  },
  {
    "no": 41,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 41,
    "name": "Luisma Whatakuai",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Muy buen contenido, un inglés que se entiende perfectamente (a 1.5X también se entiende) y explica claves que hacen que comprendas la base de la tecnología. Recomendado."
  },
  {
    "no": 42,
    "date": "2017-06-07 04:14:19",
    "fromNow": "17 days ago",
    "user": 42,
    "name": "Bernard DeLuca",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Absolutely excellent course!!!  Every critical term was well-explained and demystified in a way which I found easily understandable and memorable.  The pace was perfect for me.  It was a very pleasant surprise to see that the course included numerous related technologies; far more than the title suggests.  How each technology fits into the whole was clearly presented throughout the course.  Perhaps most importantly, a strong foundational understanding of exactly why and how each technology is utilized to achieve the desired end result was certainly extremely valuable.  This course is an absolute must for those wanting to truly understand Node.js and related technologies.  10 stars!!!!   :)"
  },
  {
    "no": 43,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 43,
    "name": "Mark Kramer",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A little slow out of the gate. 9 minutes on the command line? After that it picks up and if you know your way around node.js, you'll soon find some interesting tidbits that will help solidify your understanding."
  },
  {
    "no": 44,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 44,
    "name": "Simeon Knieling",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great in the beginning but a bit hasty in the last chapter's video about Angular2. One or two videos about changes in ES7 wouldn't hurt either. Feels a bit outdated."
  },
  {
    "no": 45,
    "date": "2017-05-31 04:14:19",
    "fromNow": "24 days ago",
    "user": 45,
    "name": "David Faherty",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course encourages you to grasp the fundamentals before you start putting things together with node.I know a lot of javascript, so this meant I skipped and fast-forwarded some parts, but overall, I think this was a really good way to get comfortable with nodejs, and I feel I got a lot out of this course."
  },
  {
    "no": 46,
    "date": "2017-01-24 04:14:19",
    "fromNow": "5 months ago",
    "user": 46,
    "name": "ZZgooloo Zargham",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Pretty in depth course, covers all the basics and delves deeply in the core of Node \"core.\" I could go on and on here, but I will just say that I can guarantee you, that this course is worth $15. Considering you want to learn Node.js that is."
  },
  {
    "no": 47,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 47,
    "name": "Alison Y Koyano",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The NodeJS part of the course is very good including MongoDB and Express. However, at the end of the course, the instructor decided to include/use AngularJS but the lectures gave only an overview and were kind of incomplete. This way, in my humble opinion, this course was doing very good but by the end of the road, it created some expectations (with AngularJS) that were not satisfied. Maybe, it could have followed a different path to keep all the covered content very well explained."
  },
  {
    "no": 48,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 48,
    "name": "Tiffany Stewart",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Tony is an incredible instructor. I've always struggled with Javascript concepts but he makes information not just easy to understand, but also easy to retain and implement in real world applications. I'm taking this course for my current job as a front end developer and I would 10/10 suggest it for anyone working in development or just looking to begin a career in development, this (and any of his other courses) will be a huge help."
  },
  {
    "no": 49,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 49,
    "name": "Steve Byrne",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The level of detail is really high.  Starting from beginner, he builds up a knowledge base of concepts, and then leverages it to show how things work.   I loved how he went into the details of how module loading works -- it finally makes sense how it operates.  Highly recommend this course!"
  },
  {
    "no": 50,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 50,
    "name": "Nathan Hannig",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really filled in the missing pieces I had from previous free teachings I had on Node and Express especially with the application structure."
  },
  {
    "no": 51,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 51,
    "name": "Stefan Ingthorsson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent instructor. He never assumes that you know what he's talking about.  He clearly defines all the terms and shows simple and understandable examples of code before moving forward with more complicated  concepts."
  },
  {
    "no": 52,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 52,
    "name": "Frankc60 C",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "very good explanations, but the last part of the course had a lot less explanations. Also the Angular 2 addition confused me a bit as it was different from other lectures. Overall all though a great course!"
  },
  {
    "no": 53,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 53,
    "name": "Will Chadwick",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a brilliant course. The depth in which everything is explained is perfect for me and I'll certainly be looking at other courses by Tony. My only one (very small) criticism is that there was not enough opportunity to practice and try the content along the way. Though there were lots of 'code a long' style exercises, I started to feel towards the end that I was trying to take so much new stuff in before consolidating the previous lesson. I feel some well designed challenge and solution style exercises along the way would really be the cherry on top for this course!"
  },
  {
    "no": 54,
    "date": "2016-12-24 04:14:19",
    "fromNow": "6 months ago",
    "user": 54,
    "name": "Satya M",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Big word Alert: Please change the user names (no more Jane doe and John doe :-))"
  },
  {
    "no": 55,
    "date": "2017-06-05 04:14:19",
    "fromNow": "19 days ago",
    "user": 55,
    "name": "Jonathan Roach",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very clear and detailed explanation of exactly what's going on. Heavy on theory and detail and light on creating practical things. But if you're looking to understand fully what's going on I would recommend this highly."
  },
  {
    "no": 56,
    "date": "2017-06-09 04:14:19",
    "fromNow": "15 days ago",
    "user": 56,
    "name": "Alexandru Saramet",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best learning experience on udemy, so far. Now I really understand how node and JavaScript works. Looking for further courses from Antony. Please continue the amazing work you are doing. Thank you."
  },
  {
    "no": 57,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 57,
    "name": "Max N",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is definitely the best course for people who want to understand how nodejs really works."
  },
  {
    "no": 58,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 58,
    "name": "Wadii Zaim",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Nice start but I'm not convinced by the last classes, the \"let's build an app in record time\" doesn't follow the \"let's understand\" spirit of the book"
  },
  {
    "no": 59,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 59,
    "name": "Iraklis Georgas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a solid 5 star course for those whose interested on *understanding* how nodejs works. Tony Alicea is an exceptional teacher with in-depth knowledge and very high commutation skills"
  },
  {
    "no": 60,
    "date": "2017-05-31 04:14:19",
    "fromNow": "24 days ago",
    "user": 60,
    "name": "Kevin Chhay",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course... author covers NodeJS and javascript, and how NodeJS is pieced together with other technologies."
  },
  {
    "no": 61,
    "date": "2017-06-04 04:14:19",
    "fromNow": "20 days ago",
    "user": 61,
    "name": "Christian Howard",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course content through section 10 is great. The videos are dated a bit and could use a refresh (ES6 isn't really used and Node version used is Node 4). What is more disappointing is that sections 11 and 12 aren't complete. Both sections end with \"part 1\" videos and the course content hasn't been updated in over 5 months. It's disappointing that courses have been posted for purchase but aren't completed."
  },
  {
    "no": 62,
    "date": "2017-01-24 04:14:19",
    "fromNow": "5 months ago",
    "user": 62,
    "name": "Shubham Sinha",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is great. The instructor has explained what Node is all about, others concentrate on web development using MEAN. The only downside was speed. I watched the complete course on 1.5x"
  },
  {
    "no": 63,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 63,
    "name": "Gordon Moore",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent, in depth discussion of Node and the Javascript behind it. And more...Includes material on Angular, MongoDB and the Mean Stack and being a Full Stcak developer. This is just excellent value.I am going to have to watch it again though. Some of the concepts do take me a little time to absorb, but I have no doubt that they will become totally clear on re-watch.Warning: It does cover, though perhaps in slightly less detail,, some of the concepts discussed in JavaScript-the weird parts. That's a good thing especially to newbies like me - repetition for emphasis. It's only in the first section though, the other sections are totally new.Just love this guys approach, delivery and the way he imparts the subject matter."
  },
  {
    "no": 64,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 64,
    "name": "Steven Minnikin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Starts off a little slow.  However, stick with it as it is a very thorough course and Tony is very knowledgeable.  I have learned so much by following this tutorial."
  },
  {
    "no": 65,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 65,
    "name": "Quoc-Hao TRAN",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course about NodeJS, however, the part about Angular2 in the end seems a little bit confusing for those who don't know it. Even though it is for example purpose but the structure is too difficult to be understood as a simple demo."
  },
  {
    "no": 66,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 66,
    "name": "Bharath Reddy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "wonderful course... you should have little patience, if you have prior java script experience. but at the end you will get great feeling like learned something new!!!"
  },
  {
    "no": 67,
    "date": "2017-06-12 04:14:19",
    "fromNow": "12 days ago",
    "user": 67,
    "name": "Cory Ramirez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I wanted to take this course because naturally, I am someone who is really wanting to learn the \"why\" and \"how's\". I have an intermediate understanding of Javascript as a language, so learning more back-end concepts and understanding how the big picture comes together was a skill I know I needed to advance my career opportunities.  Anthony does a great job at introducing Node, as well as a few other packages along the way.  Great course!"
  },
  {
    "no": 68,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 68,
    "name": "Michael halliday",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course, in depth explanations and content but the course isnt finished and therefore havent actually been able to put into practice with latest angular version."
  },
  {
    "no": 69,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 69,
    "name": "Zack Cuddy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Coming into this course as a programmer that has used JavaScript for a few years, I was excited to jump right into NodeJS.  However, with this course it may seem to start off a bit slow if you are familiar with JavaScript.  That is because the instructor makes sure to explain exactly what is going on and builds up all the foundation to UNDERSTAND everything that is going on in Node.  I found myself impatient in the early sections of this course.  However, the refreshers and the \"oh wow I didn't know it did that\" moments really helped when we finally take the dive into Node.  My advice to anyone taking this course is to pay attention even when the content may seem trivial.  Just from taking this course I have found I know more about JavaScript than even some Senior Developers that I work along side.  On top of that I have a great grasp on what Node is trying to do.  I recommend this course to anyone who not only is interested in Node but also interested in JavaScript as a whole."
  },
  {
    "no": 70,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 70,
    "name": "Jason Luboff",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Course incomplete. I did not realize until getting to the last video that the course content was not all there. While I did note the course was stated as incomplete, it was made out to sound like it would have additional content, not that its missing. Numerous others have questioned when it would be completed and no answers. The content itself is good, if not at times too deep into the underlying C++ code.."
  },
  {
    "no": 71,
    "date": "2017-02-24 04:14:19",
    "fromNow": "4 months ago",
    "user": 71,
    "name": "David Useche",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "great course, the end was a little confusing due to fact that Tony just c/p a lot of his angular 2 code without explaining what was going on,"
  },
  {
    "no": 72,
    "date": "2017-01-24 04:14:19",
    "fromNow": "5 months ago",
    "user": 72,
    "name": "Craig Fisher",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Love the \"don't imitate, understand \" mentality. I am a student in software engineering and I have always hated copy pasting code. Whenever I see any code I don't understand, I hate brushing past it without really understanding it on a fundamental level. Definitely not good for 'fast growth' but I know it will one day make me a great programmer! Glad I bought this course!"
  },
  {
    "no": 73,
    "date": "2017-02-24 04:14:19",
    "fromNow": "4 months ago",
    "user": 73,
    "name": "Jairo Hernandez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is just me personally watching the videos and not writing the code afterwards was a waste of time because only half of it was sinking in. The teaching style is awesome, but when I started writing the code I started feeling like node is not that daunting. Thank you for the superb training."
  },
  {
    "no": 74,
    "date": "2017-06-14 04:14:19",
    "fromNow": "10 days ago",
    "user": 74,
    "name": "Jiexin Lyu",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Pretty useful introduction. The first few chapters are great for new learners but a little redundant for experienced js developers."
  },
  {
    "no": 75,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 75,
    "name": "Ashok Raju",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The focus on foundational knowledge is phenomenal. Really sets this course far and above other courses.Still amazing attention to detail. Really well done!Near the end I felt we were a bit rushed to add a frontend to the API. I understand though that the focus of the course isn't really frontend development. Instead it would've been nice to maybe build an authenticated API. That said, this course is focused on Node and that it does so well! The best online course I've taken hands down."
  },
  {
    "no": 76,
    "date": "2017-04-24 04:14:19",
    "fromNow": "2 months ago",
    "user": 76,
    "name": "Doug Dryburgh",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The first 75% of the course was excellent. A good mix of new concepts while giving proper context. You lost me at the end though. It just seemed like things were hurried through without as much explanation as to why. Also, perhaps there could be more opportunity to practice what is being taught. I tried to code along with the lessons but there wasn't really a practical application shown for what we were doing."
  },
  {
    "no": 77,
    "date": "2017-03-24 04:14:19",
    "fromNow": "3 months ago",
    "user": 77,
    "name": "Jay Stagnone",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great content, moves a little slow for me.The \"big word alerts\" are probably useful for some people new to the concepts but they just slow things down. Wish there was a way to turn them off. But overall the course is probably better for the vast majority of students as a result of having them...Later: I just watched the last lecture (adding UI with Angular2) and I'm taking off a star; it was very disappointing. The \"lets build an app\" section started out great: building the API was very well done. However the overly-rushed lecture on Angular2 killed the buzz... it's a nice teaser for a future re-write that is promised in the last lecture/note of the course. When I get some email that the class is finished I'll come back and re-rate. Given how good the rest of the class has been I imagine I'll get back to 4.5-5 stars."
  },
  {
    "no": 78,
    "date": "2017-05-24 04:14:19",
    "fromNow": "a month ago",
    "user": 78,
    "name": "Yair Cohen",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I enjoy the lectures, but when I bought the course I thought that the course is dedicated to teach NODEJS and that javascript is just a small part.(I am already familiar with javascript)"
  },
  {
    "no": 79,
    "date": "2016-12-24 04:14:19",
    "fromNow": "6 months ago",
    "user": 79,
    "name": "Matteo",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Too many asides like \"what is JSON? What is UTF-8?\".Unfortunately I knew them all and what I needed was simply a course introducing the main concepts of Node, possibly understanding them under the hood. I actually learned them by attending it, but with a big burden of paying attention to tons of things a basic web developer already must know. Plus, so many asides can make lose to the main focus IMHO! I recommend the course  only to those who are not I.T. professionals and want to start coding in node as well as gaining some fundamentals (that will not be sufficient for a well-skilled I.T., but will be ok for starters and understanding Node!)."
  }
]