[
  {
    "no": 0,
    "date": "2017-06-17 04:10:37",
    "fromNow": "7 days ago",
    "user": 0,
    "name": "Adam Estela",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Outstanding comprehensive introduction to iOS. I love that Mark and the team take the time to explain what is happening behind the scenes for the code being written. I came out of this class fully able to create apps, teach myself more, and understand how to expand and scale what I'd learned to production level."
  },
  {
    "no": 1,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 1,
    "name": "Robert Carlson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "One of the better courses for getting a realistic handle on the practical aspects of app development - doesn't just stop at the IOS/Swift topics - goes on to include topics to help build a fully baked app."
  },
  {
    "no": 2,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 2,
    "name": "shashank kannam",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Giving this review after completing the course, best easy-intermediate level course. If you are just starting, this is the course for you."
  },
  {
    "no": 3,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 3,
    "name": "Alex McPherson",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have just completed this course after 3 months of studying with a full time job and busy household. I have been regularly applying what I have learned and I have to say even as a developer of 5 years I learnt a bucket load. I mainly wanted to take the course to learn Swift 3 as I am an Objective C developer who put off learning Swift for so long. I not only have the foundation with Swift down but I learned a tone of extra stuff i.e Firebase and Sketch! I wouldn't hesitate recommending this course to newbies or existing developers! Really good work guys!"
  },
  {
    "no": 4,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 4,
    "name": "Amer Chocolatech",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "its good course in first tutorialsbut the tutorials is not updated at allplease fix these issue because I am sure that you can make the best course EVER!thanks"
  },
  {
    "no": 5,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 5,
    "name": "Filippo Zanfini",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Today I finished the course. Perhaps this may be the day that will determine my future as a programmer. I hope to be able to create something. First of all I want to thank Mark Price and all the Devslopes team. Thanks for the great lessons. Thanks for the beautiful and interesting hours spent with you. You've given me the right energy for my future...now it's my turn! Love,Filippo."
  },
  {
    "no": 6,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 6,
    "name": "Franklin Tackett Jr.",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love the fact that he shows us possible errors that might come along. I've found myself going ahead in the programming and fixing errors before he gets to that point (I normally pause the video and try to figure out what he is going to do before he does it).UPDATE: I have learned a lot! I truly feel more like a programmer now that I've ever felt before."
  },
  {
    "no": 7,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 7,
    "name": "Doug Robison",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "There were multiple instructors. Some were very engaging and knowledgeable while others were not. I gave this course 4 stars because there is content that is missing or not current. Had those two things been taken care of, I would have given it 5 stars."
  },
  {
    "no": 8,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 8,
    "name": "Erick Dressler",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark Price and his team does a great job explaining the material. Although I do find it hard to follow along with them at time and had to rewatch a lesson video. I would have like to see at lease one video on how to use the accelerometer."
  },
  {
    "no": 9,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 9,
    "name": "Nour Hajjar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thank you for your professional course. Because of you and some other courses , My Game (Click it - The Run word)  is now on the AppStore."
  },
  {
    "no": 10,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 10,
    "name": "Takeo Kojima",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is helpful and the step-by-step tutorial videos make it very easy for a beginner like me to learn. However, there doesn't seem to be a standard of the tutorial videos between different tutors, so some of the videos are hard to follow. But overall, it is a great course."
  },
  {
    "no": 11,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 11,
    "name": "Kasper Skov Hansen",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A very great course! Mark is teaching in a way, that worked very good for me. It's both very clear and good explanation, but also humor is involved. It is exactly the teaching style that works to me.There are some teachers, who aren't fantastic, but because of the rotation of teachers, it was ok.A thing I didn't like very much, was that many of the projects were made for iOS 9. There are update videos in the beginning of those sections, but it made a confusion.Sometimes I got a feeling, that some of the videos were misplaced. I had to skip some of the sections and come back later. But totally I think it's a very good course that I recommed everyone who wants a solid foundation.I'm excited to make my own apps, and I wanna thank the team at Devslopes for this great course!"
  },
  {
    "no": 12,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 12,
    "name": "William Warren",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've done some coding before and Mark is great instructor.  I would probably recommend DevSlopes.  Wait until the end of the course to rate the course.  There are some curves in the road that are discouraging, but stick with it."
  },
  {
    "no": 13,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 13,
    "name": "Anders Zetterström",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "High quality education, good explanation of what we are doing. Easy to follow along. And always a good sense of humor. You will learn by doing apps that you can tweak and release by your self."
  },
  {
    "no": 14,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 14,
    "name": "Gökhan SAYILGAN",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "There are still much topic need to be learned. I Love listening lessons from Mark Price  but so much thing is missing for \"social media app\". at least they can show making a friend list and managing data according to that list. for a high traffic application we need to manage data according user's  interests (friend list, liked pages, follows, etc)"
  },
  {
    "no": 15,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 15,
    "name": "Justin Bobo",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is helpful but I think it can improve considerably by doing the following:-Give students the opportunity to fill in code (or provide quizzes) during the video. Do something like \"before we continue, I'm going to pause the video and have you try to implement this\" or something to that effect. -For the projects/exercises at the end of the sections (by the way, I think every section should have these, not just a select few), source code with the solutions should be provided. It's not very helpful to go through an exercise and not have source code to check against. It's like taking an exam but never knowing what you actually scored.-I don't understand why testing (unit testing and UI testing) doesn't have a dedicated section. It's pretty difficult to build an app that's maintainable without tests, so there really should be a section on it. I would also consider discussing continuous integration during a section on tests as this is critical as well.For the price, I think this is a decent course but the above would make this a much more helpful course."
  },
  {
    "no": 16,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 16,
    "name": "Josh Kaplan",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "TLDR; I learned quite a bit, but Mark's appearances are too few for my liking (about half of the videos), the content itself seems very outdated. And the question section seems void of any instructors. I had fairly high hopes for this course, considering it was recommended quite a bit to me. Right off the bat I would like to say that overall throughout the course I definitely got useful information. The instructors (Mark isn't the only instructor, sadly he's only featured in about half of the content) definitely all know what they are talking about and teaching, and for the most part do an excellent job of explaining themselves and the methods. However these instructors vary with their teaching styles. Some while knowledgeable and explained well, fell short on keeping the content interesting and engaging. Because they vary so much I'll be providing reviews of each of them just in case that matters to anyone.Mark: Excellent instructor, extremely engaging and has a great grasp on what he's teaching for the most part. I like at some points that he does leave in errors that he has and allows us to watch the process to debug. However at points this feel as if it's because he had been to lazy to edit portions of the video, where he could have fixed the bug and explained it saving a lot of time. Jack: To me Jack seemed to have possibly the deepest knowledge of the technical workings of swift. His explanations were great and well delivered. However his pace is extremely slow, and i had to put him on 1.5x about every time, which made him difficult to understand at times with his accent.Jesse: Extremely entertaining to watch, I enjoyed his section very much. However throughout he tends to ramble, at times turning what would be 6 minute videos into 30 minute ones. Johnny B: I believe i enjoyed Johnny the most to be honest. He knew the material, explained clearly. My only issue is that he actually didn't appear enough, if they HAD to substitute Mark, Johnny would be my preferred instructor.All in all, i definitely left this course with a bunch of knowledge. However the course is outdated, a bunch of the videos even clearly just being brought over from his iOS 9 course. Mark also isn't the main instructor for a good portion of the course which is disappointing because he's excellent. It also appears that the question section in terms of instructors is non existent which is disappointing to see."
  },
  {
    "no": 17,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 17,
    "name": "Phillip Grauss",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark and his team are super articulate and knowledgeable about coding.. Definitely happy I've taken this course!"
  },
  {
    "no": 18,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 18,
    "name": "Salvatore Gianluca",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like so much this course!!! diffent teachers show you amazing stuff. that projects you create are not only prototype, you can get inspiration to improve them or create your app in real world with full functionality. the videos are divided in sections so you can absorbe the lessons. Honestly, with little money you get big value learning."
  },
  {
    "no": 19,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 19,
    "name": "Alexis Jimenez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Because it has helped me a lot. I started without any previous background using this programming language and now I am able to create my own apps."
  },
  {
    "no": 20,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 20,
    "name": "Jon Lu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Pretty cool compared with how much I spent for this series of tutorial! Cheers!"
  },
  {
    "no": 21,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 21,
    "name": "Munene Kaumbutho",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "My only grip with Devslopes is the opening and closing music. Mark is a bit crazy and all the other guys seem mostly good. Its a very good course and I would highly recommend this after learning to code for a while.I wish they spent more time on swift basics too but the instructors are very good and they make mistakes openly to show they are human. It is a bit of a steep learning curve (this is coming from a Javascript guy) but one can definitely make apps after this!"
  },
  {
    "no": 22,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 22,
    "name": "Rob Fazio",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I initially gave it 4 stars and was planning on bumping  it up to 4.5 stars BUT, and this is not personal, Jess the English instructor is the reason why I decided to drop it to 3.5. Although he is very knowledgable, his videos take much longer than needed, he is not concise and sometime not easy to understand. I just don't think he is a good teacher. Other than that, I enjoy the course and feel that I am learning a lot."
  },
  {
    "no": 23,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 23,
    "name": "Garrett Rohde",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark and his team offer a practical, hands-on approach to teaching Swift and iOS development.  The immersive approach to teaching allows students to get into real development right from the get-go, which has helped keep me motivated and excited for the next video.  I work in computers and write code everyday, so usually the very *last* thing on my mind when I get home from work is looking at more code, but with DevSlope's iOS/Swift 3 course, I come home and I'm right back on my computer, happily typing away."
  },
  {
    "no": 24,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 24,
    "name": "Marc Khoury",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall a great course made even greater by the community of students, teachers and TA's... the topics are extensive, the apps we create are cool and illustrate some very good concepts.The 2 missing stars are due to some of the latter sections in the beginner section and a couple of the early ones in Intermediate don't explain a lot of info... Certainly recommend the course to anyone who would like to join a growing community of helpful fellow coding students!"
  },
  {
    "no": 25,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 25,
    "name": "Hector Alfonso",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good course. Needs updating in a couple of places like the snapchat clone but definitely worth the time. Have learned quite a bit. Social media app was great!"
  },
  {
    "no": 26,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 26,
    "name": "Kimar Neves",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall pretty good and in depth, but some materials feel rushed and not as well planned as other parts of the course. However, cover a big variety of topics and gives the student a good foundation to make their own apps."
  },
  {
    "no": 27,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 27,
    "name": "Conrado Uraga",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a good course to get your hands wet and I wish they talked more about advanced topics like protocol/reactive programming, threading, etc. It's good for beginners, but might be too easy for developers trying to get into iOS development."
  },
  {
    "no": 28,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 28,
    "name": "Raphaël Reiter",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Some good things, some bad things. Bad things being that as of May 28th 2017, certain videos are still not updated from iOS to iOS 10. This in my opinion, is completely unprofessional. Also, it is very very rare that anyone answers questions in Q&A as well as on the Discord Forum."
  },
  {
    "no": 29,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 29,
    "name": "Cao Yang",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall, this is a very good course for beginners. I learn basic concept here, and now I started to code ios. give it 4.5. some material is out of date and need updates, overall, good job."
  },
  {
    "no": 30,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 30,
    "name": "Aaron Oathout",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very good course. I would have given 5 stars if Mark was doing all of the videos. He is really good at delivering content and keeping you engaged. The other instructors are good, I just felt that Mark made things a little more exciting."
  },
  {
    "no": 31,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 31,
    "name": "Akil Kumar Thota",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome Course. Would definitely recommend it :D love all the videos. All the instructors here are awesome. The best course out there for iOS 10 and swift 3"
  },
  {
    "no": 32,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 32,
    "name": "Michael Coggins",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have now purchased roughly 10 courses on iOS development on Udemy. This group is made up of the best coders and interesting projects the site has to offer.  This set of videos will take you further into coding than anything else that is offered on Udemy and it's not even close.  If you're serious, you should buy this course.  The only drawback is that while they are very talented and the builds are challenging, I wouldn't recommend it as a stand alone to new coders (like myself).  Some elements of coding are second nature to Mark and co and you can get lost quickly if you've never coded before.  But once you take the training wheels off, Udemy has nothing that is as extensive and supported as this series."
  },
  {
    "no": 33,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 33,
    "name": "Joel Groomer",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark's attitude, enthusiasm, and style are great. The course is very conversational and fun. I like that design is taught alongside coding, because that's how apps are built. He does tend to speed through some concepts, but viewing it again usually clears things up."
  },
  {
    "no": 34,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 34,
    "name": "Luca Zarpellon",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a very well done course, but...  I started one year ago with Mark Price's iOS 9 Course, and when this iOS 10 course comes out I bought this too. For non English native language peoples, the iOS 9 course was better because the Mark clear voice, pronunce, perhaps recorded using a professional microphone, made the course very easy to understand and also subtitles worked well. In this iOS 10 course it's not so easy. Many Mark's friend are hard to understand, not only for me, but also for the subtitling system. It's alway a very good course but I can't rate with five starts."
  },
  {
    "no": 35,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 35,
    "name": "Alan Hurtarte",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The videos where Mark is the instructor are great. The problem is all other content where the instructor is not a native english speaker, and is very difficult to understand him or is not very motivated to make the videos and gets boring and to keep up with the content."
  },
  {
    "no": 36,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 36,
    "name": "Lê Dũng",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like the way he teaches, and it's pretty much fun and relaxing for learning how to code iOS. Thanks for all!"
  },
  {
    "no": 37,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 37,
    "name": "Csizmadia János",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Based on the amount of apps we made through this course, I can say this will give you a nice kickstart in iOS development.The only downside is, that there are multiple teachers, and I thought that Mark will teach all these courses. (But in the end I'm satisfied with this setup as well)"
  },
  {
    "no": 38,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 38,
    "name": "Sasha Nodia",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is good, but not great... Switching tutors was not helpful! Not all tutors are equally good at teaching. Different tutors had different styles of teaching, the speed of covering the material, details they pay attention to, etc..."
  },
  {
    "no": 39,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 39,
    "name": "Kacy James",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course, really love the hands on approach and step by step walkthroughs. Loses a star for the unintelligible instructor with the heavy accent, but he only appears twice, so I wouldn't be too worried about it. Absolutely recommend this series."
  },
  {
    "no": 40,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 40,
    "name": "Pranav",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Its an awesome course.Mark, Johny, Caleb you guys are doing a wonderful job.Thanks to this course I got my first Ios developer job within 3 months. The only flaw in this course is Jess.His accent is not understandable at all and subtitles couldn't help either.All in all totally worth taking this course. Cheers Guys..!!Thanks again.!!"
  },
  {
    "no": 41,
    "date": "2016-09-24 04:10:37",
    "fromNow": "9 months ago",
    "user": 41,
    "name": "Arun Narayanan",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a lot of hard work from Mark and his team to put together this extensive course. Quite comprehensive. I'm able to build my own apps going through these videos. Thank you DevSlopes!"
  },
  {
    "no": 42,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 42,
    "name": "Adamode",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good stuffs for the beginners, but you guys never actually explained how the function was created, or how was the function works when it comes to developing the applications. And I was hoping you guys could spend more time explaining on the structures of the application development part. Still I learned a lot until now and can't wait to dive into the next chapter!"
  },
  {
    "no": 43,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 43,
    "name": "Manuel Wandres",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course will get you a detailed overview and deeper understanding about the core functions of Swift and XCode. You will create whole projects, so you can see how real apps are built (inclusive trobleshooting - the videos include the coders \"errors\" and how they resolve them!)."
  },
  {
    "no": 44,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 44,
    "name": "Mathew DeLong",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lessons taught in earlier sections are ignored in later sections. For example, MVC goes out the window while making the weather app (RainyShinyCloudy.) What this means is there aren't practical examples of MVC outside of the original lesson, and instead they train you how to do it the wrong way after that. This is particularly insulting because when showing MVC they say 'if you want a job, do it this way', then for the weather app, which doesn't use MVC, they say to put it in github and add it to your resume.Aside from that, the instructors make a LOT of really thoughtless mistakes. They don't seem to have a firm grasp on layouts or constraints, using trial-and-error and \"hmm, I wonder what this dropdown does\" to get the UI looking the way they want it. I often get the impression they read an online tutorial to learn how to do the topic right before recording the video."
  },
  {
    "no": 45,
    "date": "2017-06-02 04:10:37",
    "fromNow": "22 days ago",
    "user": 45,
    "name": "Gabriela Delgado",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I wanted to wait a while to give this course a review because it gave me a bad first impression. And I still don't like it.  For me it is not an easy course to follow. Because of my work, I have a limited time to study each day. I've being taking it for two months, 45 minutes a day. I like courses that go to the point. Give me the theory and how it's applied to practice. And the main Instructor in this course, Mark Price, likes to ramble a lot. He makes mistakes that \"teaches you how to code in real life\". Sometimes is useful, most of the time I get lost from the main learning objective, 20 minutes later after the mistake is solved, my study window is almost over and the next day I have to go over everything again to remember what he was trying to say. For me that have a little time to study, it's not the ideal course. Now that I paid for it, I'm bound to finish it, because I've learned a lot already. The content of the course is good, but I think it lacks a good Learning Structure. Couple of advices for them: 1) have a teaching expert to check on your methods and 2) please please, don't talk bad about other instructors, it gives you guys a very bad image."
  },
  {
    "no": 46,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 46,
    "name": "Theodore Fields",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good content! Instructor makes concepts easy to understand! I'm looking forward to learning more and becoming a highly skilled mobile app developer!"
  },
  {
    "no": 47,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 47,
    "name": "Pavel Orel",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The more I watch, the less I like it. I think Mark is a pretty good instructor, but others are average at best. The explanations were pretty good in the beginning, but became almost non-existent closer to the middle of the course. I found that I could only watch most of the content on 1.5x speed and for one instructor in particular even 2x was slow (not because they talked slow, but because they gave too much *useless* information).Some of the recordings are also horrible and it's almost impossible to understand what is being said (especially if English isn't your first language and you can't understand people with strong accents very well).The instructors literally never answer. Not on Udemy, not on their Discord chat. In the end, I would only recommend this course to people that absolutely hate reading anything. There are far better options (even for video, Stanford iOS course is MUCH better, but it's also harder). For everyone else, I would recommend to get a good book. Ray Wenderlich is great (read a few myself). Hacking with Swift and Big Nerd Ranch are also good, I've heard. Anyway, once again, it's not a *horrible* course, I don't feel bad for buying it for $15 (as opposed to some other courses). But I would definitely not recommend it to anyone..."
  },
  {
    "no": 48,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 48,
    "name": "Jozemite Apps",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "There are A LOT of things missing from this course that employers will want you to know if you're trying to get hired as one. They rarely embed navigation view controllers, they don't teach core animation or core graphics, they don't use unit testing, they don't use programmatic layouts, they don't even use the MVC pattern in majority of the apps, I don't think they even made a tab bar application, and the core data and Firebase sections are hard to follow or understand. The instructors know what they are doing, but half of them are not good at explaining things. There is A LOT of great stuff in this course, but I wouldn't say it prepares you to be hirable. Mark is probably the best instructor in this course."
  },
  {
    "no": 49,
    "date": "2017-06-01 04:10:37",
    "fromNow": "23 days ago",
    "user": 49,
    "name": "Andre Brown",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Compared with other iOS courses, this one feels more thorough in its coverage of the knowledge and skills needed to be an iOS developer. The instructors keep it real, and they try to explain the concepts behind what they are doing. Best of all, the apps that are developed are professional quality apps. In at least one other course, the apps developed as \"clones\" of existing apps were laughable excuses for apps. They mainly focused on the programming concepts, not on the user interface or user experience. They basically showed you some ideas that were half baked. DevSlopes doesn't do that. Their apps are fully developed and are of professional quality. They cover everything - backend, UI, good software design, best practices, everything needed to develop and actual app, not just some stripped down demo code. I definitely recommend this course over its closest rivals."
  },
  {
    "no": 50,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 50,
    "name": "Gary O Brien",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Based on the student success story i think this course will be of high quality and will be enjoyable. Mark & his team did a amazing job on explaining each section I had alot of fun doing this course. Would recommend this course to anyone who is interested. :)"
  },
  {
    "no": 51,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 51,
    "name": "Meini",
    "rating": 1,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Some good info, amongst hours and hours of unedited, low quality, footage. Very little gets explained properly, and when it gets difficult and any decent teacher would have an opportunity to shine, many teachers struggle or we get told to do our own research. The course is not properly set out and structured and has very low didactic value. And to top it all of, instead of staying in dialogue with the students, we simply hear more excuses. Quantity can never make up for lack of quality."
  },
  {
    "no": 52,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 52,
    "name": "Testgb Balasubramanian",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course. It gives you so much of information, so you can use it all to develop professional apps. I am only at 75% of the course, but I have learnt and loved every lecture. One of the best tutorials I have come across, so far. I would definitely recommend this course for some one looking to get into iOS development, such as me. And such good value for money as well  :-)"
  },
  {
    "no": 53,
    "date": "2017-06-09 04:10:37",
    "fromNow": "15 days ago",
    "user": 53,
    "name": "Gavin Jones",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is my favorite so far on any topic.  Mark is engaging, intelligent, and helpful.  I am 20% through the course and will update my review upon completion, but so far this course has been great.  I find it easy to comprehend each new topic and even the boring stuff I find myself watching while I eat instead of Netflix which is a change for me.  I can not wait to take another course by the same instructor."
  },
  {
    "no": 54,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 54,
    "name": "Patrick Smith",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark and his team do a great job  of showing you more about how to use all of the features of Xcode and Swift. This course is for people who don't just want an introduction to iOS development. It is for people who want to learn how to become programmers and use the tools associated with that career path to their fullest extent."
  },
  {
    "no": 55,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 55,
    "name": "Daniel Legler",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A couple of the demo apps that were not demonstrated by Mark could have been more clear. At times felt like I was watching someone code without enough explanation. Overall this course is excellent and much better than Rob Percival's \"Complete iOS Developer Course\", which I stopped midway through because there were so many gaps in knowledge."
  },
  {
    "no": 56,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 56,
    "name": "Chintan Vaghela",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a really good course with a bunch of great instructors. Specially Mark. I'm only 45% complete and I can already start coding my own iOS Apps. Planning to take up all courses with Mark Price as the instructor. Awesome job devslopes!"
  },
  {
    "no": 57,
    "date": "2017-05-24 04:10:37",
    "fromNow": "a month ago",
    "user": 57,
    "name": "Sean Kennedy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I went into this course with a mish mash of mostly self taught skills.  These videos are excellent for getting up to speed quickly without a lot of wasted time. However, I think this would be very difficult if you had no computer programming skills to begin with."
  },
  {
    "no": 58,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 58,
    "name": "Troy Broas",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course! Still one of the best out there. I bought the iOS 9 course because I love Mark's teaching style. Unfortunately, because he now has a team (and probably a lot less time now that he runs Devslopes) he has other people recording his videos for him. Johnny B does a good job though. I still wish Mark was the instructor for some of the other lessons. Overall, still an awesome course to learn some Swift!"
  },
  {
    "no": 59,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 59,
    "name": "Mofizur Rahman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "For the most part clear, concise and to the point.Deserves a 5 start any time. The student community is great also. Most problems I face are usually already answered or are answered within the day by someone."
  },
  {
    "no": 60,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 60,
    "name": "Casey Hittinger",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Course is superb, and the instructors are extremely knowledgeable on their subjects. On top of that, they have this corny sense of humor that always seems to put a smile on your face. I currently attend SMU, studying Computer Engineering, and cannot help but say this course is equivalent or even better to some of my favorite classes I have had here (learning wise). Although I am only on the social media app right now, I am already debating what devslopes course to take next!"
  },
  {
    "no": 61,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 61,
    "name": "Sean Irvine",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "What a fantastic course, i knew nothing about iOS development before starting this, now I can easily understand and start working on my own ideas with the knowledge i have gained! Thanks Mark and Devslopes!"
  },
  {
    "no": 62,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 62,
    "name": "Billy Pronovost",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course contains really good information. My rating reflects an overall opinion of the course and the \"extras\" that were promoted as selling points for the course. 1 - Beginner Claim > This is not just a knock against DevSlopes, but against virtually all of these SWIFT courses. You can't claim that your course is for beginners and those with no programming experience if you aren't going to teach the fundamentals. By fundamentals I mean more than what a \"var\" or \"bool\" is. I mean teaching people programming. Learning to program is more than just learning what the universal key words are. It is also about learning the foundation of the programming language itself and how to access different things. For example, not once is \"self\" or \"layer\" or \"frame\" described. We are simply told they exist. 2 - Support > Don't waste your time posting comments here on Udemy. You won't get help from the Mark Price nor DevSlopes. Now, to be fair, they promote the use of Discord to provide a community. This is actually great. There is a downside as well. TA's are promoted as being there for help, but that isn't completely true. TA's are mostly inactive. Real support comes from community members. Unfortunately, comments are censored and monitored. Any comments found to critique unfavorably DevSlopes are deleted and people are expelled. Not to mention the countless videos in which Mark rants about how to \"ask for help\" falling back on the claim that they aren't there to actually teach you and you should use Google/Internet (specifically Stack Overflow) for assistance. Well, this is not how the paying for things work. I don't buy a phone from Apple for them to tell me to go search the internet if I have questions. A huge reason I bought this course was because I was LED TO BELIEVE that actual DEVSLOPES help was going to be apart of the deal. NOT THE CASE. 3 - Content > Like I said there is some really good content here. They definitely go into some further explanations about things and they seem to have a better understanding then some on Udemy. But like I also said, they don't really build a strong foundation for those that are true BEGINNERS. You are forced to just follow along and hope that it will make sense. I am sure there is more that I could write but if the Discord experience tells me anything, I am writing this review for no reason because it will be contested.UPDATE - I was just banned by Devslopes for asking questions. Devslopes probably doesn't deserve your money!"
  },
  {
    "no": 63,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 63,
    "name": "Liz Goldston",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great course with a awesome instructors.  Thank you Mark and the gang for all that you helped me and countless others.  Thumbs UP!"
  },
  {
    "no": 64,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 64,
    "name": "Timm Liberty",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Of all the programming courses I've taken, DevSlopes is by far the best. They offer great support and talk in terms that I understand. I especially like the teaching method where they actually are coding live make mistakes and fix them. That helps a great deal in my own coding as it helps my thought process when fixing coding issues. Seeing how they approach a build error or run-time error is a bonus!"
  },
  {
    "no": 65,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 65,
    "name": "Bhaskar Reddy",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Halfway through, I would say Mark is a really good teacher, my only advice would be on your naming convention in some of the lessons, It can confuse people who are new to programming."
  },
  {
    "no": 66,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 66,
    "name": "Ali Khavari",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "HIGHLY RECOMMENDED!!!  They care and love what they are doing. Thanks guys. I was a beginner!  Even though  I'm in middle of the course and not finish yet, going to start my own project next week,"
  },
  {
    "no": 67,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 67,
    "name": "Henry Goodwin",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The courses content is of a high standard and is good for a person learning how to develop, however the course seems rushed as almost all the videos are not up to date with Swift 3 as it teaches beta code. When i purchased this course i expected to learn from Mark Price like his other courses but instead i got numerous different teachers who simply don't provide the same experience as Mark with his skill and knowledge as well as their ability to explain topics. This makes for a uneven and un-polished teaching experience. I expected better for from this course."
  },
  {
    "no": 68,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 68,
    "name": "David Thorp",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "very good well structured helping me out a lot with coding an ui design as well well worth the time and money thanks Devslopes"
  },
  {
    "no": 69,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 69,
    "name": "Trentxy Tuedon",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am so hyped on learning this course. The success story, the free apps, and the fact you actually teach objective C that's really incredible, it's all really quite amazing. Am already an intermediate Swift developer but something just dragged me to this course like some sort of gravitational pull. And I know this isn't  a waste of my time. No Knowledge is worthless. Really excited to be part of your students."
  },
  {
    "no": 70,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 70,
    "name": "Laura Calinoiu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has a really good content. It is really valuable. Thanks Devslopes and it's great that I've found a really big community on your site."
  },
  {
    "no": 71,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 71,
    "name": "Juan Francisco Dorado Torres",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Dude i have been fan of Mark, til today i got the whole courses that he already has, and trying to complete them, i am glad of these courses, of course talking about Devslopes, but the way that his partners teach is not as funny as the Mark's way. Anyway it is an amazing content"
  },
  {
    "no": 72,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 72,
    "name": "Bill Ly",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Able to follow along well. Course outline is simple and easy to navigate to the subject I want to review again."
  },
  {
    "no": 73,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 73,
    "name": "Josh Apgar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course.  The instructors respond in a timely manner to questions and are very helpful."
  },
  {
    "no": 74,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 74,
    "name": "Ammar Saad Dine",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good for mid iOS developers, but amazing for beginners. Th instructors try to cover all the concepts plus the popular tools every iOS developer should know about."
  },
  {
    "no": 75,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 75,
    "name": "Louis Dalligos",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great course and I love Mark, Jess and Johnny B style of teaching. It's easy to understand and they provide tips and tricks which I thought is really helpful. Really love this course!"
  },
  {
    "no": 76,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 76,
    "name": "Tihomir Videnov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am leaving my comment here after the full completion of the course and I can honestly say that it is the best iOS/Swift one currently available on the internet. The best thing is that Mark and his team are real life coders and you can feel/see it throughout the lessons. The community that Mark has build is awesome and the whole feeling to be part of such group of dedicated people is very nice. If you are wondering to buy it or not - just do it, you will not regret it."
  },
  {
    "no": 77,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 77,
    "name": "Jovy Ong",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I would've left a 5 star rating if it were Mark and JonnyB that taught all of the sections in this course. The other instructors are pretty much mediocre in where they sometimes are clueless. Also, the instructor in charge of teaching the Social Network app was just too hard to understand as he speaks in an accent. It also doesn't help that the mic/voice quality in his videos are poor where it just makes it almost impossible to understand him."
  },
  {
    "no": 78,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 78,
    "name": "Tyler Brady",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm learning a ton.  This course is becoming a huge confidence boost for me.  Mark is my favorite, he has a lot of great energy which helps you stay involved and focused."
  },
  {
    "no": 79,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 79,
    "name": "Samuel Drouin",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Most information on swift and Xcode is accurate. Instructor are good and explain the subject very well in most part. I do strongly recommend this course. However, I an disappointed by the fact that this course is using 3rd party program like Alamofire. I wish that instructor showed us both the swift way and the 3rd party program way so that we could decide winch method we prefer. Also, I wish that structured programming concept where more heavily used through the course."
  },
  {
    "no": 80,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 80,
    "name": "Levente Máthé",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good course, 4 stars because it's missing some things:- navigation view, tab view- common design patternsMaybe make an advanced iOS course? :)"
  },
  {
    "no": 81,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 81,
    "name": "Reed M",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I was an engineer on the Xcode team at Apple and I spent weeks helping countless confused students who took this course. You are not going to become a paid developer by taking this course (not unless you already have a decent amount of development experience). There are far too many technical mistakes and bad practices.The Devslopes team is not going to help you in their chatroom. I worked with dozens of students who never received a single response from the Devslopes team."
  },
  {
    "no": 82,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 82,
    "name": "Roberto Montesinos",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It starts off pretty simple but the teacher makes it fun with his great attitude. I love the instructor's energy and pleasant demeanors. However, I love getting through the material quickly - I think it would be widely appreciated if some of the run-on commentary was edited out prior to releasing - a minute here and a minute there spread out over a couple of hundred videos adds up on the audience end. Food for thought if you like."
  },
  {
    "no": 83,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 83,
    "name": "Sergey Kudryavtsev",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best money investnment I have ever made."
  },
  {
    "no": 84,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 84,
    "name": "Miguel Aquino",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think it would have been best if it was specified that you need to have a paid Apple Developer Account in order to complete a few videos from this course, also I prefer the videos with Mark Price, he is clear and adds more detail to what you are going to do and why. A few videos have poor audio quality."
  },
  {
    "no": 85,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 85,
    "name": "Rami Mithalouni",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have registered in this course for the snapchat clone, but the lectures for it is cut off and never completed. They said months ago that they will upload the rest parts but they never did!!"
  },
  {
    "no": 86,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 86,
    "name": "Horst Glatt",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course, because the explanations use simple words and convincing examples. The Optionals course is remarkable. Thank you."
  },
  {
    "no": 87,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 87,
    "name": "Taylor Kruse Collins",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a good course, optimistic guy. In some lectures he will use terms and certain development methodologies without giving context or explanation of what they are or what they do. He also doesn't use very good variable names, so once you get into complex lectures that are more complex programming, he'll just make up variable names that aren't very descriptive, and won't give you a reason of why or what they do - so you're left very confused. I think this is just because he's a good developer and he knows what's going on (but we don't), so he doesn't need to be descriptive or explain in some situations what is happening. That is my only concern with the course, and it's frustrating in some lectures. That hasn't stopped me from keeping on going in his class. He DOES explain some very valuable information that I don't think you would get anywhere else without a lot of research."
  },
  {
    "no": 88,
    "date": "2017-06-08 04:10:37",
    "fromNow": "16 days ago",
    "user": 88,
    "name": "Alan Curtis",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "awesome course have not finished it yet but I'm learning so much I can't wait to finish and run through the boot camp really get into it and hopefully make a business out of it. I would like to say a big thanks to everyone at dev slopes you guys are freaking amazing so a big thanks from W.A thanks"
  },
  {
    "no": 89,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 89,
    "name": "Kevin Wheeler",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good so far. I am a huge fan of the concept of updated information such as the video updates to match the changes in Xcode and Swift.  I've tried a few books only to find out that there was no errata sheet and no current update.  Mark keeps his course up to date. Muy importante."
  },
  {
    "no": 90,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 90,
    "name": "Dave Clissold",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's just awesome. The instructors take their time to go through every element they are teaching, they also show you mistakes and how they fix them, rather than being perfect.  The exercises and downloadable material are perfect for practising on your own or as in my case using to highlight errors with my own project which I'm building as I go along with this course."
  },
  {
    "no": 91,
    "date": "2017-06-15 04:10:37",
    "fromNow": "9 days ago",
    "user": 91,
    "name": "James Stafford-Coyte",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far so good. I am using this course along with Stanford's CS193p iOS 10 course. The Stanford Course goes into more detail about what is going on underneath the hood and pairs well with this course. This course is more practical and hands on."
  },
  {
    "no": 92,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 92,
    "name": "Furkan Tazegüllü",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Some of the videos are outdated. I follow the instructions one by one but sometimes it just not works as the videos shown. I appreciate the update videos though. Other thing i didn' t like was Mike' s irrelevant talks. My time is precious, so is yours. Why waste it with nonsense talks? The course has its downsides of course but i do recommend it. Its worth every dime."
  },
  {
    "no": 93,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 93,
    "name": "Kovan Aziz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "thanks for such a great course, nearly a prefect course for learning iOS programming in Swift3."
  },
  {
    "no": 94,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 94,
    "name": "Tina Akinyelure",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course! not even halfway through and i've learnt to much. Mark is an excellent trainer and I find the content very engaging and challenging which i love..."
  },
  {
    "no": 95,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 95,
    "name": "William Friend",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent Course. The instructors are easy to understand and the content is easy to follow along. Great work Dev Slope team!!!!!!!"
  },
  {
    "no": 96,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 96,
    "name": "Ali Ihsan URAL",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Bad pronuntiation for Firebase chapter!..."
  },
  {
    "no": 97,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 97,
    "name": "Junior iOS Developer Submariner100 Chapman",
    "rating": 0.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I will leave an review if I manage to finish this section???"
  },
  {
    "no": 98,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 98,
    "name": "Alain Piriou",
    "rating": 1,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I gave up on the Core data section. The lesson 74 can not be reproduce on XCode not beta versions, and there is no support from the Devslope team. Friendly students gave some tricks to keep going on, but those are just tricks. And this is the main trouble in this course : we received tricks, nothing fundamental. We learn to imitate, but we don't really understand how it actually works.Now I'm following the Itunes U \"Developing iOS 10Apps with Swift\" from Stanford University. That is something ! We learn how it really works, step by step, even if it's sometimes difficult (especially for non-English native language). Ok, we sometimes need to pause a lesson, to listen it a second time, there is a lot of homework to do, lots of reading assignments, but no pain, no gain ! And the presentations are very high quality. And all for free."
  },
  {
    "no": 99,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 99,
    "name": "Rafal Manka",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Loved the course. I think it's perfect."
  },
  {
    "no": 100,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 100,
    "name": "Mr Hitender Thejaswi",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far, its been really smooth ( Touch Wood ). Thanks Mark. The 3 stars are because I knew the concepts taught till now so it was easy for me to move ahead. Will change the ratings when lessons of unknown concepts are being explained. In that way I will be more honest with my rating about how good the teaching really is.May 8th 2017 : Just increased the rating by 1 star ( from 3 to 4 ) After finishing the Pokedex App by Jonny B, At this point., I feel very confident about my learning development and Jonny's explanation and the way he took us through the App was fantastic !"
  },
  {
    "no": 101,
    "date": "2017-06-04 04:10:37",
    "fromNow": "20 days ago",
    "user": 101,
    "name": "Russell Fischer",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm about 50 lessons in and am really enjoying this course so far. Mark gives clear explanations and gives a good mix of code and \"theory\". Expect to spend about one hour of time programming for each hour of video lecture."
  },
  {
    "no": 102,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 102,
    "name": "Naresh Konga",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "From day 1 I am very much happy with the course. long story short, each and every individual video are awesome + I am happy with my purchase. Thanks to all respected Gurus + Instructor + Udemy."
  },
  {
    "no": 103,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 103,
    "name": "Alberto Pascual",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is given my several teachers, some of them are really good and others just excellents, You will not only learn, you will enjoy !! some modules are five stars, but in general i will give 4 stars!"
  },
  {
    "no": 104,
    "date": "2017-06-09 04:10:37",
    "fromNow": "15 days ago",
    "user": 104,
    "name": "Hiếu Nguyễn Quang",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course pace is a little bit slow and quite many unneccessary minutes to throw away.Hope to have more update and please go straight to the point in each lecture."
  },
  {
    "no": 105,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 105,
    "name": "Dmitry Marchikhin",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is good that you should build interesting apps but sometimes this code is bad with bicycles and crutches"
  },
  {
    "no": 106,
    "date": "2017-03-24 04:10:37",
    "fromNow": "3 months ago",
    "user": 106,
    "name": "Al Fatah Kader",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Course is truly designed for self-paced learners who are getting into iOS development from a non-coding career. Course begins with basic foundation coding lessons on first couple of sections and dives into building apps; so you get applied experience and appreciate what you are learning. Instructor understands that self-learners don't have enough time and suggests that we re-watch videos multiple times. This is key to understanding materials - first time I watch a lesson episode to familiarize the content, second time to follow along to focus on key content, and third time to test my knowledge. I like the fact that I can put my learning on hold when I need to and then go back to watch the videos fast forwarding to key points and immediately get a refresher to pick up from where I left off. If you are looking to learn iOS development, this is truly the best!"
  },
  {
    "no": 107,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 107,
    "name": "Tan Alam",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "New instructor Jess who teaches the Social networking app has a very very thick accent and it is very hard to understand him. He obviously tries very hard, but he seems very unprepared and makes the videos way too long for no reason.  I took iOS 9 course with Mark and it was way better."
  },
  {
    "no": 108,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 108,
    "name": "Hudson Pereira",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I just want to thank you. I love your content, it's perfectly balanced with both motivational and realistic. Fantastic how you don't edit the common mistakes people run into, it's so helpful. And the challenges  you pick to implement are awesome and real world's."
  },
  {
    "no": 109,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 109,
    "name": "Ahmed T Khalil",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall, I think that the information is useful and I would recommend the course to others since it is very complete in that sense. However, I don't like the fact that 75% of each video is the instructor fumbling around to get the code to work. I understand that debugging is a part of coding, but it makes it more difficult to learn the material this way."
  },
  {
    "no": 110,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 110,
    "name": "Darius Turner",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Its great to have this course because you can always look back and they always explain everything well. Especially when it comes down to publishing your app."
  },
  {
    "no": 111,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 111,
    "name": "Ernest Delgado",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark is really good at teaching. Ive learned so much in just 50 videos, and looking forward to the other 150"
  },
  {
    "no": 112,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 112,
    "name": "Chris Morgan",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "When I started this course, the first few lessons were great.  Then the original instructor started letting other instructors teach.  First was Johnny, who is obviously very knowledgeable about IOS development, but didn't thoroughly explain what he was doing.  Then came a guy with a thick southern accent, also knowledgable, and he was pretty good, but annoyed at having three different instructors so far... Then I made it to the next and fourth instructor appeared this time with a thick english accent.  This instructor rambles on over nothing taking a video that should be about 10 minutes and turning it into about 40 minutes.  I figured maybe that was just his first video, but it seems to be every video he makes, he just goes on and on about nothing useful.  Mark instructs that it will be up to the students to go out and research the code in this course, but provides no background on how to even interpret the apple documentation, so I really don't get the point of paying for this course, when I spend a good amount of time on google just trying to figure out an explanation of what they are doing.  If the original instructor made all of the videos in this course I would have given it a 5 star rating, but this course loses continuity with all of the different instructors, and the guy with a thick British accent is hard to understand especially when you have to put the video on 2X just to get through his rambling.  I really wanted to learn Firebase and IOs development and how to work them together, but this isn't the right option."
  },
  {
    "no": 113,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 113,
    "name": "Gil Moscovici",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "clear and easy to follow, with insight to best practices that other places do not teach. Though requires some researching on your own for more clarification, but that is programming in general."
  },
  {
    "no": 114,
    "date": "2017-06-16 04:10:37",
    "fromNow": "8 days ago",
    "user": 114,
    "name": "Alejandro Leguízamo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've learned more from these videos than from reading two books on iOS development. I expect I will be looking back at them in the future for reference. My only negative feedback is that the instructors speak and go through the steps very fast (I'm assuming since they're so familiar with coding). Sometimes it's hard to catch up and it gets frustrating to have to keep pausing and playing the video in order to catch everything they're doing."
  },
  {
    "no": 115,
    "date": "2016-09-24 04:10:37",
    "fromNow": "9 months ago",
    "user": 115,
    "name": "Beau Galbraith",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "You can't go wrong with this one. It is as good as any other iOS tutorials and even slightly better in my opinion. The one thing devslopes does that others don't do is provide the best practices. Other tutorials do show you how to accomplish things on your own but devslopes shows you how a potential employer would expect you to do it, which does make a difference in the long run. I do like that there are multiple instructors, however, I don't enjoy them all equally. Inevitably some are better than others. Therefore not completely 5 stars but probably your best investment for learning to develop apps with swift.-Beau"
  },
  {
    "no": 116,
    "date": "2016-08-24 04:10:37",
    "fromNow": "10 months ago",
    "user": 116,
    "name": "PAUL DeFilippi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am 70 percent through the iOS 9 Course taught by Mark and it is great.  I am sure this one will be as well.  I am rating this course a 5 based on the graphics alone which are included in the download package.  High quality as I am sure the rest of the course will be."
  },
  {
    "no": 117,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 117,
    "name": "Norberto Munoz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark is a great teacher, and so far it covers everything needed to be a good programmer, not only Xcode or swift, but also configuration management, shortcuts, mindset of a developer, etc. Great training."
  },
  {
    "no": 118,
    "date": "2016-10-24 04:10:37",
    "fromNow": "8 months ago",
    "user": 118,
    "name": "Peer Rheinboldt",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Nice Instructors and cool Projects. The way Swift, Obj-C and Sketch get explained are really good."
  },
  {
    "no": 119,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 119,
    "name": "Brian Lee",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Love the instructors - very thorough. Fantastic course thus far. I've tried a few other Swift courses and things are finally beginning to stick using this one! Highly recommended."
  },
  {
    "no": 120,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 120,
    "name": "Alan Cravey",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Course is great, just as the other reviews state. The only critique I have is pretty simple- At the end of explaining or typing something, don't scroll away or change screens.  It only gives us about a second to see the last thing you typed before you scroll or change screens. Minor, but it would help save time having to rewind and pause at exactly the right time."
  },
  {
    "no": 121,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 121,
    "name": "Allan Jones",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am not a complete beginner in Xcode or Swift, but I certainly am not proficient at either.  I have learned a lot and generally like the way the course is organized and presented.  My biggest complaint is that nobody knowledgeable seems to review the questions on a regular basis.  I am currently \"stuck\" and waiting for a response to my question before I can proceed with the course."
  },
  {
    "no": 122,
    "date": "2016-06-24 04:10:37",
    "fromNow": "a year ago",
    "user": 122,
    "name": "Jason Stiesi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is my second tour through this course I have already left a five start review during the first time around."
  },
  {
    "no": 123,
    "date": "2017-02-24 04:10:37",
    "fromNow": "4 months ago",
    "user": 123,
    "name": "Nicholas Jacob",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have taken a few tuts on UDEMY and by far Mark and his team at Devslopes are the best. They have a great way of telling you why something works other than just coding and blowing it off. They are also easy to understand unlike some other instructors on here"
  },
  {
    "no": 124,
    "date": "2016-09-24 04:10:37",
    "fromNow": "9 months ago",
    "user": 124,
    "name": "Jeremy Turney",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like the way Mark Price and his team have this class structured. It is very informative and has a ton of great information. Everything you'll learn you will be able to apply to your own apps and not think twice about how to do it. Like other classes who teach you how to build apps but not exactly the purpose as to why they do what they do. Mark informs you of why you things are the way they are so that you understand every part of the process. A great class! Highly recommend!"
  },
  {
    "no": 125,
    "date": "2017-06-05 04:10:37",
    "fromNow": "19 days ago",
    "user": 125,
    "name": "Timmy Ma Kwan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Only on Lecture video 50, but so far it's been amazing and I'm learning a lot. Highly recommended (: If you want to learn the iOS Foundational."
  },
  {
    "no": 126,
    "date": "2016-11-24 04:10:37",
    "fromNow": "7 months ago",
    "user": 126,
    "name": "Paul",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best course I've seen so far for iOS development. Has Swift & Objective -C content which is great. Thorough explanations"
  },
  {
    "no": 127,
    "date": "2016-12-24 04:10:37",
    "fromNow": "6 months ago",
    "user": 127,
    "name": "Jack Hamilton",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I haven't come close to the end of learning everything this course has to offer and it's been over a month since I've had it. This course covers things I hadn't thought of in my own research of iOS development and provides detailed help for self teaching. I super appreciate the time and energy that had been put into the course, and am excited to see where the next few months takes my studies. Thank you Devslopes and all parties involved, it has been quite fun watching real time programming. I would recommend this course to anyone who is seriously thinking of exploring this side of the object oriented programming.I still have a lot of question, and have not found myself able to finish my own personal project, but this course certainly was a great buy, and even if it doesn't provide me all the answers and know how I need. The instructors teach methods of self trouble shooting that I have found vastly useful. again totes worth it. I have not found better instruction in my 2 years researching iOS development."
  },
  {
    "no": 128,
    "date": "2017-01-24 04:10:37",
    "fromNow": "5 months ago",
    "user": 128,
    "name": "Geoffrey",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've tried learning iOS dev a few years ago, before swift and size classes, and the videos WERE JUST A DRAG to get through; and were long (30 min about) so I just hated doing it. There also wasn't much hands on, no community, no commenting on each video to help each other out. The course cost 1200$.This is different. I think Mark is aware that <20min is the most people can intensively learn at a bout, and each lesson is simple, distilled, and focused. I am convicted that anyone who can make it through this can be a successful iOS developer.REAL TALK: I only do 1 or 2 lessons every 2 or 3 days. That means I only do 3 to 5 lessons a week. Ive calculated how long it will take me to do the course, and it comes out to ~ 6 months.6 months and you will get paid well doing something fun.Going forward, since the industry changes so fluidly, I will continue to learn from devslopes as my go-to course for learning skills in programming. The coverage of design, namely ui stuff, is included in the course. Im am going to be honest when I tell you that there are better places to learn ui design. But I am giving this course 5 stars because the purpose of the course is learning ios 10, and Mark just throws in the sketch (which is the best design application to be learning for web and mobile design btw) as a bonus."
  },
  {
    "no": 129,
    "date": "2017-04-24 04:10:37",
    "fromNow": "2 months ago",
    "user": 129,
    "name": "Mohammad Ashour",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Mark is an incredible instructor. Engaging, experienced, and thorough enough to make sure you know when you're doing. Excellent course."
  }
]