[
  {
    "no": 0,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 1,
    "name": "Gunes Radd",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "As good as it can be, without getting into too much detail, which would of course be really hard to do for each of the apps listed(Instagram, Uber, Twitter etc) in the curriculum. On that note, I would really like to have one of those big apps developed (some of it obviously not fully), instead of practicing the basics of those listed. Good start course overall."
  },
  {
    "no": 1,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 2,
    "name": "OsamaSany",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The best thing about this course was it covered everything and taught us different methods to use everything they taught us. Its definitely a 5 star course.Thanks Mr.Percival for this course."
  },
  {
    "no": 2,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 3,
    "name": "Jaleel Jolly",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great projects, I've learned a lot. There's something for everyone in this course from beginners to intermediate Android developers who want to take their skills to the next level. I'm sure even veteran Android developers can learn a thing or two from this course. Rob teaches new concepts and technologies (Parse Server, GDX, etc) in such a way that you can easily apply them to your own apps."
  },
  {
    "no": 3,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 4,
    "name": "Michael O'Connell",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Realy enjoyed this course and now have a better understanding of app development and programming.  The lecures were clear and easy to follow."
  },
  {
    "no": 4,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 5,
    "name": "Panagiotis Anastasiadis",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor is good and is also responsive to questions. However this course does not teach best practices on android and covers so little in terms of design, which is really important. Also the apps like Uber clone and Instagram are just a very simplified clone of the apps and not even close to be at production level. My suggestion is that a beginner in android should really be taught best practices from day 1 and not some coding that just works. The second star I give is just because I liked the teaching style of Rob."
  },
  {
    "no": 5,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 6,
    "name": "Andrew Rees",
    "rating": 1.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Except for suggesting Parse and a need for best practices for android and Java, this is a great overview, but really needs a serious update as much of the code doesn't work now."
  },
  {
    "no": 6,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 7,
    "name": "Alkesh Thakor",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is good for beginners and for one to two years experiences. This course content is not fit right for the experienced developer who has more than two years. As per the course Title \"Complete Android N Developer Course\" there are no any advance topics of Android N. Please add all advanced features of Lolipop,  Marshmallow, and Nougat."
  },
  {
    "no": 7,
    "date": "2016-11-24 04:12:24",
    "fromNow": "7 months ago",
    "user": 8,
    "name": "Steve Keddy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great course with practical examples that inspires both experimentation and extra learning. An overview of the methodology of the course layout as well as some introductory programming structure would be helpful for those of us who haven't done any high level programming in quite some time. I found myself moving ahead of my readiness in the videos to grab an essence of the big picture. I use two laptops when working on the material. My original laptop to watch the videos and the rocket I had to purchase to actually run the emulator.  I have business applications that I want to start working on and this course is a perfect solution for me. I will be able to develop functional and practical business solutions as well as an ability to convey ideas to those that will later manage them. Great Course !"
  },
  {
    "no": 8,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 9,
    "name": "David Griffiths",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent style and teaching technique so far. Keeping fingers crossed that it lasts.Apparently I'm at the halfway mark so I can report that the quality of the teaching has not declined and I'm still enjoying the content."
  },
  {
    "no": 9,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 10,
    "name": "Argin Aslanian",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course was absolutely the best thing that ever happened to me. Learned literally everything I needed in android app developing. Looking forward to take other courses from professor Rob Percival. A special thanks to him as well for making this course. Wish I could've given more than 5 STARS! Thank you!"
  },
  {
    "no": 10,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 11,
    "name": "Ibrahima SECK",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Parce que il y a une bonne pédagogie dans l'ensemblec'est clair et concis. Toujours aussi clair Nous apprenons et progressons jour aprés jour"
  },
  {
    "no": 11,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 12,
    "name": "Bipul Kumar Lohia",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very good course. The info provided is in-depth and practical methods explained are really helpful. Plus those 5 clone apps are really good to learn and understand the working of real apps in a better way."
  },
  {
    "no": 12,
    "date": "2017-05-30 04:12:24",
    "fromNow": "25 days ago",
    "user": 13,
    "name": "Marwan Al-Jemeli",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great course. the instructor is very very good. there are lots of good details being covered. I would to ask the instructor if it is possible to add a specific multithreading lecture. the current types of data presented are texts, sounds and images which are all well but to add audio streaming and video streaming and add multithreads in the background would enhance (At least in my opinion) the knowledge of multithreading. overall, Awesome course I love it. I have worked with android and java before but never been well versed with. This might change now.One more thing. I would like the instructor to add activity life cycle examples. I believe this is important since i have finished section 6 and there were no examples for them at all.Augmented reality and VR or examples would also be great addition to the course"
  },
  {
    "no": 13,
    "date": "2017-06-01 04:12:24",
    "fromNow": "23 days ago",
    "user": 14,
    "name": "Software Developer Okagbare Vakpo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great tutorial and careful slide through each chapter. I really like the way Rob delineates every fact. He is really good."
  },
  {
    "no": 14,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 15,
    "name": "Carminati Alberto",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Not a complete beginner in coding so initially I felt some tasks were repetitive but that can be a plus if you want to commit procedures to memory. Those \"snippets\" of coding began to make sense when tasks like \"code this entire app\" were given, leaving one to research new things without an already planned iter.If you are up to these tasks, you'll find the course really satisfying!If not? Well, there is really all you need to know in the video you just paused.I'll stop at four stars only beacause I've only covered about half of the course, and the section about publiching and marketing could be of some weight, seeing how I choose this for that reason too."
  },
  {
    "no": 15,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 16,
    "name": "Usama Khurshid Zafar",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm a senior android developer already but this course has been a huge help in revising all the basics and making the android knowledge foundation even stronger. Nonetheless, this instructor is very clear and precise in his instruction and this course, overall, has been very well designed to take you from basics of java to advanced features of the latest Android platforms.One thing that takes away the 0.5 rating is that the clones are not actually clones, rather only mimics of the basic functionalities of these famous apps.Overall, I'm very satisfied"
  },
  {
    "no": 16,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 17,
    "name": "Prakhar Bindal",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is amazing I am learning a lot of new and great things.i specially like the number of apps we get to learn in each section. I give new ideas and experience.i have cut half a star just because I think somewhere detailed concepts in some things are missing"
  },
  {
    "no": 17,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 18,
    "name": "Mark Sjurseth",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So far so good. Only small criticism at this point would be that the IDE is out of date in video so there is some small acclamation there. No big deal.UPDATE: halfway through the course.  I am still happy with Rob's methods and learning/re-learning quite a bit with each application we build.  There is some repetition but I think it's beneficial."
  },
  {
    "no": 18,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 19,
    "name": "Adam Jahangiri",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Java fundamentals taught too lateWould also be valuable to explain why some things work - i.e. why does an onClickListener work , what is its deeper workings, rather than skirting over these issues and just taking them as \"the way things just are\". It builds up a superficial knowledge of how something works, and your then just relying on memory to implement code"
  },
  {
    "no": 19,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 20,
    "name": "Naji Krayem",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Rob's style of teaching is great, I learned a skill that I had problems with before, which is research and finding answers. I would have given a 5 star but Rob doesn't go in details and only gives you the bare minimum information."
  },
  {
    "no": 20,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 21,
    "name": "Sai Chandra Sekhar Dandu",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's decent but to claim it's a comprehensive android tutorial is rather foolish considering very important feature in android like Fragments has barely been touched"
  },
  {
    "no": 21,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 22,
    "name": "Matheus De Melo Ribeiro",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course teaches a lot even for people that already have some experience in Android development. Besides, even though I'm Brazilian, he speaks so clearly that I could understand each word he said."
  },
  {
    "no": 22,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 23,
    "name": "Joseph Stanton",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am an intermediate Android developer. Normally, I just learn and leave but the teach method by Rob Percival is too good to just leave without a review.I really hope that he keeps coming out with new content for people like us to learn!Great job!"
  },
  {
    "no": 23,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 24,
    "name": "Bogdan Mituca",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like the course overall so far but it's a little bit annoying to not understand all the code you write. Maybe course should begin with java details and after that go into Android Studio."
  },
  {
    "no": 24,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 25,
    "name": "STUDENT Srinivasa Rao Makkena",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like the way instructor teaches everything clearly with coding and with good challenges. Thank you very much for the valuable course on Android."
  },
  {
    "no": 25,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 26,
    "name": "Ahmed Zubair",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Has to be the best course I have ever taken in my life. That includes stuff I did in college and online. I am excited to come back here and learn something new every day. One of my favorite part is the introduction Rob gives. Look at that big smily face. How can you not want to dive into the course. Haha! Either way I think I made a smart choice by enrolling into this course."
  },
  {
    "no": 26,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 27,
    "name": "Alexandru Stroia",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Rob is awesome! :D Great explaination, wish I had my teachers at my college this!"
  },
  {
    "no": 27,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 28,
    "name": "Eido",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is my second course with Rob. I'll get straight down to the pros and cons.Pros:1) Concise lectures about the subject matter. Clear and relevant explanations by Rob.2) Responsiveness to questions. Your question will usually get answered in a few hours.3) Project based - You will get to do a lot in this course and will learn a lot as well. Challenges (mostly fun) are presented through the course. You will have plenty to show your friends and few really nice ones to your interviewer.  A lot of hands on experience.4) It's a fast paced course which it's underlining theme is to get you with the knowledge to build and design apps as quickly as possible. The cons :1) This is not a course if you want to learn OOP. I come from the Java world, and the Java part is very basic. It seems no \"Best Android Design Patterns\" will be taught here but I am only half way - so We'll see. If I have to call the design Rob uses in most of his solutions, I will call it - something between \"Quick and dirty\" and \"Quick and elegant\". Usually it's not that scalable since he only wants to illustrate concepts - which is ok. Again, this course wants to set you up running in the least amount of time. 2) Here and there, there are very minor mistakes in the lectures (such as in the audio section - where Rob blames the emulator performance where in fact the code isn't right. Another example is the \"Brain Trainer\" app where you can still play after the game is over). This Course is at least a few months old - I would expect these small errors to be corrected. So, to sum things up:Even though the course is not perfect, It seems it does give you the skills and probably more than that at building apps. I am expecting small errors to be addressed as time goes by. When you look at the Cost vs. Value equation - you really get a lot (I bought it on sale).It is a good primer and good reference to go by to, as you make your way in your Mobile development skill quest. But if you really want to know the in depth of things - maybe this course will not satisfy you. Just remember though - That knowing something theoretically in depth does come with a time penalty which you should decide whether or not to invest in to.There is a positive energy conveyed in this course - It seems the instructor really wants you to have value and to know the skills and tricks of the game. The videos' and audios' quality are pristine and the explanations are very comprehensible.  If you are in a hurry to develop your app - It seems like the right place to start. You can do the projects or simply watch Rob solving it if you are in a rush - Having done about one half of the course and by looking at the content - It seems to me you will get the skills necessary for today's market. I definitely can see how it will serve me."
  },
  {
    "no": 28,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 29,
    "name": "Huy Mai",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course! Although Rob did make some small mistakes when it came to apply the knowledge in Windows environment (since he made almost all of the lessons on his Macbook), he did a wonderful job explaining everything important in Android app development."
  },
  {
    "no": 29,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 30,
    "name": "Leslie Emptage",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Incredible! It presents in a relaxed and easily followed style many of the methods that I needed to port my existing code from Windows to Android. I am not new to programming but I am not an expert, my software activities have involved writing the occasional program using VB6 on Windows. The transition to Android has been a bit painful until I discovered this course. My first App is well on the road to being a reality and all the lessons have worked for me. Thanks very much Rob!"
  },
  {
    "no": 30,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 31,
    "name": "Charles Ireland",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "so far, so good, clear explanationsAll of the content seems valuable, and gives the impression that I will really be able to put my new knowledge to use.I've gotten a great deal of practical learning out of comparing my own attempts to implement the sample apps with the more efficient, \"best practice\" detailed in the video.I do highly recommend using two displays if possible. Flipping between Android Studio, the instructional video, and an emulated device gets a bit clunky on a single display such as on a laptop."
  },
  {
    "no": 31,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 32,
    "name": "Love Bhardwaj",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A very good course, if you are new to android programming. Rob takes you through the fundamentals and reinforces them through different apps, which use similar concepts. This not only makes it easy to understand the concepts but also makes you revise it. I would request him to launch a advance course which takes a step further and uses classes in depth which are not profoundly used in this course and other android advanced features such as fragments. Once again I would highly recommend this course to anyone new to android programming."
  },
  {
    "no": 32,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 33,
    "name": "Otto van Verseveld",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Nice examples and good references to external information on the web!Some examples need rework or testing since the downloadable solutions do not always work out of the box. Device rotation should be blocked (or discussed) since a lot of screens do not look properly.Robs enthusiasm is a pleasure to watch and invites to try more."
  },
  {
    "no": 33,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 34,
    "name": "Barton Reggie",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear speech! Great! Easy to follow, not to much info in each session."
  },
  {
    "no": 34,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 35,
    "name": "Avais Shahbaz",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is good for beginners and to learn Java but as it gets to the advanced stages, the quality becomes poorer."
  },
  {
    "no": 35,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 36,
    "name": "Vlad Iliescu",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So when i first started this course, i was quite happy with it. It starts really well with the introduction to java/android but then somewhere halfway it starts to fall short.From the very basic thing, of not writing your code mostly in the same java class, to not explaining what fragments, services, loaders, activity lifecycle, observer pattern, call back interfaces and so on. All things that are absolutely needed if you want to develop a proper app from scratch. All these things i found out on my own, so while the course made me curios how to further develop my app, its title \"complete\" is far from the truth.  I wouldn't recommend it, unless you get it for a discount price."
  },
  {
    "no": 36,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 37,
    "name": "Ashfaqul Islam Tonmoy",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Rob is the Best Instructor ever!!And his All videos is perfect.But the other hand #Marc_Stock for promote app marketing videos is not perfect as well. His sound quality is not good!!"
  },
  {
    "no": 37,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 38,
    "name": "Laurent Fouetillou",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Bonne méthode pédagogique et bien expliqué!Petit reproche: certaines choses auraient pu etre mises dans un meilleur ordre (exemple: le gridLayout aurait put etre introduit avant l'application \"Connect3\""
  },
  {
    "no": 38,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 39,
    "name": "Russell Davis",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thanks for the putting this android development course together. It is very comprehensive and easy to follow along. Rob is a great presenter of the information and easy to understand. The audio and video quality were also really well done. I really liked learning about the how to use external services like Parse and Firebase, as well as pulling information from APIs and using it in our app. Tons of information, but I never felt overwhelmed. Thanks, Rob! Keep up the good work. Can't wait to get my apps out to the store!"
  },
  {
    "no": 39,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 40,
    "name": "Daniel Nguyen",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Easy to follow, excellent for beginners. But better have some possible errors suggestions."
  },
  {
    "no": 40,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 41,
    "name": "Dmytro Maksutov",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I encounter some lack of advanced and even intermediate topics, so there is only four."
  },
  {
    "no": 41,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 42,
    "name": "Robert Brown",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I felt that it covered most of what is needed for beginners to hit the ground running. However, a few things bothered me like some cases of code that could be compacted and the comparison of strings using boolean operators rather than the built in method for .equals()."
  },
  {
    "no": 42,
    "date": "2017-06-22 04:12:24",
    "fromNow": "2 days ago",
    "user": 43,
    "name": "Ilya Novikau",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is not for people who have some programming experience. You will learn only basic concepts and at the same time miss few very important of them. For example, the course doesn't give information about application's life cycle, multiple activities and intents and responsive interfaces. Essentially, this course is just a set of the tutorials. I recommend to not waste money and just search some beginner tutorials in the Internet."
  },
  {
    "no": 43,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 44,
    "name": "Shishir Ghosh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was really simplified and the instructor went through everything step by step. Great instructor!"
  },
  {
    "no": 44,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 45,
    "name": "Chunyingyen Yan",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Courses are easy to understand the way of implement, still on my way to complete it."
  },
  {
    "no": 45,
    "date": "2017-06-05 04:12:24",
    "fromNow": "19 days ago",
    "user": 46,
    "name": "Umaima Khurshid Ahmad",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "its my first experience that I'm taking a course like this. This course has given me so much to learn and develop from. I never thought I would find Android Development so easy and interesting! Thank you udemy & Thankyou Rob!"
  },
  {
    "no": 46,
    "date": "2017-06-13 04:12:24",
    "fromNow": "11 days ago",
    "user": 47,
    "name": "shia H",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I always learned coding and development using books, and to be honest i have never understood anything so clearly as rob is explaining it, thanks rob!! awesome job!!"
  },
  {
    "no": 47,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 48,
    "name": "RAPOLU SURYA TEJA",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really informative course. Gives me the information I need. It could use a little updating though!"
  },
  {
    "no": 48,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 49,
    "name": "Benjamin Kershner",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Rob Percival is very thorough.  His lessons have excellent pacing and realistic but challenging assignments."
  },
  {
    "no": 49,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 50,
    "name": "Nyoman Abiwinanda",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think rob is the best android teacher I've found in udemy so far. He talk and teach at just the right pace so a beginner like me could get the most out of this course. Great Job!"
  },
  {
    "no": 50,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 51,
    "name": "Jfangrad",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great quality teaching! Starts right from the beginning of how to program so it would be really easy to take this course even with no prior programming experience. Everything is explained very clearly and Rob doesn't assume that the student knows anything which is great! Overall great course!"
  },
  {
    "no": 51,
    "date": "2017-06-01 04:12:24",
    "fromNow": "23 days ago",
    "user": 52,
    "name": "Adam Sweeney",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good Audio, Well Constructed, A little bit dated, but it doesn't affect things too much."
  },
  {
    "no": 52,
    "date": "2017-05-24 04:12:24",
    "fromNow": "a month ago",
    "user": 53,
    "name": "Loo Jia Wei",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think this course is good. It's a very extensive course from Rob which covers lots and lots of things. I think this is the only course that really worth the money since it provides free services such as web hosting lol! But I learn java before from college, and I think the style of code Rob practising is slightly not so recommended~ The code definitely allows you to do your apps in as fast as possible but not as practical as possible."
  },
  {
    "no": 53,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 54,
    "name": "Hussamali",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Because Rob is great instructor i hope he will do more courses for as"
  },
  {
    "no": 54,
    "date": "2016-10-24 04:12:24",
    "fromNow": "8 months ago",
    "user": 55,
    "name": "Gabriel wilson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I appreciate the thoroughness and pace of the lectures and the mini-challenges within each lecture. Very Well done!"
  },
  {
    "no": 55,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 56,
    "name": "Aykut Karaca",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I learned a lot in short time. I wish there is advanced course on android too."
  },
  {
    "no": 56,
    "date": "2017-06-20 04:12:24",
    "fromNow": "4 days ago",
    "user": 57,
    "name": "Chris Baty",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course: well researched, thought-thruogh and supported.  The only suggestion that I would have is to be more relaxed during your video introductions and  demonstrate the  project(s) on a real phone."
  },
  {
    "no": 57,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 58,
    "name": "Technical  Solutions",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "High quality course, deep content, some sections are difficult to follow, due to the complexity of Android itself"
  },
  {
    "no": 58,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 59,
    "name": "Isaac Benito",
    "rating": 1.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is far from a complete course, it teaches many concepts but doesn't go deep into any, it seems more like a union of a lot of basic mini-courses. There are a lot of important concepts like fragments, services, loaders, the activity lifecycle,... that are not even mentioned."
  },
  {
    "no": 59,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 60,
    "name": "Dylan Wheeler",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course for someone that is familiar with coding in other languages as well as a beginner. It could use updating for the latest Android Studio as a tiny bit of the code is depreciated in the newest version."
  },
  {
    "no": 60,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 61,
    "name": "Helder de Melo Mendes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is most complete Android course I've seen on the web, as it covers the big majority of the topics needed to make an app. It is well separated in small fragments of knowledge, so that you can understand step by step the parts integrated in your app. Also, Rob sets some goals and challenges as he encourages you to pause the videos and do it yourself before he solves them. This helps a lot, cause I believe in the learning by doing concept, as Confucius once said, \"What I hear, I forget. What I see, I remember. But what I do, I understand\". Besides, this course has examples of clones of professional apps like Instagram and Uber, and this really can help you in the journey of making a great professional app."
  },
  {
    "no": 61,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 62,
    "name": "Neil Currie",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm getting a lot out of this course.  It's really good, explains everything really well.  I only didn't give it full 5 stars because since the concept of Object Orientated Programming using classes was dealt with, it wasn't referred to or enforced.  Otherwise,  really good, highly recommend."
  },
  {
    "no": 62,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 63,
    "name": "Веляев Денис",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Очень полезный курс. Рекомендую перед началом его прохождения всё же немного почитать что-то по Java, т.к. она проходится здесь достаточно обзорно. Нашёл для себя очень много полезного и безумно благодарен автору курса!"
  },
  {
    "no": 63,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 64,
    "name": "Dylan Velez",
    "rating": 2.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Even though the course is titled as the complete android development course, it felt as it was just a kind of novice course and it lacks some depth in its contents. Maybe I'm biased because I already have some experience with software development in general."
  },
  {
    "no": 64,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 65,
    "name": "Jamille Abushash",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Fun and informative course, everything you need to know to start making android apps!!"
  },
  {
    "no": 65,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 66,
    "name": "Pratyush Sharma",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Instructor is very good and engaging. Really appreciate his efforts :)"
  },
  {
    "no": 66,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 67,
    "name": "Shubham Singh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Covers a great deal of content thoroughly and efficiently with several fun apps along the way."
  },
  {
    "no": 67,
    "date": "2016-11-24 04:12:24",
    "fromNow": "7 months ago",
    "user": 68,
    "name": "Rodolfo Kohei Soken",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Well elaborated examples and small fixation exercises makes an enjoyable learning experience. At the end of each section, there is a challenge to summarize all the knowledge acquired in a very simple and functional app."
  },
  {
    "no": 68,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 69,
    "name": "Alan Kolic",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent examples and applications made during the whole course. The pace of the course is really well timed and the assignments challenge you just enough. Once you complete the assignment on your own or with some help from Rob you feel accomplished and pleased with your work. Managed to land a job with the knowledge that I got from this course for which I am more than grateful."
  },
  {
    "no": 69,
    "date": "2017-06-15 04:12:24",
    "fromNow": "9 days ago",
    "user": 70,
    "name": "Amal Shajan",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the best course on Udemy for android development. But it is little bit outdated now. I have trouble creating layout in android studio 2.2. But other stuffs are still relevant."
  },
  {
    "no": 70,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 71,
    "name": "Krit",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is outstanding!!I am basically through with the entire coding course, except for the managerial parts. It is really good! I would now really like to join Rob's iOS and WebDevelopment courses, just because he is such a terrific teacher!"
  },
  {
    "no": 71,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 72,
    "name": "Benjamin Gerhold",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Goes into great detail and with good explanations on how to write Android apps.  Coming from iOS development using this course has been particularly helpful."
  },
  {
    "no": 72,
    "date": "2016-10-24 04:12:24",
    "fromNow": "8 months ago",
    "user": 73,
    "name": "Helena Franczak",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Rob's courses are very good!However, for the complete beginner, it is very difficult. I am not able to complete challenges in this course. Also, I tried to build my own , easy app but I was unable to do so without following any instructions. It seems like I can create apps but only if I follow someone else."
  },
  {
    "no": 73,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 74,
    "name": "Shreyansh Nanavati",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Absolutely worth, amazing content to be honest i am on the 4 lesson and i already have an app ready for publishing on the play store.Thanks Rob you are one of the best tutor. :)"
  },
  {
    "no": 74,
    "date": "2017-06-05 04:12:24",
    "fromNow": "19 days ago",
    "user": 75,
    "name": "Abdullah Khan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Its a great course. Thanks to rob percival for such a great course"
  },
  {
    "no": 75,
    "date": "2017-03-24 04:12:24",
    "fromNow": "3 months ago",
    "user": 76,
    "name": "Lj Yeoh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is a good beginner course bit it jumps straight away to Java instead of learning more about XML. The course will jump here and there(XML and Java). Some courses teaches you XML then continue with Java, this course is different."
  },
  {
    "no": 76,
    "date": "2016-12-24 04:12:24",
    "fromNow": "6 months ago",
    "user": 77,
    "name": "Hector Mendoza",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "So easy to follow! I look forward to the coming lectures! I feel so pumped!!!"
  },
  {
    "no": 77,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 78,
    "name": "Scott Winterbourne",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor covers a lot of the basics and foundation of Android development very well.  He goes step by step and has you work through practical examples.  He also help you to be able to look up information and solve problems on your own.  After giving you some guidance and some time to try it on your own, he shows you step by step how he solved it and where he found the information.  A great learning experience."
  },
  {
    "no": 78,
    "date": "2017-01-24 04:12:24",
    "fromNow": "5 months ago",
    "user": 79,
    "name": "Slobodan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Till now (passed 32%) the course is great. Everything is clear and I smoothly follow along the videos, all the code is nicely running and the explications are clear and precise. The community of students following the course is asking good questions, and what's even more important responding to other's doubts.I might have given a 4star at the begining of the course when I realized i.e. that the tic toe game wasn't neatly coded till the end and nicely playable, but later on I realized that it's not such a big deal compared to the rest.Even though the course is marketed as it can fitted to complete beginners, I can't agree. Anyhow it's nice that all along the course we repeat identical bits of code so we strengthen our basis with every new video.I paid $10 for the course and those are the best 10 bucks invested in 2017 by far!I suggest fellow students to watch the video on 1.25 speed if you're a fast typer and already know the basic Java concepts!Cheers from Belgrade,Slo"
  },
  {
    "no": 79,
    "date": "2017-04-24 04:12:24",
    "fromNow": "2 months ago",
    "user": 80,
    "name": "Barry Robinson",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Coming from an engineering background in C/C++, with some experience developing Android in eclipse, finding the right course was problematic. If your looking to build apps quickly then this course will probably fulfil your requirements. The instructor's engaging, and most importantly pushes strongly the requirements to be able to research and solve problems, something that all good developers should be able to do. The approach is to get right down to it and explain as the course progresses, which for people looking for a more technical structured explanation of the Android Development ecosystem might not be so appealing. I would strongly urge anyone who's thinking about developing in Android [whether they intend taking this course or not] to first go to udacity.com and take the developer.android.com introduction to Android Development course that will give you a much better understanding of an app's lifecycle, architecture, and take you through the creation of a weather app, as well as toy apps to demonstrate certain features of the SDK and current best practice in Android Development.This is still a good course, particularly for someone who's never programmed before, and might find descriptions of software stacks and protocols off putting, but this is something everyone who works in development will need to understand at some point."
  },
  {
    "no": 80,
    "date": "2017-02-24 04:12:24",
    "fromNow": "4 months ago",
    "user": 0,
    "name": "Rob Percival",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Vlad Iliescu",
    "content": "Thanks for the feedback Vlad. The aim of this course is to get engage students by getting involved from the start with building apps explaining theories alongside the practicals to and provide students a firm foundation. Although the concepts you have mentioned are important, they're not essential to building apps and can be learned by students after they have picked up the fundamentals from this course.  You have made some good points though which I have taken onboard and may consider for a future course!"
  },
  {
    "no": 81,
    "date": "2017-06-03 04:12:24",
    "fromNow": "21 days ago",
    "user": 0,
    "name": "Rob Percival",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Dylan Velez",
    "content": "Thanks for the feedback Dylan. The intention of this course is to provide a firm foundation covering the fundamentals in android app development and with that knowledge. I do try to cover subjects in an easy to understand way for those who have never done coding before so I can appreciate it can seem slow if you have some coding background. Projects do get more advanced as students progress through the course."
  }
]