[
  {
    "no": 0,
    "date": "2017-06-21 04:18:03",
    "fromNow": "3 days ago",
    "user": 1,
    "name": "Ying Ye",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is my first Udemy course and I love it! Very informative and useful in every dimension. Chris is a passionate presenter and I had a good time watching it. Thank you so much and I highly recommend this course to anyone who would be interested in the overall life-cycle of companies from start-up to mature :)"
  },
  {
    "no": 1,
    "date": "2017-06-16 04:18:03",
    "fromNow": "8 days ago",
    "user": 2,
    "name": "Zakariye Abdirahman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A course which is  relevant to real life  , very informative  and best teacher in world , as matter of fact  i can ask no more than this chris haroun God bless you zakariye from somalia"
  },
  {
    "no": 2,
    "date": "2017-06-13 04:18:03",
    "fromNow": "11 days ago",
    "user": 3,
    "name": "Kaisar Butin",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Calculations, management frameworks, forecasting are very superficial.But, there is some useful content.Thank you."
  },
  {
    "no": 3,
    "date": "2017-06-10 04:18:03",
    "fromNow": "14 days ago",
    "user": 4,
    "name": "Akshat Singhal",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This one of those things that you should do whether you have a MBA degree or not. The course is not just about teaching you what they teach you in business schools but also about finding and making your own paths in life. Very Motivating and extremely beautifully designed course"
  },
  {
    "no": 4,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 5,
    "name": "Robbie Rizel",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great if you want to start a tech startup, less relevant if you want to open a restaurant (but still insighful).Chris keeps it short and informative, feels like he only sticks to the \"must know\" parts.There are a few boring parts, but if I made it through - so can you."
  },
  {
    "no": 5,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 6,
    "name": "Valerie Turner",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Outstanding!  This course will help take me to the top.  Professor Haroun is a knowledgeable and effective teacher.  I actually felt his passion and got teary-eyed when I finished the course.Sincerely,Valerie"
  },
  {
    "no": 6,
    "date": "2017-01-24 04:18:03",
    "fromNow": "5 months ago",
    "user": 7,
    "name": "Rich Baker",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It has been an awesome 2 months!  I have learned a ton from this course that i can happily say i am putting to good use. My Linkedin account has been setup and has already had positive results. My advisory board has 4 members. 1-5 year business model ready to go and my first meeting is scheduled next week for raising cash!Chris ranks up there as one of the best teachers I've had with great lectures backed up by a great textbook. I will be looking for more course content from ChrisCheersRich"
  },
  {
    "no": 7,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 8,
    "name": "Sam Wan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The bottom line is getting better.... its becoming practically real; I just applied the principle of Asking. I got rid pride asked for a little bit of aid, and I got it. Please don't ask me what it is.I feel lighter after completing this course. The load of Internet resources are unbelievably louder. Right now I am thinking beyond me. Thank you Chris."
  },
  {
    "no": 8,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 9,
    "name": "Manuel Aguilar Fernández",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "My life, career, goals did not have any direction until this course.This course gave me a complete overview in how the companies work. Now, I know in what section I would like to focus on. I am really really grateful for this opportunity. Thanks a lot Chris."
  },
  {
    "no": 9,
    "date": "2017-06-11 04:18:03",
    "fromNow": "13 days ago",
    "user": 10,
    "name": "Sergios Lalas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Pleasurable, Informative, Inspiring!As a side note,  the title may be a bit misleading, since it is really hard to cover all the detail of a full MBA in just one online course, but for sure it is a great overview for people who do not have an MBA or a comprehensive refresher for those who do have one. In overall, really good material for a very good price. Thank you Chris!"
  },
  {
    "no": 10,
    "date": "2017-05-30 04:18:03",
    "fromNow": "25 days ago",
    "user": 11,
    "name": "Christopher Green",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I learned a lot from this course but more importantly it has increased my confidence and motivation to accomplish my goals."
  },
  {
    "no": 11,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 12,
    "name": "Vlad Nemtsov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "5 stars course =  G R E A T course!  Dear Prof. Haroun, thank you very much for creating this course. I liked your approach of explaining topics like Venture Capital, Startups, 10k-ies, Enterprise Life-cycles in such a simple and enthralling way! I have learnt a lot! It was a great start for exploring more of the Innovation sector which I am interested in.  Appreciate a lot!  Spasibo!!!"
  },
  {
    "no": 12,
    "date": "2017-06-17 04:18:03",
    "fromNow": "7 days ago",
    "user": 13,
    "name": "Daniel Filipe Alfaiate Branco",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I think this course is very well made and structured, Chris does an awesome job getting the teory going and backing it up with solid examples, using various resources which add so much value to this course.He teaches you, not just the steps you need to take from having an ideia until achieve that ideia but also teaches you how to improve yourself.I could go on here but, less is more, very well made, recommend it"
  },
  {
    "no": 13,
    "date": "2017-06-19 04:18:03",
    "fromNow": "5 days ago",
    "user": 14,
    "name": "George-Alexander Balafoutis",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I decided to take this course just after completing a top 50 MBA to conclude my knowledge. Even though it's not an entire MBA in a day as it offers about 15% of a real MBA, I believe it is works wonders combined with an MBA as it brings in real life scenarios especially in tech which is my industry. I recommend this course for both MBA graduates and  for aspiring MBAs as they can find out if the MBA curriculum really fits them."
  },
  {
    "no": 14,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 15,
    "name": "Geetansh Arora",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Well balanced course from Chris.Provides a good introduction to various topics in finance and management."
  },
  {
    "no": 15,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 16,
    "name": "J.J. Ho | Ficlubi Se",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thx so much, very practical and just in time I am practising your teaching and content in a project I am working on!   Ready to dive in more now.  I feeling more motivated now!"
  },
  {
    "no": 16,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 17,
    "name": "Uli Groenbeck",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Chris did a great job in covering the key elements of a companies life cycle. His presentation style is refreshing, inspirational and motivating. Thanks"
  },
  {
    "no": 17,
    "date": "2017-06-07 04:18:03",
    "fromNow": "17 days ago",
    "user": 18,
    "name": "Innam Shibly",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very comprehensive course, only negatives is that it's skewed towards the tech industry and at time covered very basic. Overall highly recommend this as a MBA/guide to business type course, the presenter is very engaging as well"
  },
  {
    "no": 18,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 19,
    "name": "Amy Chen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "To students: This is a very engaging and motivating speaker. You will not only learn practical material (in an interesting way) but also this course imbues a sense of optimism in you.To Chris:Chris, you are naturally gifted in connecting with your students and your delivery is so powerful, that it changes my views on life.Thank you for sharing your invaluable experience and wealth of knowledge. It is a course that may change the course of life.Sincerely,Amy"
  },
  {
    "no": 19,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 20,
    "name": "Mustafa Sadiq",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Professor Haroun goes through various topics relevant to the course at reasonable speed, explains things thoroughly and in a way that's easy to grasp, especially when he relates to real-world examples and to his own career/experience. Overall, a great deal of things to learn and enjoy while doing so!"
  },
  {
    "no": 20,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 21,
    "name": "Adam Boardman",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A solid course with some great takeaways but not life changing and a lot of opinions that were a bit wishy washy for my taste. Definitely still recommend to others!"
  },
  {
    "no": 21,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 22,
    "name": "Abdul Wahid Askari",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I enjoyed the course , and learned many things from , i do recommend the course (which i have to my friends Already) and its worth your money for sure."
  },
  {
    "no": 22,
    "date": "2017-06-11 04:18:03",
    "fromNow": "13 days ago",
    "user": 23,
    "name": "Sunil Garg",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like the practical approach used in the course. Tips which will actually help me in my life."
  },
  {
    "no": 23,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 24,
    "name": "Dale Youngman",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good content on finance, startups and tech companies. The title is somewhat misleading as this course is not about operations or marketing or HR. Bias towards tech companies and VC financing. Chris is easy to understand and does take you through a companies life cycle, especially as it relates to finance and business organization."
  },
  {
    "no": 24,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 25,
    "name": "Colton Smith",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Loved this course. Covered a lot of ground in minimal time. I also really like the sections that work less on the technical and more on the attitude of the individual. The only thing I would add are harder questions to help reinforce what was taught."
  },
  {
    "no": 25,
    "date": "2017-02-24 04:18:03",
    "fromNow": "4 months ago",
    "user": 26,
    "name": "Pete Boyce",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I thought it was a great course .  The MBA book that ways acquired with the courses was super . Thought it was terrific to watch the videos and be able to view the same information in the book ."
  },
  {
    "no": 26,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 27,
    "name": "Yayra Mensah Dumenu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is singlehandedly the most usefully captivating course I have ever enrolled in. Lessons for business and life in general. Very grateful Prof for the opportunity to be impacted with this knowledge."
  },
  {
    "no": 27,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 28,
    "name": "Joseph Harmsworth",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great content and very inspirational! The teacher breaks down the course in a very easy and fun way. I would highly recomend this!"
  },
  {
    "no": 28,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 29,
    "name": "Miriam Mukasa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Chris Haroun is an amazing teacher.  As an entrepreneur running two tech startups, starting an MBA is currently out of the question however, this course more than met my expections in terms of  giving an overview on: technical, financial, business, soft skills and more. Everything is covered in bite size and I now move on to Chris's other courses covering financial modelling etc. Thank you Chris. I look forward to updating you about our progress in the near future. Best wishes, Miriam"
  },
  {
    "no": 29,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 30,
    "name": "Azher Rashid",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Chris is very passionate about the course and its content.I loved the overall course,the only reason why i am giving a 4.5 rating is because i wanted a more in depth analysis in terms of valuations,forecasting and modeling etc,which i felt was a bit rushed.I hope Chris when he updates the course can add more content interms of understanding these concepts better and also he can add the excel sheets that he is using.Other than that a wonderful course,i hope to take more of his courses in the future."
  },
  {
    "no": 30,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 31,
    "name": "Claren",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am absolutely bleon away with by this course. Thank you so much for sharing your knowledge. The instructional layout was spot on!"
  },
  {
    "no": 31,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 32,
    "name": "Liviu Andreescu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Amazing information delivered with a positive attitude and the right structure. I feel like I have learned a lot.Thank you, Prof. Haroun!"
  },
  {
    "no": 32,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 33,
    "name": "Akarshan Gulhane",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm recently Engineering Graduate and I like to know more about Business related concept.  As an Amateur in Business, I learned a lot."
  },
  {
    "no": 33,
    "date": "2017-05-30 04:18:03",
    "fromNow": "25 days ago",
    "user": 34,
    "name": "John Marcus",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course has a great content , However I think it is more towards building a startup than an MBA course as many topics are not covered here, I also suggest to cover the course over more time so we can have more information not just walking through the topics."
  },
  {
    "no": 34,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 35,
    "name": "Andrea Laiena",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very high value and very practical. Networking tips helped me land a job today, and for sure what I learned will help me further at the time of starting my own business.Also professor Chris is so available brilliant and supportive!"
  },
  {
    "no": 35,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 36,
    "name": "Bolaji Azeez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was a great course and I learned so much. I would recommend this to anyone trying to enhance their knowledge in the business world. Thank you so much Chris"
  },
  {
    "no": 36,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 37,
    "name": "Sultan  Ali",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "One of the best business oriented courses i have taken, probably the only mini MBA i would recommend anyone to participate in its classes, the professor deliver the different subjects and ideas in interesting and easy to understand way."
  },
  {
    "no": 37,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 38,
    "name": "Michael Basa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The best course ive ever attended in my life both online and in seminars. Without this course, i wouldn't even have the courage to quit my job and start my own business. Aside from learning new skills, i also gain a new perspective about life and it changed my mentality about making money, value of family, networking, working and professional career.For a topic that was supposed to be dry, the whole course was crazy fun even at the parts with heavy numbers. Chris' way of teaching was both entertaining and funny (especially the hilarious video links at the additional resources section).Thank you so much for taking the effort to provide high quality answer to all your students' questions. The MBA books you provided helped me understand better after i finish each video. You're the best :)"
  },
  {
    "no": 38,
    "date": "2017-06-05 04:18:03",
    "fromNow": "19 days ago",
    "user": 39,
    "name": "Furkan Kılıçaslan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Chris is a very engaging and friendly teacher with comprehensive experience and knowledge in what he teaches.I gained a strong overview of business, enterpreunership and finance in this course.Although if you are expecting any of these to be delivered in great detail this is not the correct place.There is only one downside I can think of which is the sloppy presentation slides.I am sure Chris could have prepared better slides for this course."
  },
  {
    "no": 39,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 40,
    "name": "Tara Johnston",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "He makes the course easy to understand.I really look forward to the lectures. I was very impressed with Chris,his lecturing style and the subject matter. I will be taking more of his courses. Thank you Chris for an awesome experience !!!!"
  },
  {
    "no": 40,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 41,
    "name": "Nuthan Prasanna",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Loved the way how Prof. Haroun teaches. He lives the quote \"Choose a job you love, and you will never have to work a day in your life.\". He teaches tough topics in an understandable and passionate way. From now, he's on my list of inspirational people."
  },
  {
    "no": 41,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 42,
    "name": "Ian Lang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thanks, Chris! This course gives great insight into the world of business but ultimately teaches you how to be a better human being. Very informative short lectures, with plenty of witty comments. Look forward to implementing this course content into my new business. Do yourself a favor and sign up for this course!"
  },
  {
    "no": 42,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 43,
    "name": "Anise Pertl",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Cuts through all the jargon and gets strait to the point.  Chris is able to breakdown fundamentals into bite sized chunks that keep you engaged and interested."
  },
  {
    "no": 43,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 44,
    "name": "Michael Horsfall",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was presented well and hit the mark with key themes & re-inforcement,  information and breaking down relevant company life cycle information, great tool to bring other key personnel up to speed with a sound understanding of what it takes to launch a successful business"
  },
  {
    "no": 44,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 45,
    "name": "Kebede Alemu Tegegn",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "That enforce me to expect a lot, do you know why? Sometimes, I'm afraid when there is a little bit more promotion.  I know it very well, it's a spicy for Art - without it (exaggeration) Art will become not acceptable but when we come to 'Business', we will see...  I wrote the above at the beginning ...My review after I completed this course is here it's:This is not only a lecture by scholar but also a preach made by baby-face secular..."
  },
  {
    "no": 45,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 46,
    "name": "Hindrick Diorico",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. I love the fact that the course is more practical than it is theoretical. I can actually apply what I've learned when I start my own tech company :-) Chris is very knowledgeable and inspiring. He makes me want to keep learning and achieve more in life and in business. A fellow Torontonian, he's funny and very engaging. Highly recommend!"
  },
  {
    "no": 46,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 47,
    "name": "Flavio Jorge Siquice Mbanze",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is well presented and easy to engage. I really enjoyed. Thank you Chris for this knowledge transfer"
  },
  {
    "no": 47,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 48,
    "name": "Sławomir Leśniewski",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It lets all my previous knowledge and self-education areas to be combined with my long business formal education, but on the higher level. Why?  - because I am so far a self-employed entrepreneuer, with passion to learn - but I work long time earning some money for constructing business plans, financial sheets for investment bank debts and UE funds applications for microcompanies of my area (smalltown in Poland, surrounded by lots of villages). As I see the syllabus of the course (comparing to the courses I have checked before - i.e. best MBA in Poland costs $15 thousands for 2 years - of slow-motion studying and travelling within my country, at the same time no good e-learning sets ) - and as I like the course content with added such easy way of communication - I will joyfully gather all my past skills and business abilities to work as a business multi-tool :) - I`m a half way through and it goes as I assumed. :) Opened mind, opened heart, little smile, multitasking eyes and hands, some pen and sheets of paper with a little assistance of Internet :) - that`s my favourite workshop :) So... - finally I have managed to achieve my goal! :) Two parts were little bit difficult for me, so I needed to concentrate and focus on the topic, what made me enthusiastic to search for more in my own language and check out for resources in Poland. Thanks a lot! I have made a big mind map of the course, so I can have all the process and knowledge possible to look at in just one eye-shot - with some little moves  of course ;)"
  },
  {
    "no": 48,
    "date": "2017-02-24 04:18:03",
    "fromNow": "4 months ago",
    "user": 49,
    "name": "Group Human Resources Manager Kay Kamatuwa Chirwa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Yes! am now very appreciative of the practical life lessons in the course and they shall surely make a great difference in the way I apply myself and use the knowledge to make that difference."
  },
  {
    "no": 49,
    "date": "2017-02-24 04:18:03",
    "fromNow": "4 months ago",
    "user": 50,
    "name": "Steven Vermeire",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course to fill in some gabs in my knowledge.Called it a practical \"MBA\" purely focussed on VC investor activities - useful for both entrepreneurs and investors.The Q&A feedback is second to none."
  },
  {
    "no": 50,
    "date": "2017-02-24 04:18:03",
    "fromNow": "4 months ago",
    "user": 51,
    "name": "Dipanshu Jain",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Chris has done a phenomenal job in capturing the most practical aspects of business and success. A highly recommended course for anyone looking for a crash course in learning/revising key attributes that matter in life for success."
  },
  {
    "no": 51,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 52,
    "name": "Whittington Vara",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a very good MBA survey course. You can tell Chris enjoys cutting through the theory to provide a practical understanding of business fundamentals."
  },
  {
    "no": 52,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 53,
    "name": "Jamie Coenen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The teacher is very clear in his ways of explaining.The lessons are interesting and fun to watch, the information isn't dull as I thought it would be.I just finished the course, and I couldn't be more grateful for all the things Chris gave me.Thank you very much!!!!"
  },
  {
    "no": 53,
    "date": "2017-02-24 04:18:03",
    "fromNow": "4 months ago",
    "user": 54,
    "name": "Edie Tacang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Everything was perfect , very clear to understand, the presentation was awesome, most likely I got a diploma from a prominent university, this course was the best so far every thing I need to know is here. prof. Chris my fellow Canadian  I'm proud"
  },
  {
    "no": 54,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 55,
    "name": "Don Wyper",
    "rating": 1,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I got this for $10 and it was overpriced. This is basically kindergarten MBA. Everything is extremely high level and nothing is actionable. I would suggest people buy some used MBA books on ebay instead of this"
  },
  {
    "no": 55,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 56,
    "name": "Marisa Stokes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Chris already gave me a book I need to save up to buy and Venture Capital firm names I never heard of, but need to research.  He already taught me something in the first 15mins.  Amazing!  I am so excited for what there is to learn next.  Halfway through the course I learned information that will help me launch a start-up doing it the right way armed with the correct financial knowledge.  I always look forward to each lesson, just starving for more and more knowledge each time.  The only thing that would make this course better is if Chris partners with companies that officially recognize this course as a hiring factor when coupled with a 4-yr college degree or higher."
  },
  {
    "no": 56,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 57,
    "name": "LeeAnn Potochney",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a very insightful course for a non-business person. Chris explains things well from the start up of a company through its life cycle. He explains that he has a passion for tech, so it is focused more on that, but the business concepts can definitely transfer to other industries."
  },
  {
    "no": 57,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 58,
    "name": "Zachary Fletcher",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was an excellent course. This was a very useful investment in myself and my future. Not only was this course full of useful and targeted information, the instructor was and is extremly helpful and patient. This course is absolutely worth every penny."
  },
  {
    "no": 58,
    "date": "2017-01-24 04:18:03",
    "fromNow": "5 months ago",
    "user": 59,
    "name": "Jin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Love how passionate and inspiring Chris is and appreciate how selfishness he is imparting the knowledge he has to students!"
  },
  {
    "no": 59,
    "date": "2017-05-24 04:18:03",
    "fromNow": "a month ago",
    "user": 60,
    "name": "Joshua Hardy",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I love this course. I feel like I've learned so much. I will begin putting what I have learned to use immediately."
  },
  {
    "no": 60,
    "date": "2017-06-10 04:18:03",
    "fromNow": "14 days ago",
    "user": 0,
    "name": "Chris Haroun",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Akshat Singhal",
    "content": "Many thanks Akshat!"
  },
  {
    "no": 61,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 0,
    "name": "Chris Haroun",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Valerie Turner",
    "content": "Thanks a lot Valerie!"
  },
  {
    "no": 62,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 0,
    "name": "Chris Haroun",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Rich Baker",
    "content": "Thanks a lot Rich!"
  },
  {
    "no": 63,
    "date": "2017-03-24 04:18:03",
    "fromNow": "3 months ago",
    "user": 0,
    "name": "Chris Haroun",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Michael Basa",
    "content": "Thanks a lot Michael!"
  },
  {
    "no": 64,
    "date": "2017-04-24 04:18:03",
    "fromNow": "2 months ago",
    "user": 0,
    "name": "Chris Haroun",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Don Wyper",
    "content": "Don many thanks for the feedback. The topics taught in this course are the same topics that I teach at business schools and the same topics that I was taught during my MBA. The difference is that I added much more practical concepts that students can immediately apply instead of theory. The practical concepts taught in the course are based on the companies I have founded, my work experience in finance at Goldman, my work experience in venture capital and at hedge funds and based on my work experience in consulting at Accenture. Please let me know what additional topics you think I should add to the course that are not covered in the course. Thanks again, Chris"
  },
  {
    "no": 65,
    "date": "2017-06-10 04:18:03",
    "fromNow": "14 days ago",
    "user": 0,
    "name": "Chris Haroun",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Marisa Stokes",
    "content": "Wow; Marisa thank you so much for this!"
  }
]