[
  {
    "no": 0,
    "date": "2017-06-23 04:31:15",
    "fromNow": "a day ago",
    "user": 1,
    "name": "Edwin Tan",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I liked the course as it's quite structured for person with basic to intermediate general marketing knowledge. The digital portion may be difficult if a person doesn't have basic knowledge on the various digital platforms out there.I felt that the lectures could do better with Powerpoint slides rather than highlighting with the cursor. It would also be more complete if Instagram and LinkedIn can be included in the course.Overall, a good course to get a basic to intermediate understanding of marketing on the various digital platforms."
  },
  {
    "no": 1,
    "date": "2017-06-14 04:31:15",
    "fromNow": "10 days ago",
    "user": 2,
    "name": "Kelebogile Mrwashu",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Love and enjoyed the course content so far.I have learned so much and I will definitely use the skills to develop my own blog and website. I will definitely take more course that will increase my knowledge.Thank you."
  },
  {
    "no": 2,
    "date": "2017-05-24 04:31:15",
    "fromNow": "a month ago",
    "user": 3,
    "name": "Ajinkya Rasal",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Daragh has done an exceptional job in creating templates which can be used by the students. However, some insights on paid marketing on Facebook and Twitter would have helped more."
  },
  {
    "no": 3,
    "date": "2017-04-24 04:31:15",
    "fromNow": "2 months ago",
    "user": 4,
    "name": "Jerry Wong",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great Courses! Well structured and very comprehensive. A lot of practical advises and I will use them to improve my online marketing activities."
  },
  {
    "no": 4,
    "date": "2017-04-24 04:31:15",
    "fromNow": "2 months ago",
    "user": 5,
    "name": "Ireland Tomas Vircik",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very good for beginners as well as for advanced online business users, as it covers some aspects that you might be missing. For beginners, it is a great start to use online strategies in real time with the tutor. Very easy to follow. As promised in description. Recommended. Thank you, Daragh Walsh & Rob Percival"
  },
  {
    "no": 5,
    "date": "2017-04-24 04:31:15",
    "fromNow": "2 months ago",
    "user": 6,
    "name": "Bahaa Italy",
    "rating": 3,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "There was some informative material in the course. But, for social media, it wasn't very good. Some of the videos end abruptly which is not very nice. I would've preferred that the video lengths of each section are standardized or similar instead of one too long and another too short. I have interests in using Instagram and you didi not include it in the course."
  },
  {
    "no": 6,
    "date": "2017-06-07 04:31:15",
    "fromNow": "17 days ago",
    "user": 7,
    "name": "Eric Austin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great job! The course was very organized and easy to follow, and included a LOT of important details, helpful links and tools, and PDF's to download. The course was also very professionally done and easy to listen to."
  },
  {
    "no": 7,
    "date": "2017-06-15 04:31:15",
    "fromNow": "9 days ago",
    "user": 8,
    "name": "Dr Kisholoy Roy",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I found this course extremely comprehensive. There was so much to learn and so much free tools to know about that are available online. Special thanks to instructor Daragh Walsh. His way of conducting the sessions, the voice modulation and his reverts almost whenever i had questions were fantastic."
  },
  {
    "no": 8,
    "date": "2017-06-08 04:31:15",
    "fromNow": "16 days ago",
    "user": 9,
    "name": "Tiago Corrêa De Almeida",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a \"straight to the point\" course with basic digital marketing strategies but fully needed to succeed in any industry segment."
  },
  {
    "no": 9,
    "date": "2017-06-12 04:31:15",
    "fromNow": "12 days ago",
    "user": 10,
    "name": "Orane Cole",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Most comprehensive training that covered all I needed to know about Digital Marketing. The depth of training, cheat sheets, case studies, scenarios and practical insights makes this course superior to others I have taken."
  },
  {
    "no": 10,
    "date": "2017-04-24 04:31:15",
    "fromNow": "2 months ago",
    "user": 11,
    "name": "Armando Trevino",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Wonderful course, explained in an easy to understand way and with plenty of real world examples. I'm looking forward to taking more of your courses. Thank you"
  },
  {
    "no": 11,
    "date": "2017-05-24 04:31:15",
    "fromNow": "a month ago",
    "user": 12,
    "name": "Hussam Halawi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is very valuable and Daragh is articulate and speaks with simplicity. Additionally, the content from the beginning is very interesting and gives you a good impression of where this is going. I've always been passionate about technology and I'm always eager to learn. In all honesty, I should have taken this course a very long time ago considering that my past 12 years were in sales and marketing across three countries and continents. I absolutely recommend it to ANYONE as it is a vital skill to have nowadays in the job market and guess what?!! you never know when your path might change and when your next big thing come along your way and you'd NEED this. Genuinely, I feel so fulfilled taking this course. On a side note, I loved Ireland during my visit, Dublin and Galway and adored Killarney :). Thanks again and I will recommend this to anyone."
  },
  {
    "no": 12,
    "date": "2017-06-10 04:31:15",
    "fromNow": "14 days ago",
    "user": 13,
    "name": "Mayank Arora",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "If we consider this as a basic course, I can say that it's the best in the market. But, I was expecting it to be \"Beginner to Advanced\" level course. A lot of things can be done like detailed SEO backlinking strategies, concept of guest posts and how to approach bloggers so as to get a backlink from them,  facebook ads mastery; Different content marketing tools and how to use them. Also, it'd be better if we got to know how to use Ahrefs and SEMRush in details. In copywriting too, it'd be appreciated if get to learn how to write a press release and pitch journalists. If these things could be covered in details, this course will be the best and doubt Daragh is so sweet and helpful.As a beginner's course, it is the best. Highly Recommended!!!! :)"
  },
  {
    "no": 13,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 14,
    "name": "T M Tause Rana",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Clear and smooth presentation the courses. I hope it will be great helpful for my next digital marketing activities. Very much interested to finish the course soon."
  },
  {
    "no": 14,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 15,
    "name": "Michael Causey",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Informative, practical, and in-depth. The information within this course is vital for the online presence every business needs today."
  },
  {
    "no": 15,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 16,
    "name": "Michael Toro",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great info starting from scratch, covering all key topics for building a practical digital marketing funnel.  My only criticism would be that some topics were covered very quickly, and skipped detail that a true beginner would get stuck on, e.g. linking nameservers on a new domain install (that one took me several hours to figure out the first time I tried it) or adding/editing posts and layouts in Wordpress.  For someone who is motivated, there are lots of other resources out there, but a newbie won't really find all the small steps needed to follow along.Overall, the course was really comprehensive and did a great job covering a wide range of topics any beginner would struggle with. It won't make you an expert at any, but enough meat there to get minimally up to speed on all of it.Highly recommended!"
  },
  {
    "no": 16,
    "date": "2017-05-30 04:31:16",
    "fromNow": "25 days ago",
    "user": 17,
    "name": "Yogesh Sahu",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "this course is awesome with hands on practical exposure  to real world marketing pattern and nicely crafted with all the details of tools that can be used to the advantage  could have been more better  with few more with added  knowledge of LinkedIn marketing  and  added information of the adsense integration to the websites and few takeaway for the affiliate programming knowledge."
  },
  {
    "no": 17,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 18,
    "name": "Teodora Coneva",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was interesting for me. I understood new things. I don't have the patience to implement the new knowledge in my work. I recommend the course for everyone who is interested in digital marketing."
  },
  {
    "no": 18,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 19,
    "name": "Camden Wier",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very thorough! Explains concepts well. Good organization. My only critique: although you mention it in Google AdWords, I wish you would have done a section on Facebook advertising as well. Overall, phenomenal course! Have already recommended to friends."
  },
  {
    "no": 19,
    "date": "2017-06-02 04:31:16",
    "fromNow": "22 days ago",
    "user": 20,
    "name": "Jenny Chang",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor is very patience and explained things very detail, I like the review and wrap up section in every lecture which help me to remember. I like the final 12 key point to take away and some answering questions sessions. I learn much and I know I still need to learn more. I hope the instructor will keep passion to teach (I guess he has patient to teach), and earn money is just one of his goal."
  },
  {
    "no": 20,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 21,
    "name": "Samuel Phillip Ranger",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course full of real world examples and immediately actionable counsel. This is the course for people who want real world results with a focus on the core concepts without any fluff or unnecessary academic terminology."
  },
  {
    "no": 21,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 22,
    "name": "Charles Changuin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course amazed me of the world of marketing! I wish they taught me this in school, but it's never too late!!"
  },
  {
    "no": 22,
    "date": "2017-06-11 04:31:16",
    "fromNow": "13 days ago",
    "user": 23,
    "name": "Muthumali Tharuka",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome course ! I was so existed to compete this so I took a day off from my office to follow the lectures as well :D"
  },
  {
    "no": 23,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 24,
    "name": "Evan Parcon",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm in the middle of the course and by far the most compacted - straight to the point and specific actionable subtopics to help students to thrive in this industry. Great course and I highly recommend it especially for beginners."
  },
  {
    "no": 24,
    "date": "2017-06-07 04:31:16",
    "fromNow": "17 days ago",
    "user": 25,
    "name": "Cleveland Webber",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a very good course, I've learn a lot of new information about building a blog. Thank's for the course."
  },
  {
    "no": 25,
    "date": "2017-06-08 04:31:16",
    "fromNow": "16 days ago",
    "user": 26,
    "name": "Giuseppe Deepak Benti",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Daragh is a great teacher. He explains everything and with videos is easy to understand all the steps. I really recommend this course. I got three courses from Daragh and Udemy and they are all very good. I am about to launch my project and I think this lessons will be very useful.  Thanks!!"
  },
  {
    "no": 26,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 27,
    "name": "Mohammad Imtiyaaz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome technics, simple and easy to get through for become pro in digital marketing especially people like me who's into strategy build but get hands on execution part.I suggest the videos should be in download format for PC as to review on later stage. please take this feedback seriously ."
  },
  {
    "no": 27,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 28,
    "name": "Paul sykes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "BrilliantThanks man for finally showing me EVERYTHING I couldn't work out by myself. Finally I can dominate my market. - Or at least compete on a level playing field."
  },
  {
    "no": 28,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 29,
    "name": "Yogesh Mansharamani",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I Loved this Course. Absolute Value for the Money. Has solved lot of overwhelming confusion that I always had about Digital Marketing. Big Thanks to Daragh Walsh"
  },
  {
    "no": 29,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 30,
    "name": "Chris Ford",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A lot of good with very helpful step-by-step walk throughs and the provided notes and materials were great. I really learned a lot!"
  },
  {
    "no": 30,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 31,
    "name": "Kammi Parker",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The lessons were very valuable, practical and actionable, however between both previewing and reviewing the content after each section, it felt too repetitive. If someone's taking them regularly (I was listening daily for a couple of hours at a time), that repetition feels tedious even though the information is valuable."
  },
  {
    "no": 31,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 32,
    "name": "Dmitry Simpson",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was great; however I felt that the fact that instagram was not covered was a bit disappointing given the popularity of the platform and hence my reason for scoring 3.5 and not 4."
  },
  {
    "no": 32,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 33,
    "name": "Daniel and I",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Daragh delivered the course in an incisive and friendly manner; packed with excellent advice it far exceeded my expectations."
  },
  {
    "no": 33,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 34,
    "name": "George@Kyaw Zay Yar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thanks Daragh for guiding me throughout the course. The tools and information provided during the lectures are quite handy, and useful. I am starting to build a campaign to help grow my projects using the guidelines. Highly recommend for those who want to learn Digital Marketing course from zero to hero."
  },
  {
    "no": 34,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 35,
    "name": "Vivian H. Schrijver",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course! Great content & the instructor was very attentive and responsive to all of my questions. I would have given it 5 stars if it had included other important channels like LinkedIn & Instagram. Additionally,  although the course includes a Facebook section, does not include a \"Facebook Ads\" part. But still, really pushed me to start working on my own website and gave me amazing tools I had no idea they existed!"
  },
  {
    "no": 35,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 36,
    "name": "Tatum Murison",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has allowed me to start my own business in real time. I'm officially launching my website in two days but gave my email subscribers early access and I made 6 pre-orders on my first day thanks to this course!"
  },
  {
    "no": 36,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 37,
    "name": "Álvaro Guzmán Parrochia",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Super super good course. Daragh is a grea teacher explaining witha  lot of examples. If you have doubts, he answers them within 24 hrs. If you are willing to take the adwords certification, first take this course that will give you the whole picture of digital marketing, so you have the correct foundations to do a great work with adwords."
  },
  {
    "no": 37,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 38,
    "name": "Catalina Guerrero",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is amazing! It gives a lot of detail and everything is very well explained. I also think the tone of voice was great and the fact that it was divided in small chapters made it easier to learn. The teacher knows his topic very well. I loved that it was practical, that he explained and then he showed how he did it."
  },
  {
    "no": 38,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 39,
    "name": "Ramya Subash",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The lecture is so crisp and easy to understand. Plus, it explains every intricate detail for a beginner to understand it at its very best."
  },
  {
    "no": 39,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 40,
    "name": "Linsey Worgan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I've studied other digital marketing courses but found this one to be by far the best not only in terms of the level of detail provided but also because it takes you through the technical aspects step-by-step. At every stage the practical modules relate back to real life scenarios and clearly demonstrate the business benefits. This course will give people within the wider Comms industry a real advantage in terms of career development. I've already recommended it to a number of friends."
  },
  {
    "no": 40,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 41,
    "name": "Karine Balian",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The momentum of this course was very logical. I learned alot and now know which portions I will dig deeper. Great instructor as well helped in this process!"
  },
  {
    "no": 41,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 42,
    "name": "Simon A. Nagy",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Incredible value for the money! Daragh, you truly did a tremendous  job in providing a detailed and easy to understand marketing course which is accessible to everybody. Thank you very much! Even as a Commerce & Marketing student I found lots of new info about the practical part of digital marketing and many actionable items in it. You could've dive into more detail at some topics, but I'd highly recommend this course to anybody who is interested in the core principles of digital marketing and didn't know where to start."
  },
  {
    "no": 42,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 43,
    "name": "Paul Pudhnum",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was my first course here. I had to take another one before I reviewed this one to make sure I was being neutral.This course was so good. It covered so many topics. So many good things about it:The delivery was good,Clear to understand,Subject matter was well understood,Material was covered in the right amount of detail,The resources were really good,Audio was good through out,No extra fluff, just good contentReally learned about Facebook pages since I need to work on this more. Getting engagement is a challenge onhttps://www.facebook.com/huxfit/I really liked everything about this course and signed up for the Analytics with Daragh also.Nice job!"
  },
  {
    "no": 43,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 44,
    "name": "Arneps@uol.com.br",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Completo, muita informação adicional e explicado de maneira clara.Complete, lots of additional information and clearly explained."
  },
  {
    "no": 44,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 45,
    "name": "Marco Guerrero",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I don't have a business yet, but this course covers every question I would've had and every place I would've felt stuck at. I'm halfway through the course now and feeling much more prepared and confident for when I DO make my online business happen!"
  },
  {
    "no": 45,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 46,
    "name": "Jakub Ježovič",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really great digital marketing course with a wide range of subjects. Perfect for people who want to improve and analyze their wordpress websites and focus more on promoting their business through Facebook, Youtube, Quora, Ads, etc. Only one thing which I was thinking could be better are quizzes at the end of the every section, I think 10-20 questions for every quiz would be optimal, that people can get feedback for themselves if they're paying attention and remember the important information. Thank you, Daragh!"
  },
  {
    "no": 46,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 47,
    "name": "Milind Gawaskar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "\"In spite being so lengthy, this course will keep you hooked to the laptop if you are planning to go digital for marketing your new business\"I must say that instructors have REALLY worked hard to take care of smallest of detail while putting this course together.. thanks a lot for this wonderful package of 12 courses...If I may request, could you please consider adding LinkedIn channel as well. I was surprised to see later that it's missing on the list...Once again, thanks a lot Daragh Walsh and Rob Percival :)"
  },
  {
    "no": 47,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 48,
    "name": "Heini Sivula",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very hands on course, lot of good and practical information for everyone working with digital marketing. One of the best online courses I've participated."
  },
  {
    "no": 48,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 49,
    "name": "Elleisa Schloss",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great for start up businesses and new entrepreneurs. Good for basics and some handy tips for new marketers."
  },
  {
    "no": 49,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 50,
    "name": "Craig Edmondson",
    "rating": 2,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "his voice is so soft and I almost fall asleep listing to it.And like the \"caption this\" part he goes to the mark wahlberg post to show he's got 11K likes. yes that is because he is famous but that doesn't mean every company can do that"
  },
  {
    "no": 50,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 51,
    "name": "Aditee Mehra",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Well structured and explained program. lot of practical tools and tips. Very helpful."
  },
  {
    "no": 51,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 52,
    "name": "Dario Gomes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I was VERY pleasantly surprised with this course! Daragh is someone who knows his stuff and gives out a ton of examples, insights, tips and tools to better your approach to online marketing!"
  },
  {
    "no": 52,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 53,
    "name": "Adam Estela",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great Fundamentals and InsightsI came into this course with no marketing knowledge, and have since driven sales using what I learned here. I can't say that this covers everything there is to know about marketing, but what he covers, he covers extremely well. There is also a ton of application, assignments, and walkthroughs. Perfect teaching style!"
  },
  {
    "no": 53,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 54,
    "name": "Ayushman Mathur",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Highly valuable for the Entrepreneurs. This course has taught me the best lessons in digital marketing till now :)"
  },
  {
    "no": 54,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 55,
    "name": "Dave Wong Cheong Siong",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Daragh has made this course very well. Overall, I'm impressed by the quality of the instruction and it suits all who don't have formal marketing training."
  },
  {
    "no": 55,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 56,
    "name": "Ayush Kanaujia",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The tips shared inside the lecture seem very useful. Thank you. It is a nice beginning to explore these platforms in further details yourself."
  },
  {
    "no": 56,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 57,
    "name": "Alex Wroblewski",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good content and learning materials   Would have given 5 stars if FB ads were cover in the Facebook section."
  },
  {
    "no": 57,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 58,
    "name": "Ajay Patel",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very Niven course must go for it I feel you are planning to have a website.Good job. Some things I was already aware and some things completely new.Would recommend it"
  },
  {
    "no": 58,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 59,
    "name": "Buzurgmekhri Kurbon",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I put five stars because for me as beginner in digital marketing I took a lot of knowledge which I didn't expect. It would be grate if you could also add LinkedIn too. But its so far so good! Thanks"
  },
  {
    "no": 59,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 60,
    "name": "Thomas Holm",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Daragh Walsh is great at connecting with his students and relaying the importance of even the smallest details of digital marketing. Not only is Mr. Walsh a fabulous mentor throughout the course, but his concepts are difficult to find anywhere else. Thank you!"
  },
  {
    "no": 60,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 61,
    "name": "Sergei Timshin",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good course especially for people who are new in marketing. For those who are experienced it could seem a bit boring"
  },
  {
    "no": 61,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 62,
    "name": "Jeron Strickland",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great info so far..... love the short videos..... love the step by step process..... love the Facebook interaction! The narrator speaks clearly and slow enough for me to write down info, however the monotone voice can become a lullaby after about 45 minutes. Over all I'm extremely excited about this purchase."
  },
  {
    "no": 62,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 63,
    "name": "Director Bradley Edwin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I definitely know what I am doing with my Company now. I have just completed the Digital Marketing course on Udemy with CompleteDigitalMarketingCourse.com and the \"AWESOME\" Daragh Walsh and his TEAM. I have never experienced such Clarity and Professionalism with an online course. I had my doubts, at first, but am tremendously grateful for signing up.If anybody is thinking of signing up for an online course, don't hesitate to sign up at Udemy or CompleteDigitalMarketingCourse.com. Sign up today and do not even give it a second thought. You will forget all your fears and misconceptions about Online Studying. (They will not steal your money), like the online courses in South Africa. These guys are doing AWESOME work for people like me in South Africa, where now we are rated, a Country with \"Junk Status\". Is there ways to advertise your courses on my website http://www.hostinginsa.com."
  },
  {
    "no": 63,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 64,
    "name": "Yusif Gasimov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thank you very much Daragh! Your course simultaneously very informative and attractive. Another main advantage of this course that we can practice all your materials online. What is a theory without practice? I`m very hungry to obtain all significant sides of Digital Marketing for realizing my goals and plans. Thank you again! Till the end together! ;)"
  },
  {
    "no": 64,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 65,
    "name": "Ryan Joseph",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very good course. Highly actionable. The step by step process is very effective. I would definitely recommend it."
  },
  {
    "no": 65,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 66,
    "name": "Ravi Aggarwal",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Would rate it 5 Stars for the way the course has been presented by Daragh with notes readily available. Yes, as pointed by Vivian, would be great if LinkedIn, Instagram and Facebook ads are included. This will make it the most comprehensive course available at great price. True value for money. Highly recommended!"
  },
  {
    "no": 66,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 67,
    "name": "Jelena Savic",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really good step by step course, very easy to follow. Good and inspired."
  },
  {
    "no": 67,
    "date": "2017-06-22 04:31:16",
    "fromNow": "2 days ago",
    "user": 68,
    "name": "Ying He",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the only course I've taken so far on udemy allows me to really start my real-life project along with the course step by step. Some of the check lists or cheat sheets as he called them, I probably would have to carry them with me in mind for a long time."
  },
  {
    "no": 68,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 69,
    "name": "Karon Owens",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is great! Mr. Daragh does an awesome job teaching this course. He shows you how to do digital marketing step by step and he shows you the results that he achieved from his strategy."
  },
  {
    "no": 69,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 70,
    "name": "Craig Griffin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course has so far exceeded my expectations in both value for money and content. The information and tips I have learnt are invaluable. I was seeing positive results on my website traffic and sales after only a few days."
  },
  {
    "no": 70,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 71,
    "name": "Maricor S. Atanacio",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am so blown away by all the information that is being taught in this tutorial. I have zero knowledge with digital marketing and SEO and all these jargon, but with Daragh's tutorial, I have learned to appreciate them now and I am more eager to watch if he has any other courses, for I know that I am getting quality education and information from him. This is such a very valuable course and I am so happy to really trust the other reviewers on this course, and it is now my turn to leave the same 5 star feedback so that many more will benefit from this course. It really is the ultimate Complete Digital Marketing Course one can ever find, the topics are perfectly arranged, the course notes are very detailed, and Daragh promptly answers to us his students if we have any questions, and the best part is...he made this amazing course affordable. Thank you Daragh and more power!!!"
  },
  {
    "no": 71,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 72,
    "name": "Andre Mostert",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Spot on content and practical application. Daragh knows his subject and is able to drill down to the essentials of digital marketing. If you want to get good results without sacrificing all your time this is the course for you."
  },
  {
    "no": 72,
    "date": "2017-06-09 04:31:16",
    "fromNow": "15 days ago",
    "user": 73,
    "name": "Minal Joshi Jäckli",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very helpful to get a comprehensive walkthrough. Thank you very much!"
  },
  {
    "no": 73,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 74,
    "name": "Georgi Popov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really informative course! Daragh, the instructor, went in the necessary depth on each of the topics, laying solid foundations to build on through personal experience afterwards. Relevant and up to date content - stuff that is not taught in schools! I am so glad I took this course! Thanks for the amazing delivery :)"
  },
  {
    "no": 74,
    "date": "2016-11-24 04:31:16",
    "fromNow": "7 months ago",
    "user": 75,
    "name": "Mexon Mulakayath",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I was new to Digital Marketing. This course helped me to have deep understanding of Digital Marketing and Market my new business online. The instructions were easy to follow and the examples were real world. This is the first Udemy course I completed 100 %.  Thank you for this great course."
  },
  {
    "no": 75,
    "date": "2016-12-24 04:31:16",
    "fromNow": "6 months ago",
    "user": 76,
    "name": "Blaise Depallens",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is magic.It is complete, well explained, clear step by step process. Everything you need to understand how the digital marketing wolrd works to bring your business or website to a whole new level.Thanks for sharing the knowledge. I strongly recommend the course i am more than happy."
  },
  {
    "no": 76,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 77,
    "name": "Vaishak Damodar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is a must for beginners in Digital Marketing. Everything was explained in simpler terms. I enrolled into this course just to revise a few topics, but I did learn something new especially about Google Analytics and marketing on Quora. Well, for me the best part about this entire course was the Google analytics module. I've gone through many tutorials online but this training stands out from the rest. I loved the custom analytics dashboard too."
  },
  {
    "no": 77,
    "date": "2017-06-21 04:31:16",
    "fromNow": "3 days ago",
    "user": 78,
    "name": "William Reid",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course.  Very good breakdown of all aspects of digital marketing."
  },
  {
    "no": 78,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 79,
    "name": "Monam Aburas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great experience taking a course in Udemy website, and the iPad app is really great and convenient."
  },
  {
    "no": 79,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 80,
    "name": "Chao-Tzu Huang",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Worth for it! Recommend people who want to learn full scale marketing skills. Maybe can add Instagram into course."
  },
  {
    "no": 80,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 81,
    "name": "Nges Boris B.",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course, could not be better. Opened my eyes and improved my digital marketing skills, i really enjoyed the analytics session"
  },
  {
    "no": 81,
    "date": "2017-06-07 04:31:16",
    "fromNow": "17 days ago",
    "user": 82,
    "name": "Anthony",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The time put into this course is extensive.  It is extremely detailed and consists almost entirely of real world examples.  You can't go wrong with this one."
  },
  {
    "no": 82,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 83,
    "name": "Monalisa Sharma",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Till now it's good and I understood everything. SEO part, I would like to do it again. I am actually getting the practical exposure of Topics."
  },
  {
    "no": 83,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 84,
    "name": "Steve Bucher",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great explanation of digital marketing today. I will need to prepare a website to actually work through the examples. Some of the videos seemed to be fuzzy in regard to image quality."
  },
  {
    "no": 84,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 85,
    "name": "Christopher Allan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is very detailed and takes time! However, follow the excellent instruction for each project and really get a feel for how to set up a digital marketing plan for your business!"
  },
  {
    "no": 85,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 86,
    "name": "Reem Baraz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course I highly recommend for its cohesive and detailed content. It is very structured and thoroughly divided into modules for clear understanding of each topic. Great work!"
  },
  {
    "no": 86,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 87,
    "name": "Faith Muthoni Kiarie",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is well explained and the material is equally good!"
  },
  {
    "no": 87,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 88,
    "name": "Alejandro Perez",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I am half way through the course and I already feel that I have gotten more value that I paid. Thank you so much for your service!!!"
  },
  {
    "no": 88,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 89,
    "name": "Jordan Philip",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I would certainly recommend this course for someone who is looking to jump right into digital marketing with actionable advice and a walkthrough on how to start their website and generate their first leads. Great work! I look forward to more advanced courses in the future. P.s. I would say that I did watch the course is 1.5x speed as I found it slow in areas. I am not new to digital marketing so this is perhaps why."
  },
  {
    "no": 89,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 90,
    "name": "Karthik Ramanathan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Real tools and examples with a handson experience. The course is lengthy but it is worth the time for beginners."
  },
  {
    "no": 90,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 91,
    "name": "Melanie Homer",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course covered a lot within the 20 hours and gave some really good tips to grow your business online.  Some of the sections I was already familiar with but I got a better understanding of SEO and Google Ads. The available course notes will come in handy for future reference in case you need reminding of some of the steps and proposed programmes/apps to be used as you go along."
  },
  {
    "no": 91,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 92,
    "name": "Lalit Kumar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Thanks Daragh for this wonderful course and awesome delivery.It is perfect for beginners as well as experienced professionals who would benefit from the structured approach taught in this course. The modules are well designed and easy paced. There are plenty of resources and nuggets along the way that are tremendously useful.Really enjoyed the course.Thanks again."
  },
  {
    "no": 92,
    "date": "2017-03-24 04:31:16",
    "fromNow": "3 months ago",
    "user": 93,
    "name": "Magreeta Clarke",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an excellent course that teaches you, step by step to set up a WordPress blog,  and get it popular. It is great for beginners who are just starting a new blog and don't know what to do. It is well worth the price."
  },
  {
    "no": 93,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 94,
    "name": "Muhammad Ahsan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is superb course, it takes from the very get go and expects no prior technical expertise to understand the concepts. Very well taught and course content is up to date."
  },
  {
    "no": 94,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 95,
    "name": "Alyssa",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is exactly what I needed to need hands on experience before entering the work force! This will be great to add to my resume in hopes of landing an entry level digital marketing job or even potentially constructing my own successful web site! Thanks!!"
  },
  {
    "no": 95,
    "date": "2017-05-24 04:31:16",
    "fromNow": "a month ago",
    "user": 96,
    "name": "Adrijana Drozdek",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Easy to follow and well explained. Great course for those who are launching a new business. Lots of tips & tricks."
  },
  {
    "no": 96,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 97,
    "name": "Andrea Kobelt",
    "rating": 1.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Inhalte sind sehr oberflächlich und geben oft keine objektive, sondern eine sehr subjektive Vorangehensweise und Meinung ab. Zusätzlich sind viele der Anleitungen (z.B. Facebook) outdated, sprich die Informationen sind so nicht mehr nützlich."
  },
  {
    "no": 97,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 98,
    "name": "Topchiy Helen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course! a lot of useful infomation presented in easy you-can-do-it way."
  },
  {
    "no": 98,
    "date": "2017-04-24 04:31:16",
    "fromNow": "2 months ago",
    "user": 99,
    "name": "Naina Garg",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "i am very new to this digital marketing platform. I am expecting more of practical knowledge, case study and project based and it is difficult to learn just by looking and listening to the videos."
  },
  {
    "no": 99,
    "date": "2016-12-24 04:31:16",
    "fromNow": "6 months ago",
    "user": 100,
    "name": "Winston Dsouza",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Trainer is full of practical knowledge and also a very good teacher who takes you from scratch to pro levels set by step. If applied in reality, this course can definitely drive business !!!My heartily felt Gratitude for Walsh"
  },
  {
    "no": 100,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 0,
    "name": "Daragh Walsh",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Mexon Mulakayath",
    "content": "Delighted to hear you've completed the course. Well done Mexon!"
  },
  {
    "no": 101,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 0,
    "name": "Daragh Walsh",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Vaishak Damodar",
    "content": "Delighted to hear your specific feedback Vaishak. Thanks for sharing!"
  },
  {
    "no": 102,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 0,
    "name": "Daragh Walsh",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Steve Bucher",
    "content": "Delighted to hear your feedback Steve. Thanks for sharing. Change setting on video quality to increase to 1080p video."
  },
  {
    "no": 103,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 0,
    "name": "Daragh Walsh",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Melanie Homer",
    "content": "Delighted to hear your feedback Melanie. Thanks for sharing!"
  },
  {
    "no": 104,
    "date": "2017-01-24 04:31:16",
    "fromNow": "5 months ago",
    "user": 0,
    "name": "Daragh Walsh",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Alyssa",
    "content": "Delighted to hear your feedback Alyssa. Thanks for sharing!"
  },
  {
    "no": 105,
    "date": "2017-02-24 04:31:16",
    "fromNow": "4 months ago",
    "user": 0,
    "name": "Daragh Walsh",
    "rating": 0,
    "helpful": false,
    "indent": 1,
    "origin": "Winston Dsouza",
    "content": "Delighted to hear your detailed feedback Adolf. Thanks for sharing!"
  }
]