[
  {
    "no": 0,
    "date": "2017-06-21 04:16:19",
    "fromNow": "3 days ago",
    "user": 0,
    "name": "Milos Radibratovic",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Course is well structured and detailed, some longer lessons can get a bit difficult to follow after a while because of amount of information thrown at you, but this is not a bad thing since you can always pause the video or rewind to catch up. Overall, if you want to learn JavaScript this course will give you a solid foundation and understanding how JavaScript works."
  },
  {
    "no": 1,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 1,
    "name": "Rishabh Jain",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really loved it.  And it would be really helpful if you can also provide some simple exercisequestions for each topic separately so that we can practice more before starting with the actual coding challenges."
  },
  {
    "no": 2,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 2,
    "name": "John Joseph",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's a great course for learning JavaScript.The instructor has sound knowledge of JavaScript.After finished this course I'm feeling I have a good command on it.Thank you, Jonas"
  },
  {
    "no": 3,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 3,
    "name": "Krish Penumarty",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "First off, I want to thank Jonas for creating one of the best courses I have ever taken. I have already been programming in JS for a while now, but never took the time to understand the core concepts and write code efficiently. He breaks down all of the important concepts of JS to pure simplicity that early beginners are preplexed by. I am so confident in JS after taking this course and excited to share that I have already started implementing these concepts in my day to day job. Ready to take the HTML5/CSS3 course by Jonas next."
  },
  {
    "no": 4,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 4,
    "name": "Mark Davidov",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "In challenge 6 he does not explains good enough:  how can i define several functions that i want to return from the main function...  I saw it for the first time in the challenge itself, but no explanation was made before. So i got stucked (this is example :var UIcontroller = function () {return {        getInput: function() {            return {               type: document.querySelector(DOMstrings.inputType).value,                desc: document.querySelector(DOMstrings.inputDescr).value,               val: document.querySelector(DOMstrings.inputValue).value)            };        },}"
  },
  {
    "no": 5,
    "date": "2017-06-11 04:16:19",
    "fromNow": "13 days ago",
    "user": 5,
    "name": "Gyula Hrubi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is really detailed. The examples are practical and useful to understand the different techniques."
  },
  {
    "no": 6,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 6,
    "name": "Chinyi Pam",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas did a good and clear explanation to javascript, I hope there will be more real-world projects tutorial like budget app in the future. The only negative thing is that the budget app project is suddenly far more advanced than previous lectures, you need time to really understand the concept or technique, but it's still a good course to deepen the javascript language."
  },
  {
    "no": 7,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 7,
    "name": "Shaun Collins",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "from what i have studied so far it seems to cover everything in detail, i know some JavaScript already so this really helps! This is a great course well explained and I'm really learning a lot more about how code works. Brilliant course!!!I have finished the course now and i can say it was real value for money, by far the best course on javascript so far! Thanks Johnas."
  },
  {
    "no": 8,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 8,
    "name": "Serena Gyi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an excellent course. It was not my first programming course but it was my first for an object-oriented language. It gave me a very strong foundation for the JavaScript language and the web-based projects you can use the language for. I am extremely satisfied and plan to go back over some of the lectures to further solidify my handle on some of the more abstract concepts.Keep in mind, it may take a few days for your questions to be answered."
  },
  {
    "no": 9,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 9,
    "name": "Avni̇ Gürel Gürdere",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "A truly successful course. The scope of the course is very detailed and Jonas teaches perfect. It was very useful to me. Thanks a lot."
  },
  {
    "no": 10,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 10,
    "name": "Aviv Levi",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "AMAZING COURSE!the only downside here is planning the big project in the end - didn't know how to approach it - see all the lectures and then code or code along with jonas?anyway it's really minor, great course, recommended!"
  },
  {
    "no": 11,
    "date": "2017-06-05 04:16:19",
    "fromNow": "19 days ago",
    "user": 11,
    "name": "Nick Smith",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Fantastic course. Great to apply what was taught by building practical projects rather than just coding exercises. This course includes materials from various sources on the internet and categorises them in a well structured manner. I feel more confident with building javascript projects now. Overall I would highly recommend taking this course."
  },
  {
    "no": 12,
    "date": "2017-06-06 04:16:19",
    "fromNow": "18 days ago",
    "user": 12,
    "name": "Edward Cheadle",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas talks about how javascript works in a way I had never seen. Talking about how the code functions behind the scenes and then pointing out this affects coding is something I have not seen on other courses. Also his coding exercises are better than most  I have tried.   I recommend this course in javascript to anyone interested in the subject"
  },
  {
    "no": 13,
    "date": "2017-06-06 04:16:19",
    "fromNow": "18 days ago",
    "user": 13,
    "name": "Tony Guerrero",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "That's a fair name: \"The Complete JavaScript Course\". All in plain vanilla JavaScript, no frameworks nor fancy stuff to speed you up but learning all what it takes to grasp the language, its beauty, its boundaries and power. (A Java/Python background here).Jonas does a great job clarifying complex topics and successfully delivering where many formal books fall short.It can be seen tedious using the same variables, functions and classes throughout the course but now that the course is finished I believe that is its stronger part; and that sets the foundation where all  the lessons must gravitate so by the end you can see those very same variables, functions and classes you have seen since the beginning in a totally different perspective and perception,  making everything falling in place by itself.Jonas, may this note serve as a humble thank you note."
  },
  {
    "no": 14,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 14,
    "name": "Stephen Cattie",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is simply the best instructor by far that I've had to date at Udemy. He created a first class course equal to any university Javascript course. He explains the subject matter with such detail and thoroughness that he makes difficult topics easy to understand. He does not cut any corners in his explanations, he goes the extra step every time to explain the concepts. Believe me, you will learn Javascript by taking this course. The guy is an asset to Udemy, they should be very grateful they have an instructor of his talent."
  },
  {
    "no": 15,
    "date": "2017-06-12 04:16:19",
    "fromNow": "12 days ago",
    "user": 15,
    "name": "Hristo Borisov Totov",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Overall nice course the only thing I would have liked to see is maybe a lecture about mySql and JS and how they interact with each other and how to link our database with JS. Again, very nice course thank you vary much for the lectures!"
  },
  {
    "no": 16,
    "date": "2017-06-22 04:16:19",
    "fromNow": "2 days ago",
    "user": 16,
    "name": "Bradley Bares",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Coming from java, the way in which the course was taught complicated things as I could relate more to the newer versions of JS which weren't taught till the end of the course. As a result I started making the important connections at the very end instead of the very beginning. Other than that the course was very thorough, neat, and was easy to follow."
  },
  {
    "no": 17,
    "date": "2017-06-17 04:16:19",
    "fromNow": "7 days ago",
    "user": 17,
    "name": "Vinayak Singh",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Quality of course is very good. It helps from beginners to experienced person.Very clear understanding fro,m concepts to advanced topics.I would recommend this course."
  },
  {
    "no": 18,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 18,
    "name": "Shravan Dammannagari Gangadhara",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was awesome! I already knew a bit of JavaScript but I have a learnt lots of new things in JS in this course. The instructor explained everything very clearly. Just a small disappointment. For the two websites we designed, I thought we would be learning and designing the HTML and CSS scripts as well but we had the opportunity to learn JS alone. The HTML and CSS code was predefined.  Apart from that, this course is very good. I will recommend this to everyone."
  },
  {
    "no": 19,
    "date": "2017-06-14 04:16:19",
    "fromNow": "10 days ago",
    "user": 19,
    "name": "Edgar Cesar Martinez Bazarte",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is one of the best javascript courses in Udemy. In this course, I can understand how to do a real project, which in other courses only showed very basic things and do not teach you how to apply your knowledge. Thank you very much for offering these courses and for sharing your knowledge. I have learned a lot, thank you very much."
  },
  {
    "no": 20,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 20,
    "name": "Arkadiy Akhmetshin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "An excellent course. Learning from simple topics to more advanced ones is a nice way to study. Also making coding exercises is funny and useful. I enrolled to another course of this author after graduating."
  },
  {
    "no": 21,
    "date": "2017-06-21 04:16:19",
    "fromNow": "3 days ago",
    "user": 21,
    "name": "Gustavo Perenciolo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. The instructor really knows about JS and makes a big picture about the language. This course isn't just copying his code, he takes us through a better understanding of JavaScript."
  },
  {
    "no": 22,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 22,
    "name": "Adediran David",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course. The lectures about the execution context and the lexical scope are invaluable to understanding how JavaScript works behind the scenes."
  },
  {
    "no": 23,
    "date": "2017-06-23 04:16:19",
    "fromNow": "a day ago",
    "user": 23,
    "name": "Sandhya Reddy Bellannagari",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is indeed a great course. I like the way topics are presented with practical examples and maintaining the code for future reference. I feel confident in JavaScript after taking up this course and would highly recommend to those who want to start their career with web development. Thank you..:)"
  },
  {
    "no": 24,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 24,
    "name": "Aaron Walls",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course, starting from zero to reaching some pretty advanced concepts!  I feel that it covers more than a typical college course, since you don't deal with instructor tardiness, absences, disruptions, and off-topic diversions.  It's also nice that you can take a break whenever you need to, and most of the lectures have logical break points."
  },
  {
    "no": 25,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 25,
    "name": "Gytis Bilevicius",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Before taking this course I knew nothing about programming. Now I understand a lot and can go further in programming. I love the idea of explaining basic subjects in really clear way. Jonas is a great teacher who is passionate about his students to learn the subject. At one moment I just followed Jonas, because I've lost a track in budget project, it was too advanced for me :) but I can return to it after some time and look at it with fresh thoughts.Overall, this course is worth many times more than it's original price. Course covers everything for you to deeply understand Javascript. I am very happy to participate in this course and I definitely recommend it."
  },
  {
    "no": 26,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 26,
    "name": "Diego Sarmiento",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course really overtook my expectations. It covers the most relevant concepts in JavaScript. The only missing part (for me) is everything related to HTPP connection, but I assume it can be covered with the advanced JS courses.I recommend this course, even if you are an advanced Front End Developer."
  },
  {
    "no": 27,
    "date": "2017-06-07 04:16:19",
    "fromNow": "17 days ago",
    "user": 27,
    "name": "Jochen Schimpf",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very comprehensive course which is well structured and explained. You can tell the trainer has put a lot of effort into this course."
  },
  {
    "no": 28,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 28,
    "name": "Emily Beauchamp",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very thorough explanations and examples. We did two real-world projects to apply what we learned to realistic situations. I really liked that we went over the newest version ES6 and how we can convert it to ES5 so it is accessible by all browsers. I learned a lot about JavaScript and even more about programming in general!"
  },
  {
    "no": 29,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 29,
    "name": "Paulo Cohn",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is a great teacher. He explains the \"whats\", the \"hows\" and the \"whys\" in plain, simple to understand language. He covers Javascript from basics to advanced with to the point examples.  For experienced programmers like me, this course was very helpful in learning and understanding the differences between Javascript and other object oriented programming languages. I'm glad that I took this course from start to finish and I'll certainly keep this course as a reference for my Javascript projects."
  },
  {
    "no": 30,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 30,
    "name": "Ruslan Sharipov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "just finished that course and i think this course a great start for deep dive into js language. but you shoud be prepared that after that course you will be have only great basic knowledge of javascript. so if you ok with that you definitly should have this course"
  },
  {
    "no": 31,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 31,
    "name": "Aarthy Sekar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It is a worth reading material i have ever seen ... i strongly recommend this course to everyone who actually wants to know JS from scratch!!!..."
  },
  {
    "no": 32,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 32,
    "name": "Mr Toby  J Henderson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I purchased this course for $150mx peso's which is = to about $7. usd...  This was an EXTREME VALUE that I COULD NOT REFUSE!!! :) Perhaps a mexico proxi might work order now!!The course is extremely challenging and i will take it again it seems to have an ample amount of Javascript instruction to transform you into a Javascript programmer for sure. The course covers theory and practice with handy reference guides. If you apply yourself this course will help you learn all of the Javascript fundamentals so you can expand from that point."
  },
  {
    "no": 33,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 33,
    "name": "Castermans Koen",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I already knew some basic JavaScript, but this course took my JavaScript knowledge to the next level. This course provides practical coding challenges and two bigger projects which make you learn all the new concepts and techniques."
  },
  {
    "no": 34,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 34,
    "name": "Kevin Fallas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course! It's the fourth course on js I took and the first one I really understand and things get together. Absolutely recommended, very good pace and well explained!"
  },
  {
    "no": 35,
    "date": "2017-06-12 04:16:19",
    "fromNow": "12 days ago",
    "user": 35,
    "name": "Shupang Ma",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It's been a pleasure learning this course. Thank you so much!"
  },
  {
    "no": 36,
    "date": "2017-06-04 04:16:19",
    "fromNow": "20 days ago",
    "user": 36,
    "name": "John Gilger",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very clear explanations of creating good structure.Excellent instruction that wasn't just a re-hash of other online tutorials."
  },
  {
    "no": 37,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 37,
    "name": "Nicholas Allen",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is an excellent and thorough introduction to Javascript. It's incredibly well structured, and doesn't skip any steps. Though I already had learned some workarounds (using jQuery, for example) to coding issues and techniques in this course, following the progression of the course and doing the activities with simple Javascript was incredibly helpful in building my understanding of the language and all its components. I now feel much better prepared to continue coding bigger and better applications with Javascript."
  },
  {
    "no": 38,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 38,
    "name": "GiodiCi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is a really good teacher. This course allow you to go deep in JavaScript language and really understand the basis and principles."
  },
  {
    "no": 39,
    "date": "2017-06-02 04:16:19",
    "fromNow": "22 days ago",
    "user": 39,
    "name": "Genesis Price",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have mix feelings for the course because in the first  chapters the pace of teaching is really good, but some point I feel  like the jump between  things is huge for me somethings that I don't  understand at all. But maybe it's just the way that I learn. It may work for others perfectly."
  },
  {
    "no": 40,
    "date": "2017-06-03 04:16:19",
    "fromNow": "21 days ago",
    "user": 40,
    "name": "Oleksandr Demchenko",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I'm an iOS Developer and I was asked to write next application using React Native. This course helped me a lot in understanding Javascript and now I'm confident enough that learning new framework will be piece of cake!"
  },
  {
    "no": 41,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 41,
    "name": "Vilberg Sindri",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Brilliant course for getting the fundamentals of JavaScript. It is very clear that Jonas put great passion into building the course and the examples he makes are very clever and thought out, especially when he builds on the same examples as you get further in. You'll end up with a very good glossary of code that I find myself going back to so I can brush up on some of the fundamental things of language."
  },
  {
    "no": 42,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 42,
    "name": "William Branley",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is an excellent and detailed introduction to javascript.  I was basically self-taught and had never actually learned many details about the language.  This was perfect for giving me a better understanding of javascript.  Jonas explains things very well and the two projects are just right for learning how to apply features of the language.  Thanks Jonas!"
  },
  {
    "no": 43,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 43,
    "name": "Daniel Huang",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas teaches Javascript in a clear, outright way, while also including valuable examples and other information. He explains how everything actually works, not just how to make things."
  },
  {
    "no": 44,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 44,
    "name": "Mrinmoy Bora",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Detailed explanation of each of the important topics is given alongwith examples...."
  },
  {
    "no": 45,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 45,
    "name": "Jesse M",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very clear explanations, with great examples. The progression through the course is great for beginners, instilling knowledge to understand upcoming concepts. Some real world examples helped understand the logic behind the code, as well."
  },
  {
    "no": 46,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 46,
    "name": "Todd Croak-Falen",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Loved this course! Jonas does a great job of explaining complex material clearly and concisely, and by the end of the course I also had three great projects to add to my portfolio."
  },
  {
    "no": 47,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 47,
    "name": "Mitch Fuller",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is definitely a great course for beginning programmers and those new to js.  Not being new to js myself, I did find the sections on how javascript works behind the scenes and the ES2015 lectures very useful, especially to help support the React and React Native courses I am taking.  Thanks Jonas, something for everyone, new or experienced."
  },
  {
    "no": 48,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 48,
    "name": "Kevin H",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course! Very engaging presentation and well-paced lectures that cover a surprising amount of ground. Jonas really took the time to craft this course in a way that covers some key elements needed to understand how Javascript works as well as some hands-on coding to get a feel for how to apply what you learn. Overall a great base & launching point to code better Javascript. Thanks, Jonas!"
  },
  {
    "no": 49,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 49,
    "name": "Paul Gallimore",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is excellent! And I know, because I have studied a few.The difference between the best courses and the rest is largely down to structure and preparation. There are some instructors on Udemy who simply try to 'wing it', whilst others, Like Jonas, clearly take a serious amount of time to build their courses properly with the student's needs in mind.This course is thorough, well-paced and precise. Everything is explained in detail and the projects that are included are appropriate, extensive and well thought out. Furthermore, the lessons and the projects will make invaluable references to fall back on.Two final things. If you are completely new to programming, as I was, be aware that this course whilst being 'only' 17 hours, or so, of lectures will almost certainly take you several weeks to complete - unless you are machine. Lastly, I tried another Javascript on Udemy prior to this one, but gave up after about 4 video/hours, as the instructor was sloppy and virtually making it up as he went along - at least he was in comparison to the work that has gone into this course.If you want to learn JavaScript, this is THE course, IMHO."
  },
  {
    "no": 50,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 50,
    "name": "Rafael Sorto",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very good course Jonas. Thank you for the effort that you put in each course.I will keep this course as a reference for so many things related to Javascript."
  },
  {
    "no": 51,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 51,
    "name": "Adrian Marcelo Morales",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "excellent!. don't know what else to say, covers a lot of things and definitely covers all you need to know of javascript, it really goes from basic to pro."
  },
  {
    "no": 52,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 52,
    "name": "Michał Jung",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Quite good course, but it's more like 'JS for Web Development' that pure JS course - keep that in mind when picking this course. Also, keep in mind that Jonas RARELY responds in Q&A, so if you would have a problem, or you would like to ask for some explanation - u'd be probably stuck unless some other helpful user would answer your question."
  },
  {
    "no": 53,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 53,
    "name": "Dominic Kelley",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I have completed this course. It was a good dive into JavaScript and helped me reach a deeper understanding of how things actually work. I would recommend it to anyone needing to advance from hacking away at stuff to truly coding JavaScript."
  },
  {
    "no": 54,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 54,
    "name": "Software Engineer Riana Ferreira",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Fantastic coverage of the basic JS language principle, DOM manipulation and patterns to organise code. Interesting examples and really well presented by the lecturer :+"
  },
  {
    "no": 55,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 55,
    "name": "Dan Hoffman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course! It thoroughly explains Javascript ES5 while providing good opportunities to use what you are learning and does a good job teaching more advanced concepts as well as some of ES2015 (ES6). Perhaps, providing more (smaller) coding challenges for the advanced concepts would be beneficial, but this is a great course already."
  },
  {
    "no": 56,
    "date": "2017-06-08 04:16:19",
    "fromNow": "16 days ago",
    "user": 56,
    "name": "Jae An",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. Sometimes things go too slowly, but that's ok since I can skip around. I really liked the fact that he got into explaining on best practices and how to structure code. This is not something that most courses or books explain."
  },
  {
    "no": 57,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 57,
    "name": "Felipe Lima",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "It should have more practices exercises. I couldnt finish this as it was such boring thing see for hours see a guy working in a project doing repeated codes. It could be much more shorter and have more interaction for practice."
  },
  {
    "no": 58,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 58,
    "name": "Vladymyr Klykov",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas, thank you for the great course. I think it's one of the most interesting and useful courses on Udemy (but not the easiest one)) I strongly recommend it to everybody who want to start learning JS, bacuse it has good explanation of JS and many practical exercises! I'll be wait your next lessons."
  },
  {
    "no": 59,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 59,
    "name": "Developer Alex Cruz",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent explanations. Very good that the projects make you practice all the concepts that he is teaching.This course worth it!"
  },
  {
    "no": 60,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 60,
    "name": "Omkar Ghag",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I wanted to learn JS as a part of JS only course and I found this course as an excellent way to do that. I plan to build on this knowledge and gain a deeper understanding of the more intricate parts of JS. I feel I have made a great first step towards that."
  },
  {
    "no": 61,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 61,
    "name": "Stuart Malloch",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is the best coding course that I have taken so far. Jonas has an excellent teaching style and the the course content is a genuine incremental learning experience. He teaches foundational concepts that explain what is really happening behind the scenes, which is essential knowledge for any serious programmer. His wonderfully clear explanations build on knowledge gained in each lecture and he provides a number of really interesting coding challenges that enable us to apply the skills we have learned. Unlike some other courses, his aim is not to simply get us to \"build stuff\", but to teach us the core concepts and principles of JavaScript, up to and including the latest major release (ES2015). He complements his lectures with clear and easy-to-understand slides and diagrams that provide a perfect visual aid to learning. In summary, this course provides the right foundation for students to eventually become genuine experts in JavaScript. Highly recommended!"
  },
  {
    "no": 62,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 62,
    "name": "Virgil Warris",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The instructor explains in easy to understand language not only what javascript commands do, but how they do it. Understanding how things work behind the scenes really helped me understand what was going on up front."
  },
  {
    "no": 63,
    "date": "2017-06-07 04:16:19",
    "fromNow": "17 days ago",
    "user": 63,
    "name": "B. Eng. Markus Hanisch",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like the course a lot. The lectures aren't too long. You can easily follow the course and repeat what you have learned in coding challenges. The examples are well explained. The presentation and language as well as speed of the lecturer is optimal for me to cope with all the new code and rules.Some lectures also contain summaries or short repetition parts to recap what you have learned so far.I can truly recommend this course to anyone who wants to start learning JavaScript."
  },
  {
    "no": 64,
    "date": "2017-06-08 04:16:19",
    "fromNow": "16 days ago",
    "user": 64,
    "name": "Chad A Znoj",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas definitely has a a lot of knowledge of JavaScript in theory and practice, but his presentation and delivery leaves a bit to be desired."
  },
  {
    "no": 65,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 65,
    "name": "Ben Beall",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas presents his material very well.  He works through many real-world examples, using them to teach you how to program.  Worth every penny!"
  },
  {
    "no": 66,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 66,
    "name": "Patrick hinkle",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really enjoyed the way things were explained in the lectures, and really learned a lot doing the projects. Rather than just copying code, he spends a lot of time explaining why you are doing it. Still got a lot to learn, but I would recommend this course to anyone wanting to get a better understanding of how javascript works. Also ES6 section is awesome!"
  },
  {
    "no": 67,
    "date": "2017-06-03 04:16:19",
    "fromNow": "21 days ago",
    "user": 67,
    "name": "Love Modi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Good Course for JS. Jonas takes explains every point in depth. Highly Recommended!!!"
  },
  {
    "no": 68,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 68,
    "name": "Eduardas Vilkas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This was exactly what I wanted from a Javascript course. You get lessons about how the language works and get to do a cool project. Instructor explains why he's doing what he's doing and not just saying \"now do this\". I'm still very new and so I'll be referring to this course a lot to eventually get used to all concepts taught."
  },
  {
    "no": 69,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 69,
    "name": "Evelina",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really liked the \"hands-on\" approach of this course, where you have not only to listen to what is being said, but also write the code (even if sometimes it is repeating the same code what teacher shows) together all the time. In this way you not only have a good cheat sheet, where to look at when forget something, but also that practice, which is so valuable on the market. Thank you for this course!"
  },
  {
    "no": 70,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 70,
    "name": "Jonathan Rhodes",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I took Jonas's other course on web design and was very impressed by his ability to explain things, so I decided to take this course as well.  Jonas is great at making sure you understand exactly what each line of code is doing and allows you to see tasks in JavaScript on a step-by-step basis.  If you are looking for a comprehensive JavaScript course that will teach you what you need to build real web applications, this it."
  },
  {
    "no": 71,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 71,
    "name": "Rakesh Sharma",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Having finished the entire tutorial the following are the things i have to say about this tutorial:1. The instructor does a very good job of teaching  Javascript by using examples and visuals , which is very helpful to understand the concepts.2. There are 2 very good projects which are explained in depth .These are very insightful and helps you get a hands on approach to Javascript programming.Overall I am very happy this tutorial and would DEFINITELY recommend this to any beginner to Javascript."
  },
  {
    "no": 72,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 72,
    "name": "Arlen Nascimento",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "In the beginning it seems the course is very simple and you think it is not worth your time but from the middle to the end it just gets better and better. It's very practical and shows how to solve real problems."
  },
  {
    "no": 73,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 73,
    "name": "Nick Bushby",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Unlike a lot of other JavaScript courses out there, Jonas explains how JS works behind the scenes. By explaining things such as execution context and stack, and hoisting, I gained a deeper understanding of the language.The budget app project is also great introduction in tackling large-scale real-world apps and thinking about how to solve a problem, before digging into the code .I would highly recommend this course to those who really want to deepen their knowledge and understanding of web development and the JavaScript language."
  },
  {
    "no": 74,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 74,
    "name": "Alexandre Guerra",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. I recommend this course for everyone that wants to understand and become a programmer with javascript language."
  },
  {
    "no": 75,
    "date": "2017-06-19 04:16:19",
    "fromNow": "5 days ago",
    "user": 75,
    "name": "Michael Owuor",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Learned a lot more than I expected. Very in depth but explained in a straight forward manner."
  },
  {
    "no": 76,
    "date": "2017-06-21 04:16:19",
    "fromNow": "3 days ago",
    "user": 76,
    "name": "Scott Bishop",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is very thorough with his explanations and manages to describe complex ideas very clearly. The exercises are also strong in that they cover most, if not all, the ideas covered in a section. The half star subtraction is, although not too necessary, in due part to a potential improvement in the course.Being an experienced developer, it would be insightful for Jonas to cover common uses that he encounters in his work. A couple videos about industry use of the language would be incredibly insightful as I know that the way programming is taught is vastly different than how it is used."
  },
  {
    "no": 77,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 77,
    "name": "Daren Green",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course. Well paced and clear - with good examples. Will not hesitate to recommend."
  },
  {
    "no": 78,
    "date": "2017-06-06 04:16:19",
    "fromNow": "18 days ago",
    "user": 78,
    "name": "Pazualo Pazuelo",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "was good lessons not a boring voice and understandable English for all ears. help with my position on web developer front end."
  },
  {
    "no": 79,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 79,
    "name": "Wassily Graf",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "great course, learned a lot. It provided me with a great understanding of javascript. I was looking for a comprehensive course for a while, but this one was super helpful, would definitely recommend it!"
  },
  {
    "no": 80,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 80,
    "name": "Mat Rowles",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Upto lesson 64 now - Jonas does a good job of explaining everything and uses good  examples, good pace of presentation and I appreciated the additional effort to explain the building blocks of JS and not just how to code.  You will have to read around the subject though there are plenty of tutorials out there which should help reduce the confusion..."
  },
  {
    "no": 81,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 81,
    "name": "Brian C",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "If you're looking for a comprehensive introduction to the JavaScript language, this course is for you. Jonas clearly bestows his students with a solid theoretical foundation in JavaScript, balancing theory with practical demonstrations. He provides examples of every covered topic, granting you not merely a superficial run through of the language, but a more genuine understanding of how to actually use the various facets of JavaScript and in different ways.Jonas makes mistakes and gets console errors in just about every lecture, but this is actually a good thing. Through seeing how he quickly but effectively debugs these errors, you learn about common errors and how to solve them. Indeed, while I do not recall if he explicitly states this, I strongly suspect he makes at least most mistakes on purpose just to teach you how to debug your own code better.Definitely take this course if you really want to understand what you're doing in JavaScript!"
  },
  {
    "no": 82,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 82,
    "name": "Nick Vic",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is a great instructor. His approach to teaching is pragmatic: explanations are clear and concise.He also does his best to answer any of your questions in the discussion board, thus, if you don't really understand a concept, you can ask a question and confidently expect an answer.So go ahead and take this course ! It will provide you with a solid  foundation in Javascript."
  },
  {
    "no": 83,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 83,
    "name": "Amy Yarrington",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is an excellent instructor! It's clear he put a lot of time and effort into the preparation and design of this course. He moves at the right pace - not too fast or too slow, and he emphasizes understanding the \"why\" in addition to the \"what\". I will definitely take other courses of his in the future, as well as utilize the resources on his personal website. Thank you Jonas!"
  },
  {
    "no": 84,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 84,
    "name": "Shahar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course, and the most important part to me: teaching through a real life examples/progects"
  },
  {
    "no": 85,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 85,
    "name": "Gary Baker",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I loved the course.  It was very methodical and the instructor took a lot of effort to explain the concepts.  As a suggestion, when highlighting code on the screen, a better highlighting color would make it easier to see what is being pointed out.  As it is, the highlighting is done with a very light gray, which does not have enough contrast to make it easy to see."
  },
  {
    "no": 86,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 86,
    "name": "Jose Scharneck",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Brilliant course indeed.I learnt so much in a very short time.Jonas breaks down complex concepts in great detail which I would say has leveled up my understanding of how the language works. He not only teaches how to use the JavaScript programming language, but also how to think like a programmer."
  },
  {
    "no": 87,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 87,
    "name": "Omar Villa",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Stop reading reviews and get this course!Jonas knows his craft and he shows it in this tutorial. At times some topics might seem overwhelming but that is because Jonas tries his best to equip new programmers with deep concepts that will make you stand out the rest.This an awesome tutorial for a beginner/intermediate programmer. I cannot wait to get the \"JavaScript v2\" to fully master this language!"
  },
  {
    "no": 88,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 88,
    "name": "Telenav Software SRL",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The first part with the Pig Game project is easily more accessible, after that, building the real world project of a budget app is quite overwhelming if you haven't worked with the JS OOP features that much before. The instructor is very open-minded and i like the way he explains, just that his pace is a bit too fast and very few examples are given in the theoretical lessons before using them in the projects. Even though this is a JS script, some HTML and CSS knowledge is required, especially for the coding challenges he's giving us. I'd recommend this course if it's not the first one you took of OOP JS, so that you can get the better picture, otherwise it's quite hard to understand the way the project is created."
  },
  {
    "no": 89,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 89,
    "name": "Ajay Rabeau",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is really great, a lot of the concepts are introduced and scaffolded in a way to make picking it up fairly easy and fun even. The coding challenges are really good and my only opinion regarding how to make it better is to add more of them (especially in the second half of the course) the budget app project introduces a lot of new ideas that while they are covered quite well, the opportunities for a student to develop them more concretely are left in the student's hands to do externally (whereas a bit more of an indepth/guided approach and perhaps a few more coding challenges would really make this course EXCEPTIONAL in every sense of the word) - as it stands now the course is very very good and Jonas is very available to discuss concepts more in depth with you via the Q&A section - highly recommended"
  },
  {
    "no": 90,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 90,
    "name": "Fernando Gonzales-Vigil",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course covers most (if not all) of the main concepts any javascript programmer should know. Module pattern, IIFE functions, closures, planning your programming approach. The only negative thing is just that it's over. Hope to see more courses from him."
  },
  {
    "no": 91,
    "date": "2017-06-06 04:16:19",
    "fromNow": "18 days ago",
    "user": 91,
    "name": "Ronald Johnson",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course! Excellent instructor!! Well worth my time and money just wish Jonas had more courses especially in .net developer because he somehow makes complex topics really simple to understand."
  },
  {
    "no": 92,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 92,
    "name": "Tyler Daniel",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Fantastic course so far! I love the coding challenges; they give me a nice way to practice all the skills I'm learning, with the reassurance that there's a solution there if I'm really stuck. The pacing is perfect, and I'm really enjoying this course. Thanks, Jonas!"
  },
  {
    "no": 93,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 93,
    "name": "DianneLovell",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This class has been really good as a refresher to help me get into Typescript and Angular2.   The instruction is very clear and the main example really gave you a good feel on how to write a larger app in javascript."
  },
  {
    "no": 94,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 94,
    "name": "Sorin Dragomir",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Best Javascript course that I found, so far, on Udemy. Johas is a good professor, because he explains in details, with a lot of examples,  every concept that he shows to us. Plus his way of writing code is very clean and well structured, easy to follow and to understand."
  },
  {
    "no": 95,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 95,
    "name": "René Steeman",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Almost perfect, although it takes long to get help when you hit a wall. The project is very well done and theory behind the code is also well explained."
  },
  {
    "no": 96,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 96,
    "name": "Leo Idler",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I didn't see the ES6 part  yet, but I finished the rest of it including the Budget app. I think that this app is pretty advanced, and some advanced JavaScript language features are sufficiently explained. It could be more fleshed out to allow the student to retain the information better, but it's a good \"crash course\" and serves as both a good way to show off an app you \"made\" in addition to exposing you to much of what JavaScript can do.. before you really get started into understanding the differences between imperative/procedural versus functional programming and how JQuery could make your life easier (or harder, depending on the situation.) One last thing: I wonder couldn't the function names better match the Model/View/Controller naming conventions? I'm not sure if that's commonly used in pure JavaScript, but it's nice that the structure of the Budget app uses them. Well done and I'm really impressed this course was only made in one month."
  },
  {
    "no": 97,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 97,
    "name": "Ethan Lillie",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas has delivered us a comprehensive, well taught class. I left feeling I knew JS well enough to experiment with other technologies, which was my goal."
  },
  {
    "no": 98,
    "date": "2017-06-21 04:16:19",
    "fromNow": "3 days ago",
    "user": 98,
    "name": "Mark",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "An excellent introduction to JavaScript, some nice examples and the pace of the course is just right for a novice."
  },
  {
    "no": 99,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 99,
    "name": "John",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I like the course overall, it's organized and contains a lot of useful information about Javascript. Thanks for a good course!"
  },
  {
    "no": 100,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 100,
    "name": "András Sulykos",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Detailed, but easily understandable. The example projects are fun to develop together with the author."
  },
  {
    "no": 101,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 101,
    "name": "Bidhan Chakma",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course is an excellent course. I am new to JavaScript language. The coding challenge about keeping track of scoring total is entirely out of my league. So, I need to go through some materials again to understand a little bit more. Overall, I really like the course."
  },
  {
    "no": 102,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 102,
    "name": "Jeffery Hammer",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course!.  Jonas does a great job explaining not only the JavaScript language, but the foundation behind what the code is really doing.  Lectures build one upon the other and the Code Challenges are a great way to help you make sure that you understand what you have learned so far."
  },
  {
    "no": 103,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 103,
    "name": "Lino Catucci",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is explaining the lectures very clear. He also tells you what is important to write down to really need to understand the nuts and bolts of JavaScript"
  },
  {
    "no": 104,
    "date": "2016-11-24 04:16:19",
    "fromNow": "7 months ago",
    "user": 104,
    "name": "Leonard Mouillet",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is a great Javascript course with a focus on the \"object\" part of the language and good explanations of concepts like closures, IIFEs, the \"this\" keyword etc...I gave 3 stars after the 1st sectionThen I updated to 4 stars after the 3rd sectionThen I updated to 5 stars after finishing the courseThe last section about ES6 is greatNote: I watched the whole course at x1.5 speed because I thought Jonas was speaking too slowlyNote 2: Some things are missing from this course, like Ajax, Javascript with HTML5, Regular Expressions...I still recommend it with 5 stars. You'll learn a lot."
  },
  {
    "no": 105,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 105,
    "name": "Kieran Hartnett",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Bit slow and basic early on, but it's covering everything thoroughly... can be quite dry in places but the exercises improve over time.Section 6 is excellent to follow along to, and make your own changes/mistakes; I find Section 7 a bit more dry though and it could really use some exercises to break it up (I've not reached the coding challenge at the end yet)."
  },
  {
    "no": 106,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 106,
    "name": "Daniel Salazar",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is very thorough... I feel that taking this course was a great choice for me.  I bought the HTML and CSS course half way through this course because of how comfortable I felt with Jonas´teaching style.  Great job, man!"
  },
  {
    "no": 107,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 107,
    "name": "George Ji",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This is best online training I have ever taken. Clear, on the point and very good examples. The challenges were designed to reflect exact the courses are."
  },
  {
    "no": 108,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 108,
    "name": "Darren Potter",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "If I can understand this, it has to be good.  I have tried to learn JavaScript using other courses and this is the first time I feel anything is actually explained rather than just being told what to type. Well put together, and well paced."
  },
  {
    "no": 109,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 109,
    "name": "Cheryl Rick",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really like the course; not just learning and understand JavaScript better. The code challenges and project are extremely helpful; so as the final exam, which test the JavaScript knowledge I have learned so far."
  },
  {
    "no": 110,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 110,
    "name": "Rory Gaddin",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course with in-depth content suitable for beginners and experienced developers alike"
  },
  {
    "no": 111,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 111,
    "name": "Tobie Wee",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I loved how the course was structured, covering the basics, then theories of ES5, leading in to an introduction of ES2015. The example projects were beautifully designed, such that the HTML and CSS components are already taken care of, allowing the student to focus on the JavaScript component.What I would like to see (if the course were to be updated) is possibly a section on unit testing JavaScript code. This would help me ensure that what I am building is working and reliable. Also, allowing me to do refactoring confidently.That said, overall, I find this course very useful in getting up to speed with JavaScript, and would recommend it to even beginners as well."
  },
  {
    "no": 112,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 112,
    "name": "Noel Selvaratnam",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Awesome Course Jonas, Thank you for explaining it detailed and how and when to use.for a newbie like me just the right course. Thanks again for the well designed course. learning a lot and looking forward for the next section."
  },
  {
    "no": 113,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 113,
    "name": "Joos Huys",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Every aspect of JavaScript is explained in a logical order, and for every aspect it is discussed what it enables you to do, why it is useful, and how it works behind the scenes. Furthermore, architectural principles and methods are discussed so that you don't just learn technical tricks, but know how to apply them in a functional and professional structure."
  },
  {
    "no": 114,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 114,
    "name": "Rahul Hirani",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I always wanted to learn JS, because of the power if gives to you. Jonas, you have been a great mentor all throughout the course. Thank you! Looking forward to your next courses."
  },
  {
    "no": 115,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 115,
    "name": "Nicolas Suero",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I really liked how Jonas explained how actually Javascript works. You can google about different ways to code and get a result but it is not so easy to find a good explanation about how browsers interpret the code.I recommend the course if you are not familiar with concepts like execution contexts, hoisting, closures, etcAlso the speaking of Jonas is perfect. English is not my first language and I was able to understand everything."
  },
  {
    "no": 116,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 116,
    "name": "MrPhillip Cuevas",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Is really good bud I don't know if it need a other readings, the first lectures is only for beginners  but some classes from the level 3 are interesting for advances programmers, good course!"
  },
  {
    "no": 117,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 117,
    "name": "Zach Burgess",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is an extraordinary instructor. He is patient and he provides thorough delivery of JavaScript concepts. Jonas teaches in a manner in which anyone can understand. If you are a beginner, then it makes learning JavaScript not only enjoyable and easy to pickup, but also and smooth and comprehensive training process. Jonas is also great in the fact that he teaches fundamental JS method, as well as teaching how to write code...line by line, and it makes perfect sense in every single lecture. It all comes full-circle, and it is well-worth your time. 5 Stars, easily. I highly recommend for anyone interested in fine-tuning their JavaScript knowledge or total beginners to take this course."
  },
  {
    "no": 118,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 118,
    "name": "Clive Thomas",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Another excellent course by Jonas! Pacing is just about right and Jonas goes \"under the hood\" of Javascript so that you come away with an understanding of HOW the language works as well as how to use it."
  },
  {
    "no": 119,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 119,
    "name": "Tommy Taraldsvik",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is very structured and well organized. Smooth experience!"
  },
  {
    "no": 120,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 120,
    "name": "Michael Donal",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "My 2nd course from this instructor. Great course. I understand JavaScript much better now. More coding challenge would be even better.  Thank you Jonas."
  },
  {
    "no": 121,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 121,
    "name": "Riaan Labuschagne",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very well presented.  It is also nice to see some bugs during coding, and then the explanation on where to find them, and where to look, and why the bug occurred.Good work!  Very hands-on!"
  },
  {
    "no": 122,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 122,
    "name": "John Stegman",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent instructor - takes the time to explain how and why things work and then provides reinforcement of the concept.Highly recommended."
  },
  {
    "no": 123,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 123,
    "name": "Selene Waide",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course is well structured and well presented. I am enjoying it and learning a lot. It could be improved however, by giving students more practice opportunities."
  },
  {
    "no": 124,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 124,
    "name": "Miron Michalko",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Really valuable course, that will teach you not just the basics, but also how JavaScript works, which is essential in order to be good in a programming language."
  },
  {
    "no": 125,
    "date": "2017-04-24 04:16:19",
    "fromNow": "2 months ago",
    "user": 125,
    "name": "Seth van Buren",
    "rating": 3.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course should be built around ES2015 from the start, rather than having it as a separete section"
  },
  {
    "no": 126,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 126,
    "name": "David Bery",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "I actually really enjoyed taking this course. It was a great way to learn the language and Jonas really takes you through the ins and outs of everything. The rating I gave would've been better if not for two small things. One is that some topics he should've gone over a bit more in-depth such as prototypes and why he uses objects for certain tasks. The other thing that could be better is the amount of self challenges that really test your knowledge of the material."
  },
  {
    "no": 127,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 127,
    "name": "John V",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Excellent course, material, presentation. Easy to follow and understand. Practical exercises are very valuable. Very much enjoyed the course and found it to be very valuable."
  },
  {
    "no": 128,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 128,
    "name": "Nitzan",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Johnas is a great instructorHe has deep understanding of how JS works behind the scenesI strongly recommand on this course for people who wants to learn in depths of JS and master the skills of it.There are deep explanations of how the JS works and this is a very unique and core item for developers"
  },
  {
    "no": 129,
    "date": "2017-03-24 04:16:19",
    "fromNow": "3 months ago",
    "user": 129,
    "name": "Chadrick Hinds",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "The course was very comprehensive but also fun!"
  },
  {
    "no": 130,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 130,
    "name": "Aidan Legaspi",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas is an excellent instructor. The way he structures his lectures I can really tell and appreciate that he makes the effort to clarify any topics that he found more difficult to grasp in his learning."
  },
  {
    "no": 131,
    "date": "2017-01-24 04:16:19",
    "fromNow": "5 months ago",
    "user": 131,
    "name": "Sebastian Bialek",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "That was a awesome curse! If you are looking for a teacher who teach you everything about JS then dont think about searching another course! Just go and press \"Buy Course\" to start learing!"
  },
  {
    "no": 132,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 132,
    "name": "Prak Savoeun",
    "rating": 4.5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Lesson planing and lecture are clear, but i am reluctant to give 5 stars as of now. I will reconsider when i reach the end of the course."
  },
  {
    "no": 133,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 133,
    "name": "Donovan Loperena",
    "rating": 4,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Video and audio quality is respectable and the lessons so far have been quite thorough. I wish more practical applications were given and that a section was devoted to JavaScripts uses outside of WebDevelopment (if there are any). The projects and 'quizzes' are useful in solidifying skills learned from the previous lessons. Final Verdict: Highest quality coding course I've taken on Udemy so far, though it doesn't seem to cover as much as I wish it would regarding programming concepts and use cases for this language in particular (Outside of its use as an insertable HTML script element)."
  },
  {
    "no": 134,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 134,
    "name": "Tom MacLeod",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "This course does a great job covering what is required to understand JavaScript and how to use it.  I would recommend this course to anyone wanting to understand the fundamentals of this programming language."
  },
  {
    "no": 135,
    "date": "2017-05-24 04:16:19",
    "fromNow": "a month ago",
    "user": 135,
    "name": "Gil Grunberg",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Very informative course with real life examples of programming and bugs"
  },
  {
    "no": 136,
    "date": "2017-02-24 04:16:19",
    "fromNow": "4 months ago",
    "user": 136,
    "name": "Dragan Sevo",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "In addition to theory, leads me through practical examples ..."
  },
  {
    "no": 137,
    "date": "2017-06-03 04:16:19",
    "fromNow": "21 days ago",
    "user": 137,
    "name": "Adrian Castellanos",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great explanations and examples and gives you the tools to continue learning on your own."
  },
  {
    "no": 138,
    "date": "2017-06-18 04:16:19",
    "fromNow": "6 days ago",
    "user": 138,
    "name": "Andrew Goss",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Jonas does an excellent job of mixing theory with coding practice and most importantly, coding challenges and real-world applications. He is great at breaking down how JavaScript works at its core. He speaks slowly with a clear voice and is a top-notch instructor."
  },
  {
    "no": 139,
    "date": "2016-12-24 04:16:19",
    "fromNow": "6 months ago",
    "user": 139,
    "name": "Jan-Willem van Helvoirt",
    "rating": 5,
    "helpful": false,
    "indent": 0,
    "origin": "",
    "content": "Great course!! Jonas delivers a wel structured course in which he deeply explains everything step by step. I like the planning and architecture part of the budget app very much. It shows how to structure your application. I'm happy to see more courses from Jonas in the future."
  }
]