{
  "no": 5,
  "title": "The Complete Android N Developer Course",
  "subtitle": "Learn to make and market apps for Android 7 Nougat by building real apps including Uber, Whatsapp and Instagram clones.",
  "authors": [
    {
      "no": 6,
      "name": "Rob Percival"
    },
    {
      "no": 7,
      "name": "Marc Stock"
    }
  ],
  "average": 4.6,
  "reviews": 3635,
  "enrolled": 29680,
  "price": 200,
  "category": "Development",
  "picture": "951618_0839_2.jpg",
  "updated": 1496156400000,
  "description": "<div class=\"js-simple-collapse-inner\" data-purpose=\"collapse-description-text\">\r\n                    <div class=\"description__title\">\r\n                        \r\n                    <\/div>\r\n\r\n                    <p>\r\n\r\n  <\/p>\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>So you want to build your own apps?<br><\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>And you want to build them… from the comfort of your home… in your own time… without having to attend class… or wade through endless textbooks (or online guides). \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>Am I right?<\/em>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>And let me guess: you <em>only<\/em> want the latest technology, software and techniques—because you’ve got big plans, big ideas—and let’s be honest… you’re impatient and you want to jump the queue?\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>My name’s Rob Percival, creator of the world’s best-selling online coding courses… andI’ve designed<strong class=\"redactor-inline-converted\"> The Complete Android N&nbsp;Developer Course<\/strong>, especially for YOU.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Building on last year’s runaway success: The Complete Android Developer Course (Udemy’s best-ever-selling Android course, with over 50,000 happy students), <strong class=\"redactor-inline-converted\">The Complete Android N&nbsp;Developer Course<\/strong>&nbsp;has been refined, honed and microscopically polished to deliver even more valuable content, all designed for the latest Android 7.\r\n\r\n  <\/p><p>A huge range of technologies are covered, including open source&nbsp;Parse Server, Firebase, Admob, GDX&nbsp;(game development), Bluetooth and a whole lot more.<\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>This time, using hot-off-the-press <strong>Android Nougat<\/strong> (putting unparalleled levels of performance, productivity and security directly into your hands), <strong class=\"redactor-inline-converted\">The Complete Android N&nbsp;Developer Course&nbsp;<\/strong>includes building a WhatsApp clone PLUS three <em>brand spanking new<\/em> chapters on how to market your apps—and start piling in the cash. \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">What’s stopping you from signing up to today?<\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You don’t have enough time: <em>Not an issue<\/em>. We’ve designed this course so you can learn everything you need in as little as SIX WEEKS.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You’re still weighing up the value: <em>Listen. <\/em>We’ve made this course bigger, better and more affordable—with even more content and more insider money-making tips—than EVER before. In fact, if you don’t 100% get everything you need from it… we’ll give you your MONEY BACK.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You don’t have any previous experience: <em>Seriously, not a problem<\/em>. This course is expertly designed to teach everyone from complete beginners, right through to pro developers.&nbsp; <em>(And yes, even pro developers take this course to quickly absorb the latest skills, while refreshing existing ones).<\/em>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>“Detailed instructions for beginners, easy to follow as all Rob's courses. I would definitely recommend this course :)”<\/em>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>“As a full time developer, I dreamed of writing a game, but never got anywhere. Too much analysis, object-oriented development training. Then Rob built flappy birds right before my eyes. Now I have a game going into the app store. This course is great for pro-developers too!”<\/em>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Straight up: No other course will take you to expert app developer in as fast a time as this. <em>Have other courses done this for you?<\/em>&nbsp; \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">Buy this course today and this is what you’ll get. <\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Firstly, using Java and Android Studio, I'll teach you how to build real, marketable apps by cloning WhatsApp, Uber and Instagram.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>And by the way—just like my other record-smashing courses—this course is project based, which means you build your own apps in REALTIME…As. You. Learn. &nbsp;\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Over half a million students tell me this is THE most motivating and effective way to absorb information.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You'll start by downloading Android Studio and building an easy-peasy Currency Converter app.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Next up: you'll build a Favourite Places app and a Brain Training app, before working your way up to WhatsApp, Uber and Instagram clones&nbsp;—&nbsp;using Parse Server.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You'll also get a full guide on submitting your apps to Google Play, plus THREE BRAND NEW WALK-THROUGH chapters explaining exactly how to effectively market your apps—and generate revenue with Google Ads.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You'll learn all the latest Android N features, including App Permissions and Android Pay.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; And finally, we'll take a look at Android Wear - the future of wearable computing.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">Can you believe you get all this (and more) for just $200?<\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>“Amazing course that teaches you everything you want to learn about making android apps from the basic to the advanced. Even if you have no knowledge you can learn so much from this course.”<\/em>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">What else will I get if I buy this course now?\r\n\r\n \r\n\r\n <\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; FULL LIFETIME ACCESS (including video downloads and updates) for a ludicrously affordable one-off fee. \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n<p>· &nbsp; &nbsp; &nbsp;$50 Amazon AWS&nbsp;Credit for hosting your own social apps.<br><\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PEACE OF MIND: Learn from the creator of three of the most popular online courses, successfully teaching over 200,000 students and receiving 10,000 5* reviews.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; CONTINUOUS PROJECT SUPPORT: Whenever you need it, in the course forums.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; SUPERIOR LEARNING: Build your own real apps as you go, with not a yawnsome programming concept in sight.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; £300 WORTH OF EXCLUSIVE APP TEMPLATES, icons and backgrounds (designed for Android N) \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ONE YEAR’S FREE WEB HOSTING on Eco Web Hosting's Advanced Package, worth £119. *Limited to one year per student not per course*\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>“So much more understandable than the other 6+ classes I have taken elsewhere. This course is a must! Thank you!”<\/em>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">Why learn to make Android apps?<\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Android is without a doubt THE biggest mobile platform in the world, with over 80% market share and over 1 billion devices sold in 2016&nbsp;alone.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You can develop for Android on a Windows, Mac or Linux computer.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Java is a fantastic language to learn, allowing you to make apps for PC, Mac and the web, as well as Android.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Android app discovery is way superior to the App Store, so your app has a far better chance of getting seen—and bought.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ad-based revenue is a lot more common on Android than on iOS, and a cinch to set up with Google Ads.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>“Top class professional presentation of a well-constructed course. Consistently pitched at the right level to remain interesting and challenging, this course quickly brings the student to a point where generating their own applications is realistic and fun<\/em>.”\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">Who is this for?<\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Anyone who wants to learn to code to become an app developer: This is a&nbsp;complete&nbsp;course, just like my Complete Web, iOS and Apple Watch courses. So once you’re up and coding like a demon app developer, it’ll ALSO teach you how to <em>make money from your apps<\/em>. \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Sound good?\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>It’s also for anyone who wants to understand how computers work: Learning to code is so much more than being able to make apps - knowing how computers work opens news doors to our awesome digital world\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>“Rob has a knack for explaining material in an easily digestible way. The mini challenges he presents within his lectures are an excellent way to commit things to memory. The lectures are well paced - fast enough to maintain your interest but not so fast that you get left in the dust!”<\/em>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">Is this course right for me?<\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Look: if you’re still not convinced, I urge you to check out my 5* reviews. There’s over half a million of them on Udemy, alone.&nbsp; No other course on the World Wide Web has achieved such consistent ratings. \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>Coding and app development is the future<\/em>. Whether you’ve got plans to create the next Facebook, or you want to get ahead at work and increase your earning potential, I GUARANTEE anyone will find <strong class=\"redactor-inline-converted\">The Complete Android N&nbsp;Developer Course<\/strong>&nbsp;course show-stoppingly useful.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>A quick summary of why <strong class=\"redactor-inline-converted\">The Complete Android N&nbsp;Developer Course<\/strong>&nbsp;is the number one resource for budding app developers, like you:\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Time-tested, quick-to-pick up learning strategies\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Quality insider tips, that only the pros normally know\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Home-based learning—so you can go as fast or slow as you please\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Simple, jargon-free language and HD definition\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">Who Am I?<\/strong>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>I'm Rob. \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>I run three of the most successful online coding courses on the planet, and I’m so excited to share them with you.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>I have a degree in Mathematics from Cambridge University, and am a web and app developer based in Cambridge, UK. Since working as a secondary school teacher for 10 years, I’ve never lost my love for teaching.\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>Maybe that’s why my goal is so simple: To get as many people benefitting from app development as possible. But more importantly, that my courses are enjoyable and deliver tangible results for you… Today and tomorrow. \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>These are the things that drive me to keep pushing what’s possible in online learning. \r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>OK, let’s begin…\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p><em>“Outstanding! Rob delivers high quality content once more. It's not just the endless content and the clear explanations that you get but more importantly the confidence that you build. A must for any developer.”<\/em><\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n\r\n\r\n\r\n\r\n<p>\r\n\r\n  <\/p>\r\n\r\n                    \r\n                        <div class=\"audience\" data-purpose=\"course-audience\">\r\n                            <div class=\"audience__title\">\r\n                                Who is the target audience?\r\n                            <\/div>\r\n                            <ul class=\"audience__list\">\r\n                                \r\n                                    <li>Anyone who wants to be an app developer: This is a complete course, just like my Complete Web, iOS and Apple Watch courses. It will teach you how to make money from your apps as well as how to code.<\/li>\r\n                                \r\n                                    <li>Anyone who wants to learn to code: Java is a fantastic language to learn how to code with.<\/li>\r\n                                \r\n                                    <li>Anyone who wants to understand how computers work: Learning to code is so much more than being able to make apps - knowing how computers work is your key to a hugely powerful world.<\/li>\r\n                                \r\n                            <\/ul>\r\n                        <\/div>\r\n                    \r\n                <\/div>"
}
