{
  "no": 1,
  "title": "Docker Mastery: The Complete Toolset From a Docker Captain",
  "subtitle": "v17.03 Latest! Build, compose, deploy, and manage Docker containers from development to DevOps based Swarm clusters",
  "authors": [
    {
      "no": 1,
      "name": "Bret Fisher"
    },
    {
      "no": 2,
      "name": "Docker Captain Program"
    }
  ],
  "average": 4.7,
  "reviews": 592,
  "enrolled": 5148,
  "price": 200,
  "category": "Development",
  "picture": "1035000_c1aa.jpg",
  "updated": 1496156400000,
  "description": "<div class=\"js-simple-collapse-inner\" data-purpose=\"collapse-description-text\">\r\n                    <div class=\"description__title\">\r\n                        \r\n                    <\/div>\r\n\r\n                    <p><strong>Be ready for the Dockerized future<\/strong>, where nearly all software is developed and deployed in containers.&nbsp;Welcome to the most <strong>complete and up-to-date<\/strong> course for learning and using Docker end-to-end, from development and testing, to deployment and production. <strong>Taught by a Docker Captain and&nbsp;consultant.<\/strong><br><\/p>\r\n\r\n\r\n\r\n<p><strong>Just starting out with Docker?<\/strong> Perfect. This course starts out assuming you're new to containers.<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Or: Using Docker now and need to deal with real-world problems?<\/strong> I'm here for you! See my production topics around Swarm, secrets, logging, blue\/green, and more.<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Why should you learn from me? Why trust me to teach you the <em>best<\/em> ways to use Docker? <\/strong>\r\n\r\n(Hi, I'm Bret, please allow me to talk about myself for a sec):<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<ul>\r\n<li><strong>I'm A Practitioner. Welcome to the real world:<\/strong> I've got 20 years of sysadmin and DevOps experience, over 30 certifications, and have been using Docker and the container ecosystem for my consulting clients and my own companies since Docker's early days. <strong>Learn from someone who's run hundreds of containers across dozens of projects and organizations<\/strong>, and lived to tell the tale.<\/li>\r\n<li><strong>I'm An Educator. Learn from someone who knows how to make a&nbsp;syllabus:<\/strong> I want to help you. People say I'm good at it. For the last few years <strong>I've trained hundreds of people on using Docker in workshops, conferences, meetups, and one-on-one. See me teach at events like DockerCon, O'Reilly Velocity, Revolution, and Strange Loop<\/strong>. I hope you'll decide to learn with me, and join the fantastic online Docker community.<\/li>\r\n<li><strong>I Lead Communities. <\/strong>Also, I'm a Docker Captain, meaning that <strong>Docker Inc. thinks I know a thing or two about Docker and that I do well in sharing it with others<\/strong>. In the real-world: I help run two local meetups in our fabulous tech community in Norfolk\/Virginia Beach, USA on Docker and Code for America. I help online: usually in Slack, Gitter, Twitter, and IRC for Docker and other DevOps topics, where I learn from and help others.<\/li><\/ul>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>&nbsp;&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><em>\"There are a lot of Docker courses on Udemy -- but ignore those, Bret is the single most qualified person to teach you.\" - Kevin Griffin<\/em><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Giving Back: 3% of my profit on this course will be donated to supporting open source and protecting our freedoms online!&nbsp;<\/strong>This course is only made possible by the amazing people creating open source. I'm standing on the shoulders of (open source) giants! Donations will be split between the Electronic Frontier Foundation and Free Software Foundation. Look them up. They're awesome!<br><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>This is a living course, and will be updated as Docker features and workflows change.<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>This course is designed to be fast at getting you started but also get you deep into the \"why\" of things. Simply the fastest and best way to learn the latest docker skills. Look at the scope of topics in the Session and see the breadth of skills you will learn.<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Also included is a private Slack Chat group for getting help with this course<\/strong> and continuing your Docker and DevOps learning with help from myself and other students.<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><em>\"Bret's course is a level above all of those resources, and if you're struggling to get a handle on Docker, this is the resource you need to invest in.\" -&nbsp;Austin Tindle<\/em><br><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Some of the many cool things you'll do in this course:<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<ul>\r\n<li>Edit web code on your machine while it's served up in a container<\/li>\r\n<li>Lock down your apps in private networks that only expose necessary ports<\/li>\r\n<li>Create a 3-node Swarm cluster in the cloud<\/li>\r\n<li>Use Virtual IP's for built-in load balancing in your cluster<\/li>\r\n<li>Optimize your Dockerfiles for faster building and tiny deploys<\/li>\r\n\r\n\r\n<li>Build\/Publish your own custom images based on GitHub commits<\/li>\r\n\r\n<li>Create your own image registry<\/li>\r\n<li>Use Swarm Secrets to encrypt your environment configs, even on disk<\/li>\r\n<li>Deploy container updates in a blue\/green deployment design<\/li>\r\n<li>Create the config utopia of a single YAML file for local dev, CI testing, and prod cluster deploys<\/li>\r\n\r\n<li>And so much more...<\/li><\/ul>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>&nbsp;<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>After taking this course, you'll be able to:<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<ul><li>Use Docker in your daily developer and\/or sysadmin roles<\/li><li>Make&nbsp;Dockerfiles and Compose files<\/li><li>Build&nbsp;multi-node Swarm clusters and deploying H\/A containers<\/li><li>Build a workflow of using Docker in dev, then test\/CI, then production with yaml<\/li><li>Protect your keys, TLS&nbsp;certificates, and passwords with encrypted secrets<\/li><li>Keep your Dockerfiles and images small, efficient, and fast<\/li><li>Develop locally while your code runs in a container<\/li><li>Protect important persistent data in volumes and bind mounts<\/li><li>Lead your team into the future with the latest Docker container skills!<\/li><\/ul>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>&nbsp;<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Extra things that come with this course:<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<ul>\r\n<li>Access to the course Slack team, for getting help\/advice from me and other students.<\/li>\r\n<li>Bonus videos I put elsewhere like YouTube.<\/li>\r\n<li>Tons of reference links to supplement this content.<\/li>\r\n<li>Updates to content as Docker changes their features on these topics.<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>&nbsp;<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Course Launch Notes:&nbsp;(3\/31\/2017)&nbsp;Today this course launches!&nbsp;Whew. More sections are coming as I&nbsp;finish editing them.&nbsp;Adding&nbsp;in May:<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<ul><li>Section 7:&nbsp;Container Registries: Image Storage and Distribution<\/li><li>Section 8:&nbsp;Level Up Your Images and Containers For More Complex Requirements<\/li><li>Section 9:&nbsp;Application Design, CI\/CD and Developer Workflows<\/li><li>Section 10:&nbsp;Advanced Networking: When The Defaults Aren't Enough<\/li><li>Section 11:&nbsp;Operating Docker and Swarm in Production<\/li><li>Maybe more...<\/li><\/ul>\r\n\r\n                    \r\n                        <div class=\"audience\" data-purpose=\"course-audience\">\r\n                            <div class=\"audience__title\">\r\n                                Who is the target audience?\r\n                            <\/div>\r\n                            <ul class=\"audience__list\">\r\n                                \r\n                                    <li>Software developers, sysadmins, IT pros, and operators at any skill level.<\/li>\r\n                                \r\n                                    <li>Anyone who makes, deploys, or operates software on servers.<\/li>\r\n                                \r\n                            <\/ul>\r\n                        <\/div>\r\n                    \r\n                <\/div>"
}