{
  "no": 2,
  "title": "The Web Developer Bootcamp",
  "subtitle": "The only course you need to learn web development - HTML, CSS, JS, Node, and More!",
  "authors": [
    {
      "no": 3,
      "name": "Colt Steele"
    }
  ],
  "average": 4.7,
  "reviews": 23708,
  "enrolled": 107453,
  "price": 200,
  "category": "Development",
  "picture": "625204_436a_2.jpg",
  "updated": 1496156400000,
  "description": "<div class=\"js-simple-collapse-inner\" data-purpose=\"collapse-description-text\">\r\n                    <div class=\"description__title\">\r\n                        \r\n                    <\/div>\r\n\r\n                    <p>Hi! Welcome to the Web Developer Bootcamp, the <strong>only course you need to learn web development. <span><\/span><\/strong>There are a lot of options for online developer training, but this course is without a doubt the most comprehensive and effective on the market.  Here's why:<\/p><ul><li>This is the only online course taught by a professional bootcamp instructor.<\/li><li><strong>94% of my bootcamp students go on to get full-time developer jobs<\/strong>. Most of them are complete beginners when I start working with them.<\/li><li>The previous 2 bootcamp programs that I taught cost <strong>$14,000 and $21,000<\/strong>.  This course is just as comprehensive but with brand new content for a fraction of the price.<\/li><li>Everything I cover is up-to-date and relevant to today's developer industry.<strong> No PHP or other dated technologies. This course does not cut any corners.<\/strong><\/li><li>This is the only complete beginner full-stack developer course that covers NodeJS.<\/li><li>We build 13+ projects, including a <strong>gigantic production application <\/strong>called YelpCamp. No other course walks you through the creation of such a substantial application.<\/li><li>The course is <strong>constantly updated<\/strong> with new content, projects, and modules.  Think of it as a subscription to a never-ending supply of developer training.<\/li><li>You get to meet my dog Rusty!<\/li><\/ul><p>When you're learning to program you often have to sacrifice learning the exciting and current technologies in favor of the \"beginner friendly\" classes.  With this course, you get the best of both worlds.  This is a course designed for the complete beginner, yet it covers some of the most exciting and relevant topics in the industry.<\/p><p>Throughout the course we cover tons of tools and technologies including:<\/p><ul><li><span><strong>HTML5<\/strong><\/span><\/li><li><span><strong>CSS3<\/strong><\/span><\/li><li><span><strong>JavaScript<\/strong><\/span><\/li><li><span><strong>Bootstrap<\/strong><\/span><\/li><li>SemanticUI<\/li><li>DOM Manipulation<\/li><li><span><strong>jQuery<\/strong><\/span><\/li><li>Unix(Command Line) Commands<\/li><li><span><strong>NodeJS<\/strong><\/span><\/li><li>NPM<\/li><li><span><strong>ExpressJS<\/strong><\/span><\/li><li>REST<\/li><li><span><strong>MongoDB<\/strong><\/span><\/li><li>Database Associations<\/li><li><span><strong>Authentication<\/strong><\/span><\/li><li>PassportJS<\/li><li>Authorization<\/li><\/ul><p>This course is also unique in the way that it is structured and presented. Many online courses are just a long series of \"watch as I code\" videos.  This course is different. I've incorporated everything I learned in my years of teaching to make this course not only more effective but more engaging. The course includes:<br><\/p><ul><li>Lectures<\/li><li>Code-Alongs<\/li><li>Projects<\/li><li>Exercises<\/li><li>Research Assignments<\/li><li>Slides<\/li><li>Downloads<\/li><li>Readings<\/li><li>Too many pictures of my dog Rusty<\/li><\/ul><p>If you have any questions, please don't hesitate to contact me.  I got into this industry because I love working with people and helping students learn.  Sign up today and see how fun, exciting, and rewarding web development can be!<\/p>\r\n\r\n                    \r\n                        <div class=\"audience\" data-purpose=\"course-audience\">\r\n                            <div class=\"audience__title\">\r\n                                Who is the target audience?\r\n                            <\/div>\r\n                            <ul class=\"audience__list\">\r\n                                \r\n                                    <li>This course is for anyone who wants to learn about web development, regardless of previous experience<\/li>\r\n                                \r\n                                    <li>It's perfect for complete beginners with zero experience<\/li>\r\n                                \r\n                                    <li>It's also great for anyone who does have some experience in a few of the technologies(like HTML and CSS) but not all<\/li>\r\n                                \r\n                                    <li>If you want to take ONE COURSE to learn everything you need to know about web development, take this course<\/li>\r\n                                \r\n                            <\/ul>\r\n                        <\/div>\r\n                    \r\n                <\/div>"
}
