{
  "no": 4,
  "title": "iOS 10 & Swift 3: From Beginner to Paid Professional",
  "subtitle": "The most comprehensive course on iOS development - become a master of app development",
  "authors": [
    {
      "no": 5,
      "name": "Mark Price"
    }
  ],
  "average": 4.5,
  "reviews": 9534,
  "enrolled": 53246,
  "price": 200,
  "category": "Development",
  "picture": "892102_963b.jpg",
  "updated": 1490886000000,
  "description": "<div class=\"js-simple-collapse-inner\" data-purpose=\"collapse-description-text\">\r\n                    <div class=\"description__title\">\r\n                        \r\n                    <\/div>\r\n\r\n                    <p>Welcome to the world's most comprehensive course on iOS development. This course is designed like an in-person coding bootcamp to give you the most amount of content and help with the least amount of cost.<\/p>\r\n\r\n<p>Here are some of the things you'll be able to do after taking this course:<\/p>\r\n\r\n\r\n\r\n<ul><li>Submit apps to the app store<\/li><li>Understand programming &amp;&nbsp;basic algorithms<\/li><li>Work fluently with Swift 3 &amp;&nbsp;iOS 10<\/li><li>Apply to jr iOS development jobs<\/li><li>Work as an iOS contractor<\/li><\/ul>\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">If you are absolutely new to programming you should start at the beginning of the course and go to the end.<\/strong><\/p>\r\n\r\n\r\n\r\n<p>I've designed this course to take you down a guided learning path. Lectures are not broken out by specific topics.&nbsp;You build apps and then learn a ton of principles within those apps.&nbsp;So don't skip around!<\/p>\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">If you already know Swift then you can skip the Swift section since the changes between Swift 2 and Swift 3 are minor.<\/strong><br><\/p>\r\n\r\n\r\n\r\n<p>Swift 3 broke a lot of things in Swift 2.&nbsp;We cover those changes periodically throughout the course so don't worry about watching Swift videos again if you already know Swift.<\/p>\r\n\r\n\r\n\r\n<p><strong class=\"redactor-inline-converted\">If you are a student of iOS 9:&nbsp;From Beginner to Paid Professional then feel free to start taking this iOS 10 course.<\/strong><\/p>\r\n\r\n\r\n\r\n<p>Keep in mind that this iOS 10 course has a bunch of new apps. So there is a HUGE benefit to ALSO&nbsp;go through the iOS&nbsp;9 course - or you'll miss out on awesome content.<\/p>\r\n\r\n<p><strong>Don't forget to join the free live community where you can get free help anytime from other students and teacher's aides.<\/strong><\/p>\r\n\r\n\r\n\r\n<p><br><\/p>\r\n\r\n                    \r\n                        <div class=\"audience\" data-purpose=\"course-audience\">\r\n                            <div class=\"audience__title\">\r\n                                Who is the target audience?\r\n                            <\/div>\r\n                            <ul class=\"audience__list\">\r\n                                \r\n                                    <li>If you are an absolute beginner to coding take this course<\/li>\r\n                                \r\n                                    <li>If you are an absolute beginner to iOS or mobile development then take this course<\/li>\r\n                                \r\n                            <\/ul>\r\n                        <\/div>\r\n                    \r\n                <\/div>"
}
