{
  "no": 12,
  "title": "Become a SuperLearner V2: Learn Speed Reading & Boost Memory",
  "subtitle": "Learn faster & more effectively by harnessing the skills of the world's fastest readers & memory record-holders. NEW V2!",
  "authors": [
    {
      "no": 14,
      "name": "Jonathan Levi"
    },
    {
      "no": 15,
      "name": "Dr. Lev Goldentouch"
    },
    {
      "no": 16,
      "name": "Prof. Anna Goldentouch"
    }
  ],
  "average": 4.5,
  "reviews": 4315,
  "enrolled": 37430,
  "price": 145,
  "category": "Personal Development",
  "picture": "591930_e9a5_2.jpg",
  "updated": 1488207600000,
  "description": "<div class=\"js-simple-collapse-inner\" data-purpose=\"collapse-description-text\">\r\n                    <div class=\"description__title\">\r\n                        \r\n                    <\/div>\r\n\r\n                    <p><strong>One of Udemy's Top Selling Courses of All Time - New &amp; Improved Version 2.5 for 2017! <\/strong><\/p>\r\n\r\n<p><em>After over 50,000 satisfied students in our original course, Become a SuperLearner has been updated, upgraded, and improved from the ground up for 2016. <\/em><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>This course will teach you how to hack your learning, reading, and memory skills, empowering you to learn anything and everything faster and more effectively. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>Whether you're a student, a professional, or simply embarking on a new hobby, you are forced to grapple with an every-increasing amount of information and knowledge. In fact, it's believed that one week's worth of the New York Times contains more information than people 100 years ago encountered in their entire lives. We've all experienced the frustration of an ever-growing reading list, struggling to learn a new language, or forgetting things you learned in even your favorite subjects. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>Anyone can develop Super-Learning skills! <\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>This course is about improving your ability to learn new skills or information <em>quickly and effectively<\/em>. We go far beyond the kinds of \"speed-reading\" (or glorified skimming) you may have been exposed to, diving into the <em>actual cognitive and neurological factors <\/em>that make learning easier and more successful. We also give you advanced memory techniques to grapple with the huge loads of information you'll be able to process. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>You'll learn how to input and retain information in a whole new way - a faster, better way <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>The core of this SuperLearning course involves 3 \"Super Skills\":  <\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<ul>\r\n<li>Speed-reading with high (80%+) comprehension and understanding<\/li>\r\n<li>Memory techniques for storing and recalling vast amounts of information quickly and accurately<\/li>\r\n<li>Developing the cognitive infrastructure to support this flood of new information long-term<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>However, the SuperLearning skills you'll learn in this course are applicable to many aspects of your every day life, from remembering phone numbers to acquiring new skills or even speaking new languages. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>How this new course will change your life and triple your learning speed: <\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>The sad irony is that in order to learn most of these superlearning skills and memory techniques in the past, you had to read dozens of books and psychological journals. Or, you had to hire an expensive private tutor who specializes in superlearning. That's what I did. And it changed my life. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>Fortunately, my instructors (experts in the fields of superlearning, memory techniques, and speed-reading) agreed to help me transform their materials into the first ever digital course. That course, <em>Become a SuperLearner 1.0, <\/em>took the internet by storm, becoming one of the top courses in the history of Udemy, and resulting in a bestselling book and top-ranking podcast. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p><strong>How is it different from SuperLearner 1.0?<\/strong><\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>Over the last 2 years and 50,000+ students, we’ve had tens of thousands of data points and pieces of feedback, helping us improve both our methodology and our teaching practices. This new course has more (and better) content than ever before, including:<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<ul>\r\n<li>Completely re-written lectures emphasizing clarity and engagement!<\/li>\r\n<li>All-new lectures on topics never before covered!<\/li>\r\n<li>Hands-on demonstration videos for every major concept<\/li>\r\n<li>Dramatically improved video and audio quality<\/li>\r\n<li>Interactive worksheets to print and complete<\/li>\r\n<li>Even MORE supplemental resources!<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>We can confidently say that this is the best, most comprehensive accelerated learning product we’ve ever released on Udemy.<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>The course will require 2-3 hours of memory and speed-reading practice and training per week, and last roughly 7-9 weeks. It won't be easy - but if you put in the work, you are guaranteed to succeed. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>In addition to the lectures, there is an additional 1.5 hours of supplemental video content from TED, YouTube, and other sources which are considered part of the course curriculum. <\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>\"SuperLearner\" is a trademark of SuperHuman Enterprises, Inc.<\/p>\r\n\r\n                    \r\n                        <div class=\"audience\" data-purpose=\"course-audience\">\r\n                            <div class=\"audience__title\">\r\n                                Who is the target audience?\r\n                            <\/div>\r\n                            <ul class=\"audience__list\">\r\n                                \r\n                                    <li>Ideal for new students AND existing students of SuperLearner 1.0<\/li>\r\n                                \r\n                                    <li>Anyone who has ever wished they could learn more effectively<\/li>\r\n                                \r\n                                    <li>People who love to learn<\/li>\r\n                                \r\n                                    <li>Students<\/li>\r\n                                \r\n                                    <li>Professionals<\/li>\r\n                                \r\n                                    <li>Hobbyists<\/li>\r\n                                \r\n                            <\/ul>\r\n                        <\/div>\r\n                    \r\n                <\/div>"
}
